{"title": "Why Vietnam celebrates the Year of the Cat this Lunar New Year : NPR", "content": "Why Vietnam celebrates the Year of the Cat this Lunar New Year : NPR Accessibility links Skip to main content Keyboard shortcuts for audio player Open Navigation Menu NPR Shop > Close Navigation Menu Home News Expand/collapse submenu for News National World Politics Business Health Science Climate Race Culture Expand/collapse submenu for Culture Books Movies Television Pop Culture Food Art & Design Performing Arts Life Kit Music Expand/collapse submenu for Music Best Music of 2022 Tiny Desk #NowPlaying All Songs Considered Music Features Live Sessions Podcasts & Shows Expand/collapse submenu for Podcasts & Shows Daily Morning Edition Weekend Edition Saturday Weekend Edition Sunday All Things Considered Fresh Air Up First Featured Embedded Planet Money Life Kit NPR's Book of the Day More Podcasts & Shows Search NPR Shop Best Music of 2022 Tiny Desk #NowPlaying All Songs Considered Music Features Live Sessions About NPR Diversity Organization Support Careers Connect Press Ethics Why Vietnam celebrates the Year of the Cat this Lunar New Year This Lunar New Year, the Vietnamese will observe a different animal in the zodiac, the cat. The reasons are murky: could be linguistics or the landscape — or maybe cats are just plain friendlier. Culture While many ring in the Year of the Rabbit, Vietnam celebrates the cat January 21, 20237:01 AM ET Suzanne Nuyen Enlarge this image Cat stickers hang on display last week in Hanoi, Vietnam. The Lunar New Year begins on Sunday and marks the Year of the Cat in Vietnam and the Year of the Rabbit in China, South Korea and other East and Southeast Asian countries. Linh Pham/Getty Images hide caption toggle caption Linh Pham/Getty Images Cat stickers hang on display last week in Hanoi, Vietnam. The Lunar New Year begins on Sunday and marks the Year of the Cat in Vietnam and the Year of the Rabbit in China, South Korea and other East and Southeast Asian countries. Linh Pham/Getty Images The Lunar New Year begins on Sunday, and more than a billion people will ring in a fresh year, prompting one of the world's largest annual migrations as observers travel for family reunions. The holiday is celebrated throughout much of Asia and the Asian diaspora, including among those of Vietnamese, Chinese and Korean descent. The holiday is also celebrated in Mongolia, but in February, as the date is determined with a different calendar system there. Culture Lunar New Year traditions evolve in the Asian diaspora While almost everyone will ring in the Year of the Rabbit in 2023, Vietnam is welcoming the Year of the Cat. Why does Vietnam differ from the rest of the world this year? The origins of the Year of the Cat are murky. Enlarge this image People eat ice cream next to a large cat statue at a shop in Hanoi this week. Cat statues of all sizes and styles line the streets of Vietnam ahead of the Lunar New Year. Nhac Nguyen/AFP via Getty Images hide caption toggle caption Nhac Nguyen/AFP via Getty Images People eat ice cream next to a large cat statue at a shop in Hanoi this week. Cat statues of all sizes and styles line the streets of Vietnam ahead of the Lunar New Year. Nhac Nguyen/AFP via Getty Images One explanation has to do with linguistics, according to Doan Thanh Loc, a cultural consultant at the Southern Jade Pavilion Cultural Center in Vietnam. It's widely believed that the Chinese word for rabbit sounds like the Vietnamese word for cat, but that's not exactly true. The date for Vietnam's Lunar New Year, also called Tet Nguyen Dan, is determined using the Chinese lunisolar calendar. Months are set using the orbits of the moon and the Earth, with leap months added every few years to stay in sync with the solar cycle. Each year in the calendar is given a name using a combination of 12 earthly branches — each of which corresponds to an animal in the zodiac — and 10 heavenly stems. This new year will be named Quy Mao, after the 10th heavenly stem, Quy, and the fourth earthly branch, Mao. In China, the rabbit was chosen to represent the earthly branch called Mao. But in Vietnamese, the pronunciation of Mao can be very similar to how the word \"cat\" is pronounced. \"Mao doesn't necessarily mean cat or rabbit,\" Doan says. \"These are just symbols we've used as code for the earthly branches.\" Enlarge this image People work on a display of cat figures at a building entrance in Hanoi on Monday. Nhac Nguyen/AFP via Getty Images hide caption toggle caption Nhac Nguyen/AFP via Getty Images People work on a display of cat figures at a building entrance in Hanoi on Monday. Nhac Nguyen/AFP via Getty Images Doan adds that Vietnam hasn't always celebrated the Year of the Cat and that it's unclear when the country switched over from using the rabbit in its zodiac. Mentions of the rabbit in the zodiac appear in many older Vietnamese texts. The uncertainty around the switch between the rabbit and the cat has led to several other theories for its origin. Enlarge this image Sitting among Lunar New Year decorative items, a vendor waits for customers at her shop in Hanoi on Jan. 14. Linh Pham/Getty Images hide caption toggle caption Linh Pham/Getty Images Sitting among Lunar New Year decorative items, a vendor waits for customers at her shop in Hanoi on Jan. 14. Linh Pham/Getty Images Quyen Di, a lecturer at UCLA, has several other possible explanations for Vietnam's unique celebration. One has to do with the landscapes of China and Vietnam. \"Originally, the Chinese lived in the savanna area, while the Vietnamese lived in the lowland area,\" he says. \"The people of the savanna prefer a nomadic life, close to the wilderness, and they chose the rabbit as an animal that lived in the wild fields.\" In contrast, the lowland people of Vietnam chose the more domestic cat. Additionally, Di says, Vietnamese people consider rabbits as \"animals that are used for food\" and chose the cat because they're considered \"friends living in their house.\" Enlarge this image Workers plant flowers in front of a cat statue by Hoan Kiem Lake in Hanoi on Tuesday. These animal statues are seen every year around Vietnam for the Lunar New Year. Nhac Nguyen/AFP via Getty Images hide caption toggle caption Nhac Nguyen/AFP via Getty Images Workers plant flowers in front of a cat statue by Hoan Kiem Lake in Hanoi on Tuesday. These animal statues are seen every year around Vietnam for the Lunar New Year. Nhac Nguyen/AFP via Getty Images Still, these are not the only urban legends surrounding the origin of the Year of the Cat. Ask a Vietnamese auntie or grandparent, and you're sure to hear several more stories about the Year of the Cat. Many involve the myth of a feast held by either Buddha or the Jade Emperor and a race among the animals to determine their order in the zodiac. In some legends, the cat was disqualified from the zodiac; the rat pushed it into the river. In another, the cat finishes the race and takes its place as the fourth animal. Facebook Twitter Flipboard Email Read & Listen Home News Culture Music Podcasts & Shows Connect Newsletters Facebook Twitter Instagram Press Contact & Help About NPR Overview Diversity Accessibility Ethics Finances Public Editor Corrections Get Involved Support Public Radio Sponsor NPR NPR Careers NPR Shop NPR Events NPR Extra Terms of Use Privacy Your Privacy Choices Text Only", "date": "Sat, 21 Jan 2023 12:01:01 GMT", "url": "https://www.npr.org/2023/01/21/1150216367/lunar-new-year-vietnam-year-of-cat", "summary": "\n\n-The Lunar New Year, also called Tet Nguyen, begins on Sunday and marks the Year of the Cat in Vietnam and the Year of the Rabbit in China, South Korea and other East and Southeast Asian countries.\n-This year, Vietnam celebrates the cat instead of the rabbit, due to the origins of the holiday being murky.\n-Many Asian countries celebrate the Lunar New Year, but Vietnam's celebration is unique in that it revolves around the animal that is not traditionally associated with the holiday in other countries.\n-The Lunar New Year is celebrated by planting flowers in front of cat statues around Vietnam."}