{"title": "India asks YouTube, Twitter to block links of BBC film on Modi | News | Al Jazeera", "content": "India asks YouTube, Twitter to block links of BBC film on Modi | News | Al Jazeera Skip linksSkip to Contentplay Live Show navigation menuNavigation menuNewsShow more news sectionsMiddle EastAfricaAsiaUS & CanadaLatin AmericaEuropeAsia PacificUkraine warFeaturesEconomyOpinionVideoMoreShow more sectionsCoronavirusClimate CrisisInvestigationsInteractivesIn PicturesScience & TechnologySportsPodcastsplay Live Click here to searchsearchNewsIndia asks YouTube, Twitter to block links of BBC film on ModiThe documentary critical of PM Modi’s role in the deadly 2002 Gujarat riots draws the ire of the Hindu nationalist government.Jack Straw, who was the UK’s foreign secretary at the time of the violence, said that Modi had \"played a pretty active part in pulling back the police and in tacitly encouraging the Hindu extremists”. [File: Ajit Solanki/AP Photo]Published On 21 Jan 202321 Jan 2023facebooktwitterwhatsappThe Indian government has directed Twitter and YouTube to block links sharing a BBC documentary, which takes a critical look at the role of Prime Minister Narendra Modi in the deadly 2002 Gujarat riots, according to local media and an adviser to the Ministry of Information and Broadcasting. Multiple YouTube videos of the first episode of the BBC documentary, India: The Modi Question, and more than 50 tweets with links to the YouTube videos were ordered to be taken down, Kanchan Gupta, senior adviser at Ministry of Information and Broadcasting, tweeted on Saturday. He said that the content was blocked using the emergency powers under the IT Rules, 2021. “Both @YouTube and @Twitter have complied with the directions,” he tweeted. Subject: GUJARAT POGROM ▪️“Violence politically motivated▪️“Aim was to purge Muslims from Hindu areas▪️“Has all the hallmarks of ethnic cleansing▪️“Narendra Modi directly responsible.” New BBC film reveals British govt report into 2002. Watch: https://t.co/3DOiZu6eQY pic.twitter.com/PbUfCrc5yN — churumuri (@churumuri) January 18, 2023 The first episode of the two-part series documentary, which aired on January 17, tracked Modi’s early years as a politician and his rise through the ranks of the governing Hindu nationalist Bharatiya Janata Party (BJP). Modi was the chief minister of the western state of Gujarat when it was gripped by communal riots that left more than 1,000 people dead – most of them Muslims. The violence erupted after a train carrying Hindu pilgrims caught fire, killing 59. The documentary revealed for the first time a United Kingdom government report into the deadly 2002 religious riots. The UK report said the events had “all the hallmarks of an ethnic cleansing”, the documentary showed. Bilkis Bano, who is now in her forties, was five months pregnant when she was brutally gangraped in communal violence in 2002. Her rapists were released by the BJP government in Gujarat state. [File; Ajit Solanki/AP Photo] Jack Straw, who was the UK’s foreign secretary at the time of the violence, was also interviewed in the documentary and said allegations against Modi undermined his reputation. “These were very serious claims – that Chief Minister Modi had played a pretty active part in pulling back the police and in tacitly encouraging the Hindu extremists,” Straw said. “That was a particularly egregious example.” “What we did was establish an inquiry and have a team go to Gujarat and find out for themselves what had happened. And they produced a very thorough report,” he added. The report also claimed there was widespread rape of Muslim women during the 2002 violence. It added that the riots’ objective was to “purge Muslims from Hindu areas” – something critics today have said has become state policy under the BJP’s Hindu nationalist agenda. In 2013, the UK ended a 10-year boycott of Modi over the 2002 riots that killed three British citizens. CENSORSHIP@Twitter @TwitterIndia HAS TAKEN DOWN MY TWEET of the #BBCDocumentary, it received lakhs of views The 1 hr @BBC docu exposes how PM @narendramodi HATES MINORITIES Here’s👇the mail I recieved. Also see flimsy reason given. Oppn will continue to fight the good fight pic.twitter.com/8lfR0XPViJ — Derek O'Brien | ডেরেক ও'ব্রায়েন (@derekobrienmp) January 21, 2023 ‘Propaganda piece’ The documentary was not made available in India, but it was uploaded on several YouTube channels and shared widely on Twitter, with a number of hashtags trending such as #BBCDocumentary #BBCQuitIndia and #GujaratRiots among others. The second episode will be aired on January 24. India’s foreign ministry on Thursday dismissed the documentary as a “propaganda piece”. Foreign ministry spokesperson Arindam Bagchi said the film was meant to push a “discredited narrative”. He added that a “bias”, “lack of objectivity”, and “continuing colonial mindset” is “blatantly visible” in it. “It makes us wonder about the purpose of this exercise and the agenda behind it, and we do not wish to dignify such efforts,” he told a news conference in New Delhi. The BBC, the UK state broadcaster, said its documentary on Modi was “rigorously researched”. “The documentary was rigorously researched according to highest editorial standards,” the BBC said in a statement. “A wide range of voices, witnesses and experts were approached, and we have featured a range of opinions – this includes responses from people in the BJP. We offered the Indian Government a right to reply to the matters raised in the series – it declined to respond.” The UK foreign office has not commented on the issue so far. Prime Minister Rishi Sunak said on Thursday that he did not agree with the characterisation of Modi in reply to a question in the parliament. Indian Prime Minister Narendra Modi is a polarising figure. [File: Manish Swarup/AP Photo] Accused of failing to stop the rioting, Modi denied the accusations and was exonerated in 2012 following an inquiry by India’s top court. Another petition questioning his exoneration was dismissed last year. Modi has defended his handling of the worst religious violence in post-independent India and has refused to apologise. In the documentary, he told the BBC journalist that the police under him did “excellent work” to control the violence in 2002. Jill McGivering, who interviewed Modi in 2002 for the BBC, recalled in the documentary: “He [Modi] struck me as a very charismatic, very powerful and quite menacing figure.” Several Gujarat BJP leaders and their supporters were handed lengthy jail terms for their involvement in the violence but many of them are now out on bail and 11 men accused of gang rape were released by Modi’s governing BJP party last year. Rights campaigners and officials who helped fight justice for the riot victims have had cases slapped against them, some of them jailed. Since Modi became prime minister in 2014, the country has seen increased attacks against Muslims, who form 15 percent of India’s 1.4 billion population. Activists shout slogans against Indian Prime Minister Narendra Modi during a protest against the arrest of Indian activist Teesta Setalvad in Mumbai. Setalvad has since been released on bail. [Rafiq Maqbool/AP Photo] Source: Al Jazeera and news agenciesAboutShow moreAbout UsCode of EthicsTerms and ConditionsEU/EEA Regulatory NoticePrivacy PolicyCookie PolicyCookie PreferencesSitemapCommunity GuidelinesWork for usHR QualityConnectShow moreContact UsAdvertise with usAppsChannel FinderTV SchedulePodcastsSubmit a TipOur ChannelsShow moreAl Jazeera ArabicAl Jazeera EnglishAl Jazeera Investigative UnitAl Jazeera MubasherAl Jazeera DocumentaryAl Jazeera BalkansAJ+Our NetworkShow moreAl Jazeera Centre for StudiesAl Jazeera Media InstituteLearn ArabicAl Jazeera Centre for Public Liberties & Human RightsAl Jazeera ForumAl Jazeera Hotel PartnersFollow Al Jazeera English:facebooktwitteryoutubeinstagram-colored-outlinerss© 2023 Al Jazeera Media Network", "date": "Sat, 21 Jan 2023 19:33:05 GMT", "url": "https://www.aljazeera.com/news/2023/1/21/india-asks-youtube-twitter-to-block-links-of-bbc-film-on-modi-gujarat-riots", "summary": "\n\n-The Indian government has directed Twitter and YouTube to block links sharing a BBC documentary, which takes a critical look at the role of Prime Minister Narendra Modi in the deadly 2002 Gujarat riots.\n-Multiple YouTube videos of the first episode of the BBC documentary, India: The Modi Question, and more than 50 tweets with links to the YouTube videos were ordered to be taken down, Kanchan Gupta, senior adviser at Ministry of Information and Broadcasting, tweeted on Saturday.\n-The documentary was not made available in India, but it was uploaded on several YouTube channels and shared widely on Twitter, with a number of hashtags trending such as #BBCDocumentary #BBCQuitIndia and #GujaratRiots among others.\n-The second episode of the BBC documentary will be aired on January 24.\n-India’s foreign ministry on Thursday dismissed the documentary as a “propaganda piece”.\n-Foreign ministry spokesperson Arindam Bagchi said the film was meant to push a “discredited narrative”.\n-He added that a “bias”, “lack of objectivity”, and “continuing colonial mindset” is “blatantly visible” in it.\n-“It makes us wonder about the purpose of this exercise and the agenda behind it, and we do not wish to dignify such efforts,” he told a news conference in New Delhi."}