{"title": "King Charles III's coronation: Buckingham Palace reveals details of three-day celebration | CNN", "content": "King Charles III's coronation: Buckingham Palace reveals details of three-day celebration | CNN CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Ad Feedback Close icon World Africa Americas Asia Australia China Europe India Middle East United Kingdom More Africa Americas Asia Australia China Europe India Middle East United Kingdom Audio Live TV Log In My Account Settings Log Out Your CNN account Log in to your CNN account Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio Edition US International Arabic Español Edition US International Arabic Español Africa Americas Asia Australia China Europe India Middle East United Kingdom Follow CNN US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics SCOTUS Congress Facts First 2020 Election Business Markets Tech Media Success Perspectives Video Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Buckingham Palace reveals details of three-day celebration to mark King Charles III’s coronation By Max Foster and Issy Ronald, CNN Published 5:30 PM EST, Sat January 21, 2023 Link Copied! King Charles III will be crowned on May 6. Henry Nicholls/WPA Pool/Getty Images London CNN — Buckingham Palace on Saturday revealed details of King Charles III’s coronation, set to be less extravagant than his mother’s ceremony 70 years ago, in a reflection of the cost-of-living crisis many Britons are enduring. Three days of celebrations will take place, with the coronation on Saturday May 6, a “Coronation Big Lunch” and “Coronation Concert” the following day, and an extra bank holiday on Monday. The public will be invited on the last day to join “The Big Help Out” by volunteering in their communities. The coronation itself will be “a solemn religious service, as well as an occasion for celebration and pageantry,” conducted by the Archbishop of Canterbury Justin Welby, the palace said. It will, the palace reiterated, “reflect the Monarch’s role today and look towards the future, while being rooted in longstanding traditions and pageantry.” That line from the palace has been interpreted by experts as a hint that Charles’ coronation will be different and more subdued from the one his late mother experienced seven decades ago, with a shorter ceremony and amendments to some of the feudal elements of the ritual. Queen Elizabeth’s coronation was the first live televised royal event and lasted three hours. Queen Elizabeth II was crowned in Westminster Abbey on June 2, 1953. AP Charles and his wife Camilla, the Queen Consort, will arrive at Westminster Abbey in procession from Buckingham Palace, known as “The King’s Procession,” and return later in a larger ceremonial procession, known as “The Coronation Procession,” accompanied by other members of the royal family. The King and Queen Consort, alongside members of the royal family, will then appear on the balcony of Buckingham Palace to conclude the day’s events. At this point, the palace has not specified which members of the family will appear in the procession and on the balcony, following Prince Andrew’s continued exile from public life as a result of historical sexual abuse allegations and the publication of Prince Harry’s memoir which railed against his family. Britain's King Charles III signs a guestbook during a visit to the Aboyne and Mid Deeside Community Shed in Aboyne, Aberdeenshire, to meet with local hardship support groups and tour the new facilities on January 12, 2023. (Photo by Andrew Milligan / POOL / AFP) (Photo by ANDREW MILLIGAN/POOL/AFP via Getty Images) Andrew Milligan/AFP/Getty Images The British royal family's response to Prince Harry's memoir is telling “It would help Charles a lot in terms of his image if Harry and Meghan were there,” royal historian Kate Williams previously told CNN. “It’s particularly going to look bad for him if his son is not there because, of course, Harry still is very high in line to the throne, as are his children.” On the following day, May 7, thousands of events are expected to take place across the country as part of the “Coronation Big Lunch,” while as-yet unnamed “global music icons and contemporary stars,” will come together for a “Coronation Concert” held on Windsor Castle’s East Lawn, the palace said. The concert will be attended by a public audience composed of volunteers from the King and Queen Consort’s charity affiliations as well as several thousand members of the public selected through a national ballot held by the BBC. They will watch a “world-class orchestra play interpretations of musical favorites fronted by some of the world’s biggest entertainers, alongside performers from the world of dance…and a selection of spoken word sequences delivered by stars of stage and screen,” the palace said, adding that a line-up would be released in due course. King Charles III and the Queen Consort attend a reception at Buckingham Palace on December 6. Victoria Jones/Pool/Getty Images A diverse group comprised of Britain’s Refugee choirs, NHS choirs, LGBTQ+ singing groups and deaf signing choirs, will form “The Coronation Choir” and also perform at the concert, alongside “The Virtual Choir,” made up of singers from across the Commonwealth. Well-known locations across the country will also be lit up using projections, lasers, drone displays and illuminations as part of the concert. The celebrations will conclude on the bank holiday Monday with “The Big Help Out” that will aim to “bring communities together and create a lasting volunteering legacy from the Coronation Weekend.” To get updates on the British Royal Family sent to your inbox, sign up for CNN’s Royal News newsletter. CNN’s Lauren Said-Moorhouse contributed reporting. Related Ad Feedback Ad Feedback Ad Feedback Ad Feedback Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics The Biden Presidency Facts First US Elections Business Markets Tech Media Success Perspectives Videos Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR Audio CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons Weather Climate Storm Tracker Wildfire Tracker Video More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN World Audio Live TV Follow CNN Log In My Account Settings Log Out Your CNN account Log in to your CNN account Terms of Use Privacy Policy Ad Choices Accessibility & CC About Newsletters Transcripts © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved. CNN Sans ™ & © 2016 Cable News Network.", "date": "Sat, 21 Jan 2023 22:30:00 GMT", "url": "https://www.cnn.com/2023/01/21/uk/king-charles-coronation-details-intl-gbr/index.html", "summary": "\n\n-The British royal family is preparing for the coronation of King Charles III, which is scheduled for May 7.\n-The coronation will be different from Queen Elizabeth II's coronation, which was the first live televised royal event.\n-The main events of the coronation will include a \"Big Lunch\" event on May 7 and a concert on Windsor Castle's East Lawn on May 8.\n-The coronation choir will be made up of choirs from across the Commonwealth, and well-known locations across the country will be lit up using projections, lasers, drone displays, and illuminations."}