{"title": "Over 1 million French workers strike against effort to raise retirement age | Fox Business", "content": "Over 1 million French workers strike against effort to raise retirement age | Fox Business Fox Business Personal Finance Economy Markets Watchlist Lifestyle Real Estate Tech TV Podcasts More Expand / Collapse search Login Watch TV Menu Personal Finance MortgagesStudent LoansCredit CardsPersonal LoansSavingsInsurance401kRetirementTax PlanningEconomy Government SpendingMoney & PolicySmall BusinessInflationMarkets StocksUS MarketsCryptocurrencyFutures & CommoditiesBondsETFsBusiness LeadersIndustriesRetailPre-MarketsMutual FundsWatchlist Lifestyle EntertainmentRich & FamousTravelCarsAirplanesFood & DrinksArtsReal Estate PersonalCommercialLuxury PropertiesTech DigitalSocial MediaGadgetsBusiness TechHealthcare TechFuture TechAISpaceSports NFLNBAMLBNASCARBoxingSoccerGolfTennisOpinion Shows Mornings with MariaVarney & CoCavuto: Coast to CoastMaking Money with Charles PayneThe Claman CountdownBulls & BearsThe Evening EditKennedyStrange Inheritance with Jamie ColbyMaria Bartiromo's Wall StreetWSJ at Large with Gerry BakerBarron's RoundtableAbout Channel FinderJobsTerms of UseUpdated Privacy PolicyFAQMedia RelationsCorporate InformationClosed Captioning PolicyAccessibility StatementFox NewsFox NationFox Business GoApps & Products Facebook Twitter Fox Business New Terms of Use New Privacy Policy Your Privacy Choices Help Closed Captioning Policy Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Europe Published January 20, 2023 11:04am EST Over 1 million French workers strike against effort to raise retirement age Union leaders say over 2 million people may have protested across the country Facebook Twitter Comments Print Email By Peter Aitken FOXBusiness close video Macron angry Biden creating jobs in US, not France: Neil Chatterjee Former FERC commissioner Neil Chatterjee reacts to French President Emmanuel Macron slamming Biden's green agenda, calling the plan 'super aggressive' on 'Cavuto: Coast to Coast.' Over one million French workers took to the streets to protest a government plan to reform the nation’s pension plans, including a bump for the age of retirement. \"Now, the government finds itself with its back to the wall,\" the leading French trade unions said in a joint statement. \"Everyone knows that raising the retirement age only benefits employers and the wealthy.\"French President Emmanuel Macron intends to push the retirement age from 62 to 64 in an effort to keep the pension system financially viable, but unions say the change will threaten their rights. The government says that pushing back the retirement age by two years will add 17.7 billion euros ($19.1 billion) in annual contributions, allowing the system to break even by 2027, Reuters reported. DAVOS 2023: BIGWIGS RETURN TO SWISS MOUNTAINS AMID ECONOMIC CRUNCHThe unions have proposed alternatives to the plan, such as taxing the wealthy or mandating more payroll contributions from employers to finance the system, but Macron continues to insist that his plan is the best way to resolve the situation. Protesters march during a demonstration against pension changes, Thursday, Jan. 19, 2023 in Paris. (AP Photo/Lewis Joly / AP Newsroom)\"This problem can be solved in a different way, through taxation. Workers should not have to pay for the public sector deficit,\" said Laurent Berger, the leader of CFDT, France's biggest labor union.BRITISH INFLATION FALLS IN DECEMBER AS FOOD COSTS SOARMacron, who was in Barcelona for a French-Spanish summit, acknowledged public discontent but said the reform remains necessary to \"save\" French pensions. The aging population and growing life expectancy in France, along with its commitment that everyone receives a state pension, has pushed the government to ensure the system remains solvent. Image 1 of 3 Riot police officers grab a protester during a demonstration against pension changes, Thursday, Jan. 19, 2023, in Paris. | AP Newsroom \"We will do it with respect, in a spirit of dialogue but also determination and responsibility,\" Macron said.IS THE SENTIMENT CHANGING IN INVESTING IN CHINA?But the public strongly opposes the reform, with polls suggesting most people reject the proposal. The strikes on Thursday present the first public reaction to the plan, with disruptions to transport, schools and other public services as more than 200 rallies occurred across the country. Firefighters demonstrate against pension changes, Thursday, Jan. 19, 2023 in Lille, northern France. (AP Photo/Michel Spingler / AP Newsroom)The Interior Ministry said more than 1.1 million people protested, with around 800,000 in Paris alone. Unions have claimed more than two million people took part in the protests nationwide. READ MORE ON FOX BUSINESS BY CLICKING HEREThe mostly peaceful protests resulted in small skirmishes with police, with several dozen protesters arrested, and police firing tear gas at some groups. The unions have called for a second day of widespread strikes on Jan. 31 as they try to force Macron to back down from his plan. The Associated Press contributed to this report. Markets Advertisement Advertisement Advertisement Advertisement Personal Finance MortgagesStudent LoansCredit CardsPersonal LoansSavingsInsurance401kRetirementTax PlanningEconomy Government SpendingMoney & PolicySmall BusinessInflationMarkets StocksUS MarketsCryptocurrencyFutures & CommoditiesBondsETFsBusiness LeadersIndustriesRetailPre-MarketsMutual FundsWatchlist Lifestyle EntertainmentRich & FamousTravelCarsAirplanesFood & DrinksArtsReal Estate PersonalCommercialLuxury PropertiesTech DigitalSocial MediaGadgetsBusiness TechHealthcare TechFuture TechAISpaceSports NFLNBAMLBNASCARBoxingSoccerGolfTennisOpinion Shows Mornings with MariaVarney & CoCavuto: Coast to CoastMaking Money with Charles PayneThe Claman CountdownBulls & BearsThe Evening EditKennedyStrange Inheritance with Jamie ColbyMaria Bartiromo's Wall StreetWSJ at Large with Gerry BakerBarron's RoundtableAbout Channel FinderJobsTerms of UseUpdated Privacy PolicyFAQMedia RelationsCorporate InformationClosed Captioning PolicyAccessibility StatementFox NewsFox NationFox Business GoApps & Products Facebook Twitter Fox Business New Terms of Use New Privacy Policy Your Privacy Choices Help Closed Captioning Policy Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy", "date": "Fri, 20 Jan 2023 16:04:57 GMT", "url": "https://www.foxbusiness.com/politics/1-million-french-workers-strike-effort-raise-retirement-age", "summary": "\n\n-1 million French workers have taken to the streets to protest a government plan to reform the nation’s pension plans, including a bump for the age of retirement.\n-The unions say the change will threaten their rights, while the government says the bump will add 17.7 billion euros ($19.1 billion) in annual contributions, allowing the system to break even by 2027.\n-The protests are the first public reaction to the plan, with disruptions to transport, schools and other public services as more than 200 rallies occurred across the country.\n-Firefighters demonstrate against pension changes, Thursday, Jan. 19, 2023 in Lille, northern France."}