{"title": "The world’s elite gathered to talk climate change at Davos. Now, they’re flying home on private jets. - The Boston Globe", "content": "The world’s elite gathered to talk climate change at Davos. Now, they’re flying home on private jets. - The Boston Globe Skip to main contentSectionsSearchMorePodcasts email Created with Sketch. NewslettersCoronavirusMetroObituariesDeath NoticesGlobe LocalPoliticsInvestigationsEducationNewtonNew EnglandWeatherSportsRed SoxPatriotsBruinsCelticsRevolutionCollegesHigh SchoolsTV & RadioBusinessHealthcareLife SciencesTechnologyReal EstateEconomyBold TypesTop Places to Work 2021PoliticsElectionsOpinionThe EmancipatorIdeasColumns and OpedsEditorialsLettersCartoonsSpotlightRhode IslandThings to DoRhode Island PodcastRI Food & DiningPoliticsBusinessArtsCrimeNationClimateWorldLifestyleA Beautiful ResistanceFood & DiningComicsCrosswordGamesTravelNamesLove LettersReal EstateGlobe MagazineMarijuanaArtsBooksMoviesMusicTelevisionVisual ArtsTheater/DanceCarsReal EstateEventsSearchePaperMagazineObituariesWeatherComicsCrosswordEventsManage my AccountMr. 80 PercentGladiatorLast SeenLove LettersSTAT: The Readout LoudAll PodcastsThe Globe InvestigatesThe Big To DoThis week in WeedAll NewslettersToday in OpinionToday's HeadlinesBreaking News AlertsWeekend Reads from IdeasGlobe's Most PopularMetro Headlines108 StitchesRhode MapPoint AfterInnovation BeatEmail to a Friend Share on Facebook Share on TwitterPrint this Article View CommentsCoronavirusMetroSportsBusinessPoliticsOpinionHealthRhode IslandSpotlightLifestyleArtsGlobe MagazineTechnologyClimateEducationCarsReal EstateEventscommentaryThe world’s elite gathered to talk climate change at Davos. Now, they’re flying home on private jets. By Dharna Noor Globe Staff,Updated January 20, 2023, 4:56 p.m.Email to a Friend Share on Facebook Share on TwitterPrint this Article View CommentsSwedish climate activist Greta Thunberg arrives to hold talks with other young climate activists and International Energy Agency chief on the sideline of the World Economic Forum annual meeting in Davos, on January 19, 2023.FABRICE COFFRINI/AFP via Getty ImagesThe world’s business and political elite gathered this week for the annual World Economic Forum in Davos, Switzerland, where they spent hours discussing how to solve climate change.Now, they’re flying home on private jets.As the five-day conference wrapped up on Friday, critics once again pointed to the contradictions surrounding it. Held in a luxe ski resort town, the Davos summit is the very image of global inequality — a key driver of the climate crisis. And those in attendance bear outsized responsibility for planet-warming pollution.Oil and gas executives from the world’s most polluting companies — such as BP, Chevron, and Saudi Aramco — were among the 1,500 business leaders in attendance. Also on the guest list: chief executive officers from JPMorgan Chase and Wells Fargo, banks that are top financiers of oil and gas and which have recently come under fire for funding a group lobbying against climate efforts, as well as theCEO of BlackRock, which despite its green rhetoric still holds $133 billion in shares and bonds of top oil and gas companies.In a speech at Davos on Thursday, activist Greta Thunberg told attendees that trusting a class of people who are “mostly fueling the destruction of the planet” to willfully help slow climate change is “absurd.”Advertisement“Somehow these are the people that we seem to rely on solving our problems when they have proven time and time again that they are not prioritizing that,” she said. “They are prioritizing self-greed, corporate greed, and short-term economic profits above people and above planet.”Study after damning study also shows the world’s wealthiest people have far more emitting lifestyles than the rest of us. Take, for instance, their propensity to travel by private jet, which according to one estimate emits up to 14 times more than taking a commercial plane.AdvertisementLast year, more than one thousand private plane trips to the World Economic Forum generated four times the CO2 emissions that such aircrafts create worldwide in an average week, according to a recent Greenpeace report which highlighted attendees’ “ecological hypocrisy.”Thanks to the use of private jets, along with other carbon-intensive habits like using yachts and living in mansions, billionaires’ personal consumption habits are thousands of times more CO2-polluting than the average person. But lifestyle choices aren’t even the biggest ways the global elite drive the climate crisis.Even more crucial is their role in shaping the global economy. According to one 2022 study from the charity Oxfam, after accounting for the planet-warming pollution from the companies in which they invest, billionaires’ carbon emissions are more than one million times higher than the average person.To be sure, executives are spending more time talking about climate change, including at Davos. In fact, promises to reach net-zero emissions by 2050, have soared in recent years, up 60 percent to more than 11,000 in September 2022, the United Nations announced at the conference.“Clients are becoming ever more informed on the energy transition, demand for sustainable and green products has held up well, and clients are increasingly looking to measure the impact of their portfolios,” Suni Harford, president of the asset management arm at the bank and financial services firm UBS, told Reuters.AdvertisementBut despite these pledges, the world is still off track to meet its climate goals.A major assessment from the UN’s Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services last year warned that world leaders’ focus on short-term profits and economic growth has spurred the destruction of ecosystems and reduced people’s wellbeing.There’s evidence that to really solve the climate crisis, wealth, power, and ownership must be redistributed. As a May 2022 report said, economic inequality is a major detriment to climate policy because it increases the likelihood of government corruption, erodes trust in public officials, and fosters feelings of division that make it hard to undertake major political projects.“Inequality erodes the social foundations of democracy, making it harder to develop collective responses to climate change,” said Fergus Green, a lecturer at University College London who co-authored the paper.If redistribution is the answer, it seems the world is moving in the wrong direction. An analysis this week found billionaires’ fortunes are increasing by a stunning $2.7 billion a day. Further, the top 1 percent has captured nearly two-thirds of all new wealth created since 2020 — nearly twice as much as the bottom 99 percent of the global population. As a result, the richest 1 percent now hold 45.6 percent of all global wealth, while the poorest half of the world holds just 0.75 percent.The World Economic Forum itself acknowledges that inequality is a major problem. But it’s not in the interests of many participants in the conference — which costs up to a quarter million dollars to attend — to foster a more equal world.Advertisement“Without massive public pressure from the outside, these people are going to go as far as they possibly can,” said Thunberg in her Thursday speech. “They will continue to throw people under the bus for their own gain.”Dharna Noor can be reached at dharna.noor@globe.com. Follow her on Twitter @dharnanoor. Black News Hour presented by The Boston Globe Run by Black journalists at The Boston Globe, “Black News Hour,” a new radio program, delivers reliable news that connects with our community and expands on deeper issues impacting our city. Boston Globe videoFollow Us Subscribe NowDigital AccessHome DeliveryGift SubscriptionsMy AccountLog InManage My AccountCustomer ServiceContactHelp & FAQsStaff ListAdvertiseMoreNewslettersView the ePaperOrder Back IssuesNews in EducationSearch the ArchivesPrivacy PolicyTerms of ServiceTerms of PurchaseWork at Boston Globe Media©2023 Boston Globe Media Partners, LLC", "date": "Fri, 20 Jan 2023 21:58:01 GMT", "url": "https://www.bostonglobe.com/2023/01/20/science/worlds-elite-gathered-talk-climate-change-davos-now-theyre-flying-home-private-jets/", "summary": "\n\n-The world's elite gathered to talk climate change at Davos this week, but are now flying home on private jets.\n-Activist Greta Thunberg criticized those in attendance for their \"self-greed, corporate greed, and short-term economic profits above people and above planet\" and said trusting them to help solve climate change is \"absurd.\"\n-BlackRock, which despite its green rhetoric still holds $133 billion in shares and bonds of top oil and gas companies, is among those flying home on private jets.\n-The world is still off track to meet its climate goals, and inequality is a major detriment to climate policy."}