{"title": "China records first population decline in 60 years: How does Europe's demographic data compare? | Euronews", "content": "China records first population decline in 60 years: How does Europe's demographic data compare? | EuronewsBiztech NewsMoneyWorkMobilityHealthHomeOpinionSeries Series The DialogueRethinkhacker:HUNTER Next LevelMeet the entrepreneursBusiness LineFocusReal EconomyTargetThe ExchangeSmart HealthVisit Euronews Work China records first population decline in 60 years: How does Europe's demographic data compare? Europe’s demographics in data - past, present and future - Copyright Euronews By Camille Bello • Updated: 20/01/2023 - 16:40 For the first time in six decades, China’s population shrank last year, as deaths outnumbered births.The country had 1.41175 billion people at the end of 2022, according to figures released by the National Bureau of Statistics, a drop of 850,000.Not only is China’s birth rate plunging, its population is also ageing, and experts warn this will result in a grim demographic cocktail that will shrink the nation’s workforce, drain its pension system and could have severe economic repercussions well beyond its borders.But as China’s demographic crisis steals the headlines, it’s hard to ignore the fact that the European Union’s population is also getting older and has been shrinking for two years now. The countries where population is declining Europe’s population declines after decades of growthThe EU population grew from 354.5 million in 1960 to 446.8 million in 2022, an increase of 26 per cent. That’s an additional 92.3 million people, more than the population of Germany, the bloc’s biggest member with 83 million people.However, the rate of population growth has slowed down in recent decades, and for the last two years, the overall EU population has declined, though not in every member state.In total, 10 countries recorded a decrease in population between 2021 and 2022, with the largest decrease reported in Italy (-253,100 inhabitants), Poland (-185,800), Romania (-163,600), Croatia (-157,300), Bulgaria (-77,600), Greece (-74,800), Hungary (-41,800), Slovakia (-25,100), Latvia (-17,500) and Slovenia (-1,800).Increases were observed in 17 countries, the top five being France (+185,900 inhabitants), Netherlands (+115,300), Germany (+82,100), Belgium (+76,400) and Sweden (+73,000).Davos 2023: The 5 key talking points set to dominate the agenda at this year’s World Economic ForumWhat’s Europe’s fertility rate?China’s fertility rate plummeted to 1.15 children per woman in 2021, far below the replacement level of around 2.1 live births per woman needed to ensure a broadly stable population in the absence of migration.It’s worth noting that not a single EU country has a fertility rate above this threshold.The average fertility rate in the EU, at 1.50 live births per woman in 2020, was down from 1.53 in 2019 and 1.57 in 2016.The lowest total fertility rates in 2020 were recorded in Malta (1.13), Spain (1.19) and Italy (1.24).France ranked first, with an average fertility rate of 1.83, followed by Romania (1.80), the Czech Republic (1.71) and Denmark (1.68).However, some EU countries with fertility rates below the replacement level still have a growing population.France, for example, has seen its population grow for the last 20 years. The country’s statistics office INSEE attributes this to several factors, notably migratory movements and the increase in life expectancy.Sperm count down: What you need to know about the male fertility crisisBirths, deaths and migrationThe natural population change in the EU has been negative since 2012 - meaning that for more than a decade, deaths have outnumbered births.However, the EU population only stopped growing in 2020. How is that possible?Until the 1990s, natural population change (having more births than deaths) accounted for the vast majority of the overall change in the total population.Onwards, the role of net migration took an important role in the EU population change, as births and deaths became broadly balanced, Eurostat explains. And from 2011, the growth of the EU population has been attributed to net migration and statistical adjustments.However, in 2020 and in 2021, net migration no longer made up for the negative natural population change in the EU and, as a result, the total EU population shrank.Eurostat attributed this combination of factors to the impact of the COVID-19 pandemic.China vs the EU: The role of migrationThe EU and China have different migration dynamics. The graphic below compares their net migration rate - the difference between the number of immigrants (moving into a country) and the number of emigrants (those leaving) over the year.When the number of immigrants is higher than the number of emigrants, there is a positive net migration rate.Back in 1960, the net migration rates of China and the EU were roughly comparable and painted a similar picture: at the time, more people were emigrating than moving in. However, World Bank figures show a dramatically different trajectory over the following decades. In 2021, the EU's net migration rate was +910,755 people, while for China, it was -200,194 people. Will the EU population resume its growth?Eurostat’s latest population projections at a national level were made in April 2020 and covered the period from 2020 to 2100.According to those estimates, the EU’s population is projected to increase to a peak of 449.3 million around 2026 and then gradually decline to 416.1 million by 2100.However, 11 EU member states are expected to see their population grow, with net migration being the main contributor. These are Sweden, France, Ireland, the Netherlands, Denmark, Belgium, Austria, Cyprus, Malta, Germany and Luxembourg.Which countries have the most strikes in Europe and what is the impact on the economy?The EU population is living longer, and getting olderThe share of the population aged 65 and over is increasing in every EU member state and is in fact well ahead of China, where it stands at around 13 per cent. The countries with the biggest share of the population aged 65 years and over are Italy (22.5 per cent), followed by Finland (22.7 per cent), Greece (22.5 per cent), Portugal (22.4 per cent) and Germany (22 per cent).Over the last decade, countries that recorded the biggest increase in the share of the population aged 65 years and over were Finland, with an increase of 5.2 percentage points (pp), then Poland (5.1 pp) and Czechia (4.6 pp). An increase of 3 pp was observed for the EU as a whole.According to Eurostat’s predictions, those aged 65 or over will account for 31.3 per cent of the EU’s people by 2100, compared with 20.8 per cent in 2021.The share of those aged 80 years or above in the EU’s population is also expected to more than double between 2021 and 2100, from 6.0 per cent to 14.6 per cent.Pension reform in France: Which countries have the lowest and highest retirement ages in Europe? The growth of the ageing population is attributed to increased longevity.In the EU, life expectancy at birth has risen rapidly during the past century, from 69 years in 1960 to 80.1 years in 2021.The EU attributes it to several factors, including a reduction in infant mortality, rising living standards, improved lifestyles, better education, and advances in healthcare and medicine.However, following the COVID-19 pandemic, the indicator declined from 81.3 in 2019 to 80.4 years in 2020 and 80.1 in 2021. Only four EU member states did not record a decrease in their average life expectancy: Denmark, Estonia, Finland and Cyprus.Want to work from home? These European countries are the most open to hybrid or remote workWhich EU countries have the youngest populations?The working age population, defined as those aged 15 to 64, accounts for over 64 per cent of the population in the EU, according to 2021 data.Over 10 per cent of the EU population is between 15 and 24 years old, over 32 per cent is aged between 25 and 49 years old, and almost 21 per cent is between 50 and 64 years old.In 2021, the median age of the EU’s population was 44.1 years, up from 41.6 years in 2011.This median age is expected to further increase to 48.8 in 2100. That means half of the EU’s population will be older than 48.8, while the other half will be younger.In 2021, Cyprus had the lowest median age at 38 years, and Italy had the highest, at 47.6. EUROPEAN UNION FERTILITY RATE WORKFORCE POPULATION DEMOGRAPHY DATA Share this articleShareTweetSharesendShareTweetSharesendMoreHideShareSendShareShareShareSendShareShare You might also like Now playing Next Biztech news Which tech firms are slashing jobs and freezing hiring? Now playing Next Health What music helps you sleep? For many, it’s Billie Eilish and BTS Now playing Next world news The countries where population is declining Most viewed Inside the US facility that has cryofrozen 199 'patients' and 100 pets China’s population is shrinking: Where does Europe stand? Free the nipple: Meta advisory board overturns ban on bare breasts These jobs will get you hired in 2023, according to LinkedIn The circular economy: A €4.1 trillion opportunity? Sign up for our Next newsletter Biztech NewsMoneyWorkMobilityHealthHomeOpinionSeriesTerms and ConditionsCookie Policy - English EnglishFrançaisDeutschItalianoEspañolPortuguêsРусскийTürkçeΕλληνικάMagyarفارسیالعربيةShqipRomânăქართულიбългарскиSrpskiVisit Euronews Biztech NewsMoneyWorkMobilityHealthHomeOpinionSeries Series The DialogueRethinkhacker:HUNTER Next LevelMeet the entrepreneursBusiness LineFocusReal EconomyTargetThe ExchangeSmart Health English Français Deutsch Italiano Español Português Русский Türkçe Ελληνικά Magyar فارسی العربية Shqip Română ქართული български Srpski Visit Euronews", "date": "Fri, 20 Jan 2023 10:38:43 GMT", "url": "https://www.euronews.com/next/2023/01/20/china-sees-first-population-decline-in-six-decades-where-does-the-eu-stand", "summary": "\n\n- China has recorded its first population decline in 60 years, as deaths outnumbered births.\n- Europe's demographics in data - past, present and future - show that the EU has been experiencing a population decline for the past two years.\n- The EU's fertility rate is below the replacement level, meaning that the population is growing less than the number of births.\n- Migration is the main contributor to the population growth in the EU, as more people are moving in than moving out.\n- The EU's population is projected to increase to a peak of 449.3 million around 2026, but then gradually decline to 416.1 million by 2100.\n- The median age is expected to further increase to 48.8 in 2100. That means half of the EU's population will be older than 48.8, while the other half will be younger.\n- In 2021, Cyprus had the lowest median age at 38 years, and Italy had the highest, at 47.6."}