{"title": "In Dnipro missile strike, nine floors of random death and destruction - The Washington Post", "content": "In Dnipro missile strike, nine floors of random death and destruction - The Washington PostAccessibility statementSkip to main contentSearch NavigationDemocracy Dies in DarknessSign inWar in UkraineLive briefing Verified videos Donbas region Russian combat capabilities HIMARS EuropeIn Dnipro missile strike: Nine floors of random death and destructionBy Siobhán O'Grady and Anastacia Galouchka January 19, 2023 at 7:20 p.m. ESTNeighbors gather at the site of a Russian missile strike that destroyed part of a residential building in Dnipro, Ukraine. (Wojciech Grzedzinski for The Washington Post)ListenComment on this storyCommentGift ArticleShareDNIPRO, Ukraine — For the better part of three days, the relatives of the missing stood watch outside, in freezing cold, hoping for miracles.With each hour, chances of the best-case scenario — that their loved ones would be recovered alive — faded. At the very least, they yearned for certainty about the fates of those trapped in the rubble of the nine-floor apartment building heavily damaged by a Russian missile on Saturday.Now, not quite a week later, many face a painful realization: Some victims may never be found.The sheer force of the explosion, which Ukrainian officials say was caused by a Russian Kh-22 missile, meant some victims were incinerated, dismembered or otherwise left unidentifiable. The official cleanup was declared complete on Tuesday. At least 46 people were killed, and 11 are still missing, though forensic experts are still examining debris from the site for signs of human remains.A grandmother is still missing after a Russian missile hit her home in Dnipro, Ukraine on January 14. (Video: Zoeann Murphy/The Washington Post)AdvertisementThe attack destroyed more than 70 apartments in a sprawling complex that housed not only local residents but many people displaced from elsewhere in the country. Some had fled the country’s harshest front lines in the east and south, only for the war to catch up to them in Dnipro, a city that was considered a relative safe haven.The missile attack on a residential apartment block, located on a street called Victory Embankment, overlooking the Dnieper River, laid bare some of the most terrifying realities of this war. Safety is fleeting. Strikes are unpredictable. The smallest, most banal decisions make the difference between life and death.Accustomed to air raid alerts, few people in Dnipro regularly shelter when the sirens blare — and, in any event, Ukrainian officials say their air defenses were initially unable to detect the barrage of missiles Russia launched that Saturday.But even if residents of this block had rushed to lower levels for safety, it probably would not have helped their chances of survival. Many of those killed were on the building’s lower floors when the missile hit, collapsing a section of the building into a jumble of concrete and metal.The dead include a mother and father from the city of Nikopol, who relocated to Dnipro with their children, Karolina, 14, and Timur, 9, in July. The children are hospitalized. On Instagram, their aunt wrote that they had left Nikopol, which is shelled regularly from Russian occupied territory across the river, because “it was hell there.” The family’s apartment in Dnipro was on the eighth floor.Olena Zhuravska, 73, fled the town of Toretsk, located near some of the worst fighting in the eastern region of Donetsk, last year. In Dnipro, she had an apartment on the fourth floor.AdvertisementHer family was at church when the missile struck, but she felt unwell and stayed home. She had a bad feeling about the day and was on the phone with her son, Roman, when the building was struck. Her body has not been found. Roman rushed to the site and realized most of the floors had just disappeared. “I knew I was probably never going to see my mother again,” he said.Democracy defenders and Rambo wannabes: Ukraine’s volunteer foreign fightersOne of the most widely shared images from the aftermath of the strike showed Anastasia Shvets, 23, holding a stuffed animal, her face in evident shock as she sat, about five floors up, trapped in her destroyed apartment. She survived, but her parents were killed, just four months after her boyfriend was killed fighting Russian troops on the front line.From the street, passersby can still see the remains of a yellow kitchen on the ninth floor. The wall was ripped away, but the chairs at the table remain almost perfectly in place. Mykhailo Korynovskyi, 39, a boxing coach, had been home alone in that apartment when the missile hit. His wife and two young daughters were at a store nearby.Korynovskyi’s funeral, at the gym where he trained, was packed with hundreds of people holding red flowers — including many grieving young athletes. Two young boys in the front row wiped away tears as Ukrainian Orthodox priests blessed his casket. Korynovskyi’s mother and wife sobbed.During the ceremony, news alerts flashed across attendees’ phones: Another victim was just found dead in the rubble, this time a small child.The crowd left the gym for the cemetery across town, where Korynovskyi’s friends took turns touching his casket and tossing dirt onto his grave. Two young men stood off to the side, cursing Russia. “It’s a good thing he was,” one then said quietly. “The sad thing is that he wasn’t for long,” the other replied.When the missile hit, Korynovskyi’s ninth-floor neighbor, Maksym Omelianenko, 31, was deployed on the front line in Bakhmut, the eastern Ukrainian city where some of the war’s fiercest fighting is taking place.Omelianenko had just returned to his base from a mission when he saw on Instagram that Dnipro, his hometown, had been hit. At first he thought the explosion was on the other side of the city. Then he realized a missile had struck his building, where his mother still lived.“I was in utter shock,” he said.AdvertisementHis commander ordered him to leave immediately. Omelianenko knew he could be killed on the road out, which is “shelled constantly,” he said. But a fellow soldier volunteered to drive him. “We just left at our own risk,” he said.The trip took about four hours. After an hour on the road, he received a call that his 2-year-old dog, a shepherd mix named Vice, had been injured but was alive. His mother, Lyudmila, was still missing.Then friends on the scene sent him a “video of a piece of my kitchen and there was a person [waving] a piece of cloth,” he said. He hoped it was his mother.After classmates snitch, Russia charges 19-year-old war critic as terroristLyudmila, who had been in her apartment on the top floor, was largely buried under rubble. Rescuers kept trying to reach her, but they feared their efforts could cause more of the building to collapse and bury her.From her hospital bed this week, she recalled lying trapped for hours before her rescue, listening to her neighbor’s daughter scream for help. The neighbor had hosted her family that day for an Orthodox New Year’s celebration. After the strike, she said, the woman’s daughter was left hanging off the side of the building, holding on to the family’s stove.“I heard how she was shouting “Mom! Mom! Help me!” she said. “But her mom was unconscious. She couldn’t help. She was shouting for so long … it broke my heart to hear her screaming like that.”“I don’t know if she fell,” she added. “Maybe she’s alive but nobody could find her.”The rest of that family, she said, “are all dead now.”Lyudmila’s son was able to visit her in the hospital the day after the strike. Her legs were crushed, and she had wounds on her face. Other neighbors lay bandaged in the beds around her.The strike deeply rattled Omelianenko, who said he was accustomed to the war he is fighting as a soldier but never imagined it would come to his own home.Inside the building, “there were people who had left from Nikopol, from Donetsk,” he said. “They were fleeing from one sort of shelling but they ended up dying from this attack in Dnipro.”Yevhen Solovyov was helping his wife’s parents, Iryna Vitalyeva and Viktor Vitalyev, set up their new apartment on the fifth floor of the building last Saturday.U.S. readies another massive military package for Ukraine“As always, he helped out everyone who needed help,” his sister-in-law, Yulia Solovyova, said. They were all supposed to gather for a family dinner later that day, but the three “didn’t manage to get out in time,” she said.For three days, Yevhen’s wife, Svetlana, and brother, Yuriy, stood outside the building waiting for news. Volunteers milled about, handing out food, clothes and bedding to survivors. Police officers warmed themselves by makeshift fires. More and more bodies were recovered from the wreckage.Eventually, rescuers found the body of Svetlana’s mother. Her father and Yevhen are still missing. Yevhen leaves two daughters, a 7-year-old and an 18-month-old. The family is consumed, Solovyova said, by “so much sorrow.”Just after Omelianenko reunited with his mother, he had to return to Bakhmut. His mom, he said, told him that when she recovers, she wants to move near him, closer to the front line, despite the risks.“Of course she’s very worried for me. She told me to be careful, and to come back alive and not harmed,” he said in a call from a basement in the besieged city this week. “But she understands we’re doing it for the whole of Ukraine,” he said.AdvertisementBack in Dnipro, even residents whose apartments were not badly damaged are not allowed to live there, because of the risk that other parts of the building could collapse. On Wednesday, some residents were briefly allowed back inside to collect their belongings.Among them was Olga Korynovska, the widow of Korynovskyi, the boxing coach. On Instagram, she posted videos of her sifting through their belongings. First, photos of their wedding and their children. And, somehow, her husband’s toolbox, undamaged. She sighed.“This is all that is left from the past nine years,” she said.Serhii Korolchuk and Zoeann Murphy contributed to this report.War in Ukraine: What you need to knowThe latest: Russia claimed Friday to have seized control of Soledar, a heavily contested salt-mining town in eastern Ukraine where fighting has raged in recent days, but a Ukrainian military official maintained that the battle was not yet over. Russia’s Gamble: The Post examined the road to war in Ukraine, and Western efforts to unite to thwart the Kremlin’s plans, through extensive interviews with more than three dozen senior U.S., Ukrainian, European and NATO officials.Photos: Washington Post photographers have been on the ground from the beginning of the war — here’s some of their most powerful work.How you can help: Here are ways those in the U.S. can support the Ukrainian people as well as what people around the world have been donating.Read our full coverage of the Russia-Ukraine war. Are you on Telegram? Subscribe to our channel for updates and exclusive video. CommentsGiftOutlineGift ArticleUnderstanding the Russia-Ukraine conflictHAND CURATEDInside the Ukrainian counteroffensive that shocked Putin and reshaped the warDecember 29, 2022Inside the Ukrainian counteroffensive that shocked Putin and reshaped the warDecember 29, 2022What Russia has gained and lost so far in Ukraine, visualizedNovember 21, 2022What Russia has gained and lost so far in Ukraine, visualizedNovember 21, 2022U.S. has viewed wreckage of kamikaze drones Russia used in Ukraine October 20, 2022U.S. has viewed wreckage of kamikaze drones Russia used in Ukraine October 20, 2022View 3 more storiesLoading...View moreLoading...CompanyAbout The Post Newsroom Policies & Standards Diversity and Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement Get The PostGift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Newspaper in Education Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsContact the Newsroom Contact Customer Care Contact the Opinions team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of UseDigital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Ad Choices washingtonpost.com © 1996-2023 The Washington Postwashingtonpost.com © 1996-2023 The Washington PostAbout The Post Contact the Newsroom Contact Customer Care Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App Policies & Standards Terms of Service Privacy Policy Cookie Settings Print Products Terms of Sale Digital Products Terms of Sale Submissions & Discussion Policy RSS Terms of Service Ad Choices", "date": "Fri, 20 Jan 2023 03:20:00 GMT", "url": "https://www.washingtonpost.com/world/2023/01/19/dnipro-victims-building-missile-strike/", "summary": "\n\n- On Saturday, a Russian missile strike destroyed part of a residential building in Dnipro, Ukraine, killing 46 people and leaving 11 missing.\n- Among the victims are a mother and father from the city of Nikopol, who relocated to Dnipro with their children, Karolina, 14, and Timur, 9, in July. The children are hospitalized.\n- On Instagram, their aunt wrote that they had left Nikopol, which is shelled regularly from Russian occupied territory across the river, because “it was hell there.”\n- The family’s apartment in Dnipro was on the eighth floor.\n- Olena Zhuravska, 73, fled the town of Toretsk, located near some of the worst fighting in the eastern region of Donetsk, last year. In Dnipro, she had an apartment on the fourth floor.\n- Among the victims are a mother and father from the city of Nikopol, who relocated to Dnipro with their children, Karolina, 14, and Timur, 9, in July. The children are hospitalized.\n- On Instagram, their aunt wrote that they had left Nikopol, which is shelled regularly from Russian occupied territory across the river, because “it was hell there.”\n- The family’s apartment in Dnipro was on the eighth floor.\n- Olena Zhuravska, 73, fled the town of Toretsk, located near some of the worst fighting in the eastern region of Donetsk, last year. In Dnipro, she had an apartment on the fourth floor.\n- Among the victims are a mother and father from the city of Nikopol, who relocated to Dnipro with their children, Karolina, 14, and Timur, 9, in July. The children are hospitalized.\n- On Instagram, their aunt wrote that they had left Nikopol, which is shelled regularly from Russian occupied territory across the river, because “it was hell there.”\n- The family’s apartment in Dnipro was on the eighth floor.\n- Olena Zhuravska, 73, fled the town of Toretsk, located near some of the worst fighting in the eastern region of Donetsk, last year. In Dnipro, she had an apartment on the"}