{"title": "Sections of Balkan river have become a floating garbage dump - CBS News", "content": "Sections of Balkan river have become a floating garbage dump - CBS News CBS News App Jan. 6 Probe Ukraine Crisis COVID Pandemic CBS News Live Managing Your Money Essentials Shopping Newsletters News US World Politics Entertainment Health MoneyWatch CBS Village Technology Science Crime Sports Essentials DOJ finds 6 more documents marked classified in search of Biden's Delaware home 5 inmates captured after escaping from Missouri jail Lithium-ion battery sparks fire that kills 1 and injures 10, FDNY says The Saturday Six: Alec Baldwin charged, eggs seized at the border and more Trump resort in Miami set to host conference bolstering conspiracy theories Damar Hamlin faces long recovery, but is \"very upbeat,\" spokesperson says 22-year-old missing after 'polar plunge' in California Sections of Balkan river have become a floating garbage dump 5 Memphis police officers fired in death of Tyre Nichols Justice Department investigating Abbott baby formula plant Astronaut Buzz Aldrin marries longtime love on his 93rd birthday Wife shot terminally ill husband in Florida hospital, police say Jeremy Renner says he broke \"30 plus\" bones in snowplow accident Recovering boats left derelict by Hurricane Ian Son seeks $50 million from L.A. for dad's death from stun gun zaps Feds seize over $170 million in cash accounts linked to Sam Bankman-Fried Investigative journalist critical of Rwanda's government killed in a car accident The best times to buy gold Migrant arrivals soared to record high before border crackdown Ohio police sergeant placed on leave after video shows him punching woman during arrest 2024 GOP presidential contenders face conservative litmus test on abortion Teen born without legs seeks to inspire others after making basketball team The East Coast's snowless winter leaves some businesses feeling the heat Nikki Haley loses top staffer to Pence Shows Live Local More Latest Video Photos Podcasts In Depth Local Global Thought Leaders Innovators & Disruptors Log In Newsletters Mobile RSS CBS Store Paramount+ Join Our Talent Community Davos 2023 Search Search Login World Sections of Balkan river have become a floating garbage dump January 21, 2023 / 9:13 AM / AP Tons of waste dumped in poorly regulated riverside landfills or directly into the waterways that flow across three countries end up accumulating behind a trash barrier in the Drina River in eastern Bosnia during the wet weather of winter and early spring.This week, the barrier once again became the outer edge of a massive floating waste dump crammed with plastic bottles, rusty barrels, used tires, household appliances, driftwood and other garbage picked up by the river from its tributaries.The river fencing installed by a Bosnian hydroelectric plant, a few kilometers upstream from its dam near Visegrad, has turned the city into an unwilling regional waste site, local environmental activists complain. Heavy rain and unseasonably warm weather over the past week have caused many rivers and streams in Bosnia, Serbia and Montenegro to overflow, flooding the surrounding areas and forcing scores of people from their homes. Temperatures dropped in many areas on Friday as rain turned into snow. Aerial view of waste floating in the Drina river near Visegrad, Bosnia, Friday, Jan. 20, 2023. Tons of waste dumped in poorly regulated riverside landfills or directly into the rivers across three Western Balkan countries end up accumulating during high water season in winter and spring, behind a trash barrier in the Drina River in eastern Bosnia. Armin Durgut / AP \"We had a lot of rainfall and torrential floods in recent days and a huge inflow of water from (the Drina's tributaries in) Montenegro which is now, fortunately, subsiding,\" said Dejan Furtula of the environmental group Eko Centar Visegrad. Click here to view related media. click to expand \"Unfortunately, the huge inflow of garbage has not ceased,\" he added.The Drina River runs 346 kilometers (215 miles) from the mountains of northwestern Montenegro through Serbia and Bosnia. and some of its tributaries are known for their emerald color and breathtaking scenery. A section along the border between Bosnia and Serbia is popular with river rafters when it's not \"garbage season.\"Some 10,000 cubic meters (more than 353,000 cubic feet) of waste are estimated to have amassed behind the Drina River trash barrier in recent days, Furtula said. The same amount was pulled in recent years from that area of the river.Removing the garbage takes up to six months, on average. It ends up at the municipal landfill in Visegrad, which Furtula said \"does not even have sufficient capacity to handle (the city's) municipal waste.\"\"The fires on the (municipal) landfill site are always burning,\" he said, calling the conditions there \"not just a huge environmental and health hazard, but also a big embarrassment for all of us.\" Decades after the devastating 1990s wars that accompanied the breakup of Yugoslavia, the Balkans lag behind the rest of Europe both economically and with regard to environmental protection.The countries of the region have made little progress in building effective, environmentally sound trash disposal systems despite seeking membership in the European Union and adopting some of the EU's laws and regulations.Unauthorized waste dumps dot hills and valleys throughout the region, while trash litters roads and plastic bags hang from the trees.In addition to river pollution, many countries in the western Balkans have other environmental woes. One of the most pressing is the extremely high level of air pollution affecting a number of cities in the region.\"People need to wake up to problems like this,\" Visegrad resident Rados Brekalovic said. Trending News Sections of Balkan river have become a floating garbage dump \"El Chapo\" sends \"SOS\" message to Mexico's president from U.S. prison Massive \"Toadzilla\" as big as a newborn baby found in Australia AWOL Navy SEAL killed in Ukraine, official says Adrift sailor survives 24 days at sea with ketchup and seasonings In: Pollution Read More First published on January 21, 2023 / 9:13 AM © 2023 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. Click here to view related media. click to expand Copyright ©2023 CBS Interactive Inc. All rights reserved. Privacy Policy Do Not Sell My Personal Information Cookies Policy Terms of Use About Advertise Closed Captioning CBS News Live on Paramount+ CBS News Store Site Map Contact Us Help View CBS News In CBS News App Open Chrome Safari Continue f We and our partners use cookies to understand how you use our site, improve your experience and serve you personalized content and advertising. Read about how we use cookies in our cookie policy and how you can control them by clicking Manage Settings. By continuing to use this site, you accept these cookies. Accept Reject Update Consent", "date": "Sat, 21 Jan 2023 14:13:19 GMT", "url": "https://www.cbsnews.com/amp/news/balkan-river-floating-garbage-dump/", "summary": "\n\n- Sections of Balkan river have become a floating garbage dump, and the barrier once again became the outer edge of a massive floating waste dump crammed with plastic.\n- Temperatures dropped in many areas on Friday as rain turned into snow.\n- Aerial view of waste floating in the Drina river near Visegrad, Bosnia, Friday, Jan. 20, 2023.\n- Tons of waste dumped in poorly regulated riverside landfills or directly into the rivers across three Western Balkan countries end up accumulating during high water season in winter and spring, behind a trash barrier in the Drina River in eastern Bosnia."}