{"title": "The AP Interview: Envoy says Taiwan learns from Ukraine war | AP News", "content": "The AP Interview: Envoy says Taiwan learns from Ukraine war | AP NewsAP NEWS Email:GoListenSectionsU.S. NewsWorld NewsPoliticsSportsEntertainmentBusinessTechnologyHealthScienceOdditiesLifestylePhotographyVideosListenSectionsAP Top NewsU.S. NewsWorld NewsAfricaAsia PacificAustraliaEuropeLatin AmericaMiddle EastPoliticsPresident BidenElection coverageCongressSupreme CourtSportsNFL PlayoffsTennisNBANHLCollege basketballMLBEntertainmentFilm ReviewsMoviesMusicTelevisionFashionBusinessU.S. economyFinancial marketsVideosTechnologyHealthCOVID-19MoreAP InvestigationsClimate and environmentOdditiesPhotographyTravelScienceAP Fact CheckLifestyleReligionPress ReleasesTrending NewsAP Top 25 MoviesNFL PlayoffsRussia-Ukraine warSearchhttps://apnews.com/article/taiwan-politics-government-united-states-china-aace5bd86f796473efcd4b65a8daca5fClick to copyEllen KnickmeyerForeign policy, national security, foreign policy & climateEllenKnickmeyerhttps://apnews.com/article/taiwan-politics-government-united-states-china-aace5bd86f796473efcd4b65a8daca5fClick to copyRelated topicsTaiwanPoliticsUnited States governmentTaiwan governmentChina governmentWorld NewsAsia PacificChinaThe AP Interview: Envoy says Taiwan learns from Ukraine warBy ELLEN KNICKMEYERJanuary 21, 2023 GMT1 of 7Taiwan's chief U.S. envoy Bi-khim Hsiao speaks during an interview with The Associated Press at the Taipei Economic and Cultural Representative Office in Washington, Friday, Jan. 20, 2023. (AP Photo/Andrew Harnik)1 of 7Taiwan's chief U.S. envoy Bi-khim Hsiao speaks during an interview with The Associated Press at the Taipei Economic and Cultural Representative Office in Washington, Friday, Jan. 20, 2023. (AP Photo/Andrew Harnik)WASHINGTON (AP) — Taiwan has learned important lessons from Ukraine’s war that would help it deter any attack by China or defend itself if invaded, the self-ruled island’s top envoy to the U.S. said in an interview Friday with The Associated Press.Among the lessons: Do more to prepare military reservists and also civilians for the kind of all-of-society fight that Ukrainians are waging against Russia.“Everything we’re doing now is to prevent the pain and suffering of the tragedy of Ukraine from being repeated in our scenario in Taiwan,” said Bi-khim Hsiao, Taiwan’s representative in Washington.“So ultimately, we seek to deter the use of military force. But in a worst-case scenario, we understand that we have to be better prepared,” Hsiao said.Hsiao spoke at the quiet, more than 130-year-old hilltop mansion that Taiwan uses for official functions in Washington. She talked on a range of Taiwan-US military, diplomatic and trade relations issues shaped by intensifying rivalries with China. ADVERTISEMENTNo Taiwanese flag flew over the building, reflecting Taiwan’s in-between status as a U.S. ally that nonetheless lacks full U.S. diplomatic recognition. The U.S. withdrew that in 1979, on the same day it recognized Beijing as the sole government of China.TaiwanUS, Chinese officials discuss climate, economy, relationshipTaiwan ruling party's new chair vows to safeguard democracyTaiwan chipmaker TSMC says quarterly profit up 78%US, Japan unveil plans to strengthen the allianceThe interview came after a year of higher tensions with China, including the Chinese launching ballistic missiles over Taiwan and temporarily suspending most dialogue with the U.S. after then-House Speaker Nancy Pelosi visited Taiwan in August.Asked if new House Speaker Kevin McCarthy should make good on his earlier pledge to visit Taiwan as well, Hsaio said. “That will be his decision. But I think ultimately the people of Taiwan have welcomed visitors from around the world.”Beijing’s leadership, she added, “has no right to decide or define how we engage with the world.”Taiwan, which split from the mainland in 1949 during a civil war, is claimed by China. The decades-old threat of invasion by China of the self-governed island has sharpened since China cut off communications with the island’s government in 2016. That was after Taiwanese voters elected a government that Beijing suspected of wanting to take Taiwan from self-rule to full independence.ADVERTISEMENTIn Washington, Taiwan’s self-rule is one issue that has strong support from both parties. U.S. administrations for decades have maintained a policy of leaving unsaid whether the U.S. military would come to Taiwan’s defense if China did invade. China’s military shows of force after Pelosi’s visit had some in Congress suggesting it was time for the U.S. to abandon that policy, known as “strategic ambiguity,” and to instead make clear Americans would fight alongside Taiwan. Asked about those calls Friday, Hsiao only praised the existing policy.“It has preserved the status quo for decades, or I should say it has preserved peace,” she said.President Joe Biden has repeatedly volunteered in public comments that the U.S. would come to Taiwan’s defense, only to have aides walk that back with assurances that strategic ambiguity still prevails.ADVERTISEMENTMeanwhile, after watching the Ukrainians’ successful hard-scrabble defense against invading Russian forces, Taiwan realizes it needs to load up on Javelins, Stingers, HIMARS and other small, mobile weapons systems, Hsiao said. The Taiwanese and Americans have reached agreement on some of those, she said.Some security think tanks accuse the U.S. — and the defense industry — of focusing too much of the nation’s billions of dollars in arms deals with Taiwan on advanced, high-dollar aircraft and naval vessels. China’s mightier military could be expected to destroy those big targets at the outset of any attack on Taiwan, some security analysts say.Taiwan is pushing to make sure that a shift to grittier, lower-tech weapon supplies for Taiwanese ground forces “happens as soon as possible,” Hsaio said. Even with the U.S. and other allies pouring billions of dollars worth of such weapons into Ukraine for the active fight there, straining global arms stocks, ”we are assured by our friends in the United States that Taiwan is a very important priority,” she said.ADVERTISEMENTAt home, Taiwan President Tsai Ing-wen announced last month the government was extending compulsory military service for men from four months to a year, and Taiwan is increasing spending on defense. Hsiao would not directly address a report by Nikkei Asia on Friday that U.S. National Guard members had begun work training in Taiwan, saying only that Taiwan was exploring ways to work with the U.S. Guard members to improve training.Ukraine’s experience has had lessons for the U.S. and other allies as well, she said, including the importance of a united allied stand behind threatened democracies. “It’s critical to send a consistent message to the authoritarian leaders that force is never an option ... force will be met by a strong international response, including consequences,” Hsiao said.Hsiao also spoke on the United States’ push under the Biden administration to boost U.S. production of computer chips. Supply chain disruptions during the coronavirus pandemic have underscored semiconductors’ crucial importance to the U.S. economy and military — and the extent of U.S. reliance on chip imports.ADVERTISEMENTGreater U.S. production will push the nation into more direct trade competition with Taiwan, which is a global leader, especially for advanced semiconductors. Concern that China could interfere with semiconductor shipping through the Taiwan Strait has helped drive the United States’ new production effort.Hsiao pointed out that Taiwan’s computer chip industry took decades to develop and expressed confidence it “will continue to be an indispensable and irreplaceable contributor to global supply chains in the decades to come.”She noted Taiwan’s investment of $40 billion in a new semiconductor plant in Arizona, a project big enough that Biden visited the site last month, and expressed frustration at what she called a continuing U.S. financial penalty for Taiwanese companies doing business in the United States.The United States’ diplomatic non-recognition of Taiwan as a country means that Taiwan – unlike China and other top U.S. trading partners – lacks a tax treaty with the U.S. and thus pays extra taxes.Surmounting hurdles to fix that would make U.S.-Taiwan business investments “much more successful and sustainable in the long run,” she said.AP NEWSTop StoriesVideoContact UsAccessibility StatementCookie SettingsDownload AP NEWSConnect with the definitive source for global and local newsMore from APap.orgAP InsightsAP Definitive Source BlogAP Images SpotlightAP ExploreAP BooksAP StylebookFollow APThe Associated PressAboutContactCustomer SupportCareersTerms & ConditionsPrivacyAll contents © copyright 2023 The Associated Press. All rights reserved.", "date": "Fri, 20 Jan 2023 22:57:21 GMT", "url": "https://apnews.com/article/taiwan-politics-government-united-states-china-aace5bd86f796473efcd4b65a8daca5f", "summary": "\n\n-The U.S. has withdrawn its diplomatic recognition of Taiwan, but maintains a policy of strategic ambiguity.\n-Taiwan is pushing to make sure that a shift to grittier, lower-tech weapon supplies for Taiwanese ground forces \"happens as soon as possible,\" and the Taiwanese and Americans have reached agreement on some of those supplies.\n-Taiwan is also focusing on increasing its military preparedness in the event of an attack by China or an invasion."}