{"title": "Police fine U.K. PM Rishi Sunak for failing to wear a seatbelt in Instagram video", "content": "Police fine U.K. PM Rishi Sunak for failing to wear a seatbelt in Instagram videoIE 11 is not supported. For an optimal experience visit our site on another browser.SKIP TO CONTENTNBC News LogoPoliticsU.S. NewsWorldCulture and trendsBusinessTechHealthNBC News TiplineShare & Save —SearchSearchProfile My NewsSign Out Sign InCreate your free profileSectionsCoronavirusU.S. NewsPoliticsWorldLocalBusinessHealthInvestigationsCulture MattersScienceSportsTech & MediaVideo FeaturesPhotosWeatherSelectAsian AmericaNBCBLKNBC LatinoNBC OUTtvTodayNightly NewsMSNBCMeet the PressDatelineFeaturedNBC News NowThinkBetterNightly FilmsStay TunedSpecial FeaturesNewslettersPodcastsMore From NBCCNBCNBC.COMNBCU AcademyNBC LearnPeacockNEXT STEPS FOR VETSParent ToolkitNBC News Site MapHelpFollow NBC NewsSearchSearchFacebookTwitterEmailSMSPrintWhatsappRedditPocketFlipboardPinterestLinkedinMy NewsManage ProfileEmail PreferencesSign OutWorldPolice fine U.K. PM Rishi Sunak for failing to wear a seatbelt in Instagram videoIt is the second fixed penalty notice Sunak has received in less a year.Britain's Prime Minister, Rishi Sunak, leaves 10, Downing Street to attend Prime Minister's Questions in the House of Commons on Jan. 18, 2023 in London.Dan Kitwood / Getty ImagesLink copiedJan. 21, 2023, 1:10 PM UTCBy Leila SackurLONDON — Britain's Prime Minister Rishi Sunak was fined by police Friday, for failing to wear a seatbelt whilst filming a clip for social media in a moving vehicle. Sunak became only the second prime minister in history to be hit with a police fine while in the U.K.’s top job after his predecessor Boris Johnson, who was given a fixed penalty notice after it emerged that he had flouted England’s Covid restriction rules during the “partygate” scandal. It is also the second fixed penalty notice Sunak has received in less a year. He also paid £50 ($62) when he was serving as finance minister for attending a gathering to celebrate Johnson's birthday in breach of lockdown rules. It was one of several lawbreaking social events that took place in his home at No. 10 Downing St at a time when members of the public were prevented from seeing family and friends at risk of criminal prosecution. Filmed in the backseat of car, Sunak uploaded the video to Instagram on Thursday during a visit to Lancashire in the north-west of England, where he was raising awareness of government schemes to boost local investment. His lack of seatbelt was quickly spotted by eagle-eyed viewers and Lancashire Constabulary said Friday it was fining Sunak. The force did not say how much the fine was but in the U.K., a person can be fined up to £500 ($619) if they fail to wear a seatbelt unless there is an exception, such as for emergency services, in a taxi, or if a driver is reversing.A spokesperson for Sunak described this as a “a brief error of judgment,” according to Reuters. “He fully accepts this was a mistake and apologises,” they told reporters. Cat Smith, a member of parliament with the U.K.’s main opposition Labour Party whose seat is in Lancashire, thanked police on Twitter for “road safety campaigning all year round” and “also, reminding us that no one is above the law.” The Labour Party’s Deputy Leader Angela Rayner was less forgiving, tweeting Friday that Sunak, who pledged “integrity, professionalism and accountability at every level,” when he took office in October, was a “liability.” The fine caps a difficult week for the prime minister who this week faced criticism for traveling across the U.K. on army jets instead of using public transportation. Rishi Sunak admits ‘mistakes were made’ as he becomes British prime ministerOct. 25, 202204:33However, members of Sunak's Conservative Party have defended their leader after his brush with the law. “Of course it shouldn’t have happened,” Deputy Prime Minister Dominic Raab told British broadcaster Sky News Saturday. “But I think, with these things, what people expect most of all is, you know, the individual concerned, whoever it may be, put their hand up, be honest about it, accept the mistake, pay the fine.” (Sky News is owned by Comcast, the parent company of NBC News.)“I don’t think it’s something which would result in his resignation,” Raab added. Leila SackurAboutContactHelpCareersAd ChoicesPrivacy PolicyDo Not Sell My Personal InformationCA NoticeTerms of ServiceNBC News SitemapAdvertiseSelect ShoppingSelect Personal Finance© 2023 NBC UNIVERSALNBC News LogoMSNBC LogoToday Logo", "date": "Sat, 21 Jan 2023 13:10:13 GMT", "url": "https://www.nbcnews.com/news/world/uk-prime-minister-rishi-sunak-police-fine-seatbelt-instagram-video-rcna66824", "summary": "\n\n-Police fined U.K. Prime Minister Rishi Sunak for failing to wear a seatbelt in an Instagram video.\n-Sunak apologized and said the mistake was a mistake.\n-Members of Sunak's Conservative Party have defended him."}