{"title": "Russia Says Held Air Defense Training in Moscow Region - The Moscow Times", "content": "Russia Says Held Air Defense Training in Moscow Region - The Moscow Times Support The Moscow Times! Contribute today My account Signout × Sections Home Ukraine War News Opinion Business Arts and Life Podcasts Galleries Newsletters TMT Lecture Series Multimedia projects Mothers & Daughters Generation P News Ukraine War Business Opinion Arts and Life Podcasts Newsletters RU My account Signout Support The Moscow Times! Contribute today Now is the time to support independent reporting from Russia! Contribute Today Russia Says Held Air Defense Training in Moscow Region By AFP Jan. 21, 2023 An S-400 rocket system. Valery Sharafulin / TASS The Russian Defense Ministry said Saturday that it held a training exercise on repelling air attacks in the Moscow region. \"In the Moscow region, a training session was held with the personnel of the anti-aircraft missile brigade of the Western Military District on repelling air attacks on important military industrial and administrative facilities,\" the ministry said in a statement. It said a S-300 anti-aircraft missile system was involved in the training as combat was simulated. \"As they marched, soldiers repelled an attack by a mock enemy sabotage group on a military convoy,\" the statement said. \"Under the cover of a smoke screen, the air defense convoy was able to get out of the attack and continue fulfilling its tasks.\" The ministry said 150 soldiers took part in the exercises. But it did not say where in the Moscow region, which surrounds the Russian capital, the training took place. On Friday, the Kremlin refused to say if authorities were preparing for strikes on the capital. Since launching its offensive in Ukraine almost a year ago, Russia has sustained several drone attacks attributed to Kyiv as well as some strikes on border regions. Read more about: Ukraine war Most read Just in Jan. 21, 2023 Pumpkin Surprise for a Bride, Groom or Guest Jan. 21, 2023 Russian Emigres Rally Worldwide in Support of Jailed Navalny Jan. 21, 2023 Russia Says Held Air Defense Training in Moscow Region Jan. 21, 2023 U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' Jan. 20, 2023 Chechen Leader Calls Rumored Ban on Beards in Russian Army ‘Provocation’ Jan. 20, 2023 How Russia’s War Is Impacting the Global Environmental Agenda Jan. 20, 2023 St. Petersburg Artwork Celebrating City's Ties to Mariupol Removed 1 international sanction U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' 2 spreading war Russia Says Held Air Defense Training in Moscow Region 3 ‘not silent’ Russian Emigres Rally Worldwide in Support of Jailed Navalny 4 weekend kitchen Pumpkin Surprise for a Bride, Groom or Guest Read more 'strengthening defenses' Wagner Mercenary Chief Says Launching ‘People’s Militia’ Near Ukraine Border Yevgeny Prigozhin, the Kremlin-linked magnate who leads the notorious Wagner mercenary group, said Wednesday that the private military contractor was &ldquo... opinion Pavel Podvig A Russian Nuclear Strike on Ukraine Is Not a Threat – At Least Not Yet After a few frantic weeks early on in the Ukraine war when all parties found their respective red lines, the issue of nuclear weapons faded into the background... 'technical malfunction' 14 Killed in Russian Fighter Jet Crash Into Residential Building Updates with new casualty figures. A military aircraft crashed Monday into a residential building in the southern port town of Yeysk in Russia's Krasnodar... Marina Ovsyannikova State TV Journalist Who Denounced War in Ukraine Flees Russia Former Russian state television journalist Marina Ovsyannikova, 44, has escaped house arrest and left Russia, her lawyer Dmitry Zakhvatov told Russian... The Moscow Times About us Jobs Advertise with us Privacy Policy Your Personal Information Change Consent Podcasts Videos Galleries Newsletters Follow us Media Partners Faridaily Coda Story Eurasianet Novaya Gazeta Europe The Bell The Eurasian Climate Brief Carnegie Endowment TV Rain Newsroom © The Moscow Times, all rights reserved.", "date": "Sat, 21 Jan 2023 15:28:26 GMT", "url": "https://www.themoscowtimes.com/2023/01/21/russia-says-held-air-defense-training-in-moscow-region-a80003", "summary": "\n\n14 people were killed when a Russian military plane crashed in Moscow. The cause of the crash is not yet known, and the investigation is ongoing."}