{"title": "Hiding in plain sight: how Sicily’s mafia godfather eluded capture for 30 years | Mafia | The Guardian", "content": "Hiding in plain sight: how Sicily’s mafia godfather eluded capture for 30 years | Mafia | The Guardian Skip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentThe ObserverMafiaHiding in plain sight: how Sicily’s mafia godfather eluded capture for 30 yearsMatteo Messina Denaro was arrested this week after three decades on the run. During that time he went out for pizza, watched football, and even took selfies with a doctor Matteo Messina Denaro arrested on Monday, outside the clinic where he went for his Covid test. Photograph: Italian Carabinieri press office/AFP/Getty ImagesMatteo Messina Denaro arrested on Monday, outside the clinic where he went for his Covid test. Photograph: Italian Carabinieri press office/AFP/Getty ImagesTobias JonesSat 21 Jan 2023 08.57 ESTLast modified on Sat 21 Jan 2023 13.36 ESTAt 8.20am last Monday, Andrea Bonafede was queueing at the check-in of a private medical clinic in Palermo, Sicily. Suffering from colon cancer and thought to be 59, he had already undergone two operations and chemotherapy at the clinic, often bringing the staff presents of olive oil and exchanging phone numbers, and text messages, with his fellow patients. He was known to dress in flashy clothes: that morning he was wearing a sheepskin coat, a white hat, Ray-Ban shades and an expensive Franck Muller watch.Waiting for his Covid test, he went outside and walked towards the Fiat Brava, and the driver, that had brought him there. The undercover officers watching him worried that he had realised he was under surveillance and that he might be about to bolt. A colonel from the Carabinieri, Italy’s militarised police, decided to move in: “Are you Matteo Messina Denaro?”“You know who I am,” came the weary reply.A police composite photo of mafia top boss Matteo Messina Denaro, left; and, right, as he looks today. Photograph: APThe 150 police and Carabinieri who had been in position inside and outside the clinic suddenly sprang into action. Totò Schillaci, the former international footballer from Palermo, was caught up in the blitz, later comparing it to “a madhouse, a wild west”. Armed forces in balaclavas burst out of unmarked vehicles and blocked exit routes and streets. After 30 years on the run, Italy’s most wanted man – nicknamed U Siccu, or “Skinny” – had finally been captured.Realising what was happening, members of the public began to applaud. Some high-fived the men in balaclavas. In less than an hour, the arrest of Messina Denaro was front-page news across the globe. The Italian president, Sergio Mattarella (whose brother, Piersanti, was murdered by the mafia in 1980 when he was governor of Sicily) thanked the police and prosecutors. The prime minister, Giorgia Meloni, immediately flew to Palermo to congratulate the special forces on capturing the man who had helped plan a terrorist-style bombing campaign across Italy in 1992 and 1993.In those years, as the certainties of the First Republic disintegrated, the standoff between the Italian state and Cosa Nostra had turned into violent confrontation. Two dogged investigators, Giovanni Falcone and Paolo Borsellino, had persuaded a former mobster, Tommaso Buscetta, to turn state’s witness. The mafia’s secretive organisation and political connections were, for the first time, clearly revealed. In mass trials, 338 mafiosi were convicted.When those sentences were upheld on appeal, the mafia took its brutal revenge: their political protector, Salvo Lima, was executed in March 1992 and later that year both investigators were killed in very public bombings on the island. Falcone, his wife and three bodyguards were murdered on the road between the airport and Palermo in May; Borsellino was murdered in Palermo in July, along with five bodyguards, as he visited his sister and mother. Messina Denaro was involved in the operational planning of both bombings.The following year the terror campaign turned to the mainland. At 1.04am on 27 May 1993, a bomb exploded outside the Uffizi gallery, in Via dei Georgofili in Florence, destroying various works of art and killing five people, including a nine-year-old girl, Nadia, and her two-month-old sister. Two months later, on 27 July, a bomb outside a contemporary art gallery in Milan killed five; the next day, there were two further bombs in Rome, this time without victims. Messina Denaro was convicted, in absentia, of having also ordered and planned the mainland bombing campaign.The scene outside the Uffizi art gallery after the 1993 bombing, in which five people were killed. Photograph: Sipa/REX/ShutterstockBorn in 1962 in the province of Trapani, Matteo Messina Denaro is the son of a convicted mobster who had worked for the wealthy D’Alì family. He became the protege of Totò Riina, the boss of bosses, and was renowned for being both a party-loving womaniser and a ruthless killer. He fell in love with an Austrian woman working in a hotel in Selinunte and when her manager, Nicola Consales, was overheard complaining about the “little mafiosi” who were lounging around the hotel, he was – in Palermo in 1991 – shot dead.A year later, another mobster complained about Riina’s strategy of a frontal assault on the Italian state. Messina Denaro invited Vincenzo Milazzo to a meeting, shot him, and strangled his pregnant partner, Antonella Bonomo. Later that year, he was part of the group that attempted to murder a policeman, Calogero Germanà. When one mafioso turned state’s witness, Messina Denaro was part of the cupola – the group of top mafia bosses – that ordered the kidnap of his 12-year-old son, Giuseppe di Matteo. The boy was held captive for 779 days before being strangled and dissolved in acid. Messina Denaro once boasted that he had killed enough people to fill a cemetery.But during his three decades in hiding, Messina Denaro also took the mafia in a new direction. Drive-by executions and semtex bombings guaranteed only crackdowns and bad headlines, and U Siccu had seen how the Calabrian mafia, the ‘Ndrangheta, had enriched itself by quietly infiltrating and investing in legitimate businesses. Messina Denaro put his dirty money into clean energy, using an unknown electrician as a front to build a wind-power empire worth €1.5bn. He created a €700m chain of 83 shops through another frontman.Investigators became suspicious about various builders and salami-makers who were suddenly making millions through slot machines, stolen archaeological treasures, transport hubs, building companies and tourist resorts and so they began arresting those they suspected of being fronts for the Sicilian “Scarlet Pimpernel”. In 2011 alone, they arrested 140 suspected sidekicks and frontmen, a few of whom flipped and gave investigators insights into Messina Denaro’s business empire.But the man himself remained elusive. Investigators didn’t even know what he looked like. There was only a photograph from 1993 which had been artificially aged. The operation to locate him was called Tramonto (“sunset”), named after a poem written by the nine-year-old Nadia who had been killed in Florence. The breakthrough came when wiretaps of his relatives revealed Messina Denaro had colon cancer. Investigators obtained lists of all patients aged over 55 undergoing oncological treatment for the disease in the provinces of Agrigento, Palermo and Trapani.Giuseppe di Matteo, who was murdered on Messina Denaro’s watch.Of the possible matches, one stood out: Andrea Bonafede was the name of a man on the fringes of the mafia and it emerged that when he was supposed to be on the operating table in Palermo, his phone actually revealed his presence in Campobello di Mazara, near Trapani. The obvious conclusion was that Bonafede had lent his identity to someone who couldn’t reveal their own. On 29 December, “Bonafede” booked an appointment in the Palermo clinic for 16 January and when, last Monday morning, the real Bonafede remained at home, the authorities decided to act.But despite the initial euphoria at the capture of the famous fugitive, details of his life on the run have shocked the country in the last week. Looking surprisingly similar to the artificially aged photograph, Messina Denaro was living openly in Campobello di Mazara, next to his birthplace in Castelvetrano. He used to go regularly to the local bar, pizzeria and even, according to reports, to Palermo’s football stadium. The Viagra found in his flat suggests he had company. One doctor who was treating him took selfies as if he knew he was in the presence of a star. In a town of just over 11,000 people, Messina Denaro was referred for treatment by a GP (known to be a member of a local masonic lodge) who presumably knew the real Bonafede.“He was hiding in plain sight,” says Federico Varese, a professor of criminology at the University of Oxford, and author of Mafia Life. “It is extraordinary and disconcerting that it took 30 years to arrest this man and that speaks to one fact: there was no help from local informants because of a deep mistrust of people in this part of Italy towards institutions of the state.” Another former fugitive, mafia boss Bernardo Provenzano, was able to elude capture for 43 years.But more than just the passive omertà, or silence, of the local community, many investigators spoke last week about active collusion. Pasquale Angelosanto, the commander of the elite troops behind the Tramonto operation, lamented how the long hunt had been “marked by politicians, law enforcement officers and state officials being arrested or investigated for warning the boss that the circle was closing in”. Repeatedly authorities thought an arrest was imminent, only to be foiled at the last minute: on one occasion, police burst into the suspected meeting place in Bagheria where Messina Denaro was thought to be meeting one of his lovers, Maria Masi. They found only fresh caviar, a scarf, a bracelet, Merit cigarettes and a jigsaw, all hastily abandoned.It is extraordinary it took 30 years to arrest this man: there was no help from local informants who mistrust the stateFederico Varese, criminologist and authorThe suspicion of an overlap between institutional figures and organised crime has deepened in recent months: in December last year, Antonio D’Alì – a former under-secretary at the interior ministry during Silvio Berlusconi’s 2001-06 government – was convicted for “external complicity with the mafia”. Both Messina Denaro and his father had worked for the D’Alì family. In September 2022, Totò Cuffaro, a former governor of the island who spent almost five years in prison for “aiding and abetting” Cosa Nostra and breaching investigative secrecy, stood for re-election. His party or “list” won five seats in the regional assembly. In an on-going trial, many other politicians stand accused of negotiating with the mafia in those crisis years of 1992-93.The faint hope that the captured man might collaborate with the authorities and reveal some of the secrets of that dark period has also receded. The decision to appoint his niece, a notorious defender of mafiosi, as his lawyer suggests he will not make any revelations or confessions. Nor is there much hope that the organisation will be significantly weakened. “Mafias are not reducible to their ‘bosses’,” wrote Luigi Ciotti, a lifelong anti-mafia campaigner, last week: “[they have] developed into a lattice of organisations capable of making up for the disappearance of one individual through the strength of the system.”“The longevity of this criminal organisation is extraordinary,” says Varese. “It has been around since the 1830s, far longer than most businesses. We need to ask what is being done to get rid us not just of the head, but of the root causes of the mafia.”Tobias Jones lives in Parma. His most recent book is The Po: An Elegy for Italy’s Longest RiverTopicsMafiaThe ObserverItalyOrganised crimeEuropefeaturesReuse this contentMost viewedMost viewedWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)", "date": "Sat, 21 Jan 2023 18:36:00 GMT", "url": "https://www.theguardian.com/world/2023/jan/21/how-mafia-scarlet-pimpernel-eluded-capture-for-30-years-matteo-messina-denaro", "summary": "\n\n- Matteo Messina Denaro, also known as \"U Siccu\", was arrested this week after 30 years on the run.\n- During that time, he went out for pizza, watched football, and even took selfies with a doctor.\n- He was known to dress in flashy clothes and was involved in the operational planning of two bombings, one on the mainland and one in Sicily.\n- The Italian president, Sergio Mattarella, thanked the police and prosecutors for capturing him. The prime minister, Giorgia Meloni, immediately flew to Palermo to congratulate the special forces.\n\nThe most important points from the article are as follows:\n\n- Matteo Messina Denaro was known to dress in flashy clothes and was involved in the operational planning of two bombings.\n- He was also known to go out for pizza and watch football, and took selfies with a doctor.\n- His capture is a major victory for the Italian police, and the prime minister, Giorgia Meloni, has flown to Palermo to congratulate the special forces."}