{"title": "China plays down COVID outbreak with holiday rush at full tilt | Reuters", "content": "China plays down COVID outbreak with holiday rush at full tilt | Reuters Skip to main contentReuters homeWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsMoreMy ViewRegisterChina5 minute readJanuary 20, 202310:23 PM UTCLast Updated agoChina plays down COVID outbreak with holiday rush at full tiltBy Liz Lee and Alessandro DiviggianoSummaryTop official says COVID at 'relatively low' levelHospital, critical cases dropping, authorities sayMore than 2 billion trips expected over Lunar New YearSome fear travel season could see infections surgeBEIJING, Jan 20 (Reuters) - People across China crowded into trains and buses for one of its busiest days of travel in years on Friday, feeding fears of new surges in a raging COVID-19 outbreak that officials say has hit its peak.In comments reported by state media late Thursday, Vice Premier Sun Chunlan said the virus was at a \"relatively low\" level, while health officials said the number of COVID patients in hospital and with critical conditions was on the decline.But there are widespread doubts about China's official account of an outbreak that has overwhelmed hospitals and funeral homes since Beijing abandoned strict COVID controls and mass testing last month.That policy U-turn, which followed historic protests against the government's tough anti-virus curbs, unleashed COVID on a population of 1.4 billion that had been largely shielded from the disease since it emerged in the city of Wuhan in late 2019.Some health experts expect that more than one million people will die from the disease in China this year, with British-based health data firm Airfinity forecasting COVID fatalities could hit 36,000 a day next week.\"Recently, the overall pandemic in the country is at a relatively low level,\" Sun said in comments reported by the state-run Xinhua news agency.\"The number of critical patients at hospitals is decreasing steadily, though the rescue mission is still heavy.\"She spoke on the eve of one of the most frenetic travel days in China since the start of the pandemic, as millions of city-dwellers travel to their hometowns for the Lunar New Year holiday that officially begins on Saturday.More than 2 billion trips are expected to take place across China between Jan. 7 and Feb. 15, the government estimates.'EAGER TO GO HOME'Excited passengers laden with luggage and boxes of gifts boarded trains on Friday, heading for long-awaited family reunions.\"Everyone is eager to go home. After all, we haven't seen our families for so long,\" a 30-year-old surnamed Li told Reuters at Beijing's West railway station.But for others, the holiday is a reminder of lost loved ones.Gu Bei, a writer from Shanghai, said on the Weibo social media platform that she had been waiting nearly two weeks to have her mother cremated and that the funeral home could not tell her when the service would be scheduled.China's internet regulator said this week it would censor any \"fake information\" about the spread of the virus that could cause \"gloomy\" sentiment during Lunar New Year festivities.[1/4] Travellers wait for their trains at Hangzhou East railway station during the Spring Festival travel rush ahead of the Chinese Lunar New Year, in Hangzhou, Zhejiang province, China January 20, 2023. China Daily via REUTERS 1234\"I heard no dark and gloomy words are allowed during the new year. Then let me mourn my mother now,\" Gu said in her post, which did not specify her mother's cause of death.Spending by funeral homes on items from body bags to cremation ovens has risen in many provinces, documents show, one of several indications of COVID's deadly toll.China has said nearly 60,000 people with COVID died in hospital between Dec. 8 and Jan. 12. However, that toll excludes those who died at home, and some doctors have said they are discouraged from putting COVID on death certificates.PENT-UP DEMANDPresident Xi Jinping said this week that he was concerned about an influx of travellers to rural areas with weak medical systems, and that protecting the elderly - many of whom are not fully vaccinated - was a top priority.The World Health Organization's immunisation director, Kate O'Brien, praised China on Friday for making quick progress on vaccinating older people with COVID shots and boosters since lifting anti-virus controls last month.However, she added that some elderly people found it \"difficult\" to understand changes in its vaccination policy since they had previously been advised not to seek protection.A WHO report on Thursday said China reported a large jump in COVID hospitalisations in the week through Jan. 15, to the highest since the pandemic began. Hospitalisations rose by 70% on the previous week to 63,307, according to the WHO, citing data submitted by Beijing.But in a news conference on Thursday, health officials said the number of COVID patients reporting to hospital had peaked with more than 40% fewer people being treated with critical conditions on Jan. 17 compared with a peak on Jan. 5.While China's reopening has been chaotic, investors are hopeful that it will help revive its $17 trillion economy, placing bets that have lifted Chinese stocks and its yuan currency to multi-month highs.\"Markets widely anticipate a surge of pent-up demand will be unleashed from the reopening of China's economy,\" Nomura analysts said in a note.They cautioned that a fall in household wealth and a surge in youth unemployment, a hangover from years of lockdowns and travel curbs, may temper the rebound.While international flights are in short supply, Chinese tourists, a much-missed mainstay of the world's retail and travel industry, are starting to travel again.Malls from Macau to Bangkok are aiming to lure them in with red lantern displays and special dances to mark the Year of the Rabbit - and steep discounts.Chinese spending on travel had grown to $255 billion in 2019, accounting for 33% of spending in the global luxury personal goods market, according to estimates from the Bain consultancy.Reporting by Liz Lee, Alessandro Diviggiano, Bernard Orr and the Beijing newsroom Writing by John Geddie and Frances Kerry Editing by Robert Birsel and Chizu NomiyamaOur Standards: The Thomson Reuters Trust Principles.Read NextChinacategoryChina says COVID outbreak has infected 80% of population, article with imageJanuary 21, 2023MarketscategoryAmazon's AWS to invest $35 billion in Virginia, article with imageJanuary 21, 2023GalleryBusinesscategoryYellen says setting price caps on Russian refined oil products 'complicated', article with galleryJanuary 21, 2023MarketscategoryGerman finance minister warns against quick decoupling from China, article with image12:04 AM UTC . Updated undefined agoChinaLittle room for gloom at Dublin's Davos for aircraft financiers, article with imageBusinesscategory · January 20, 2023While the prospect of global recession casts a long shadow over the snowy peaks of Davos this week, the mood was mostly sunnier at another gathering of executives - the owners of most of the world's planes - 1,700 kilometres away in Dublin.GalleryWorldcategoryDavos 2023: Outlook brighter than feared, fraught with risks, article with galleryJanuary 20, 2023BusinesscategoryDavos 2023 IKEA sees higher demand in Europe driven by home furnishings - CEO, article with imageJanuary 20, 2023MarketscategoryChina's copper costs driven up by Maike's woes, output glitches, article with imageJanuary 20, 2023GalleryMarketscategoryMilan quietly gears up for return of big-spending Chinese tourists, article with galleryJanuary 20, 2023Site IndexBrowseWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsOpen in new tab, opens new tabLifestyleAbout ReutersAbout ReutersOpen in new tab, opens new tabCareersOpen in new tab, opens new tabReuters News AgencyOpen in new tab, opens new tabBrand Attribution GuidelinesOpen in new tab, opens new tabReuters LeadershipOpen in new tab, opens new tabReuters Fact CheckOpen in new tab, opens new tabReuters Diversity ReportOpen in new tab, opens new tabStay InformedDownload the AppOpen in new tab, opens new tabNewslettersOpen in new tab, opens new tabInformation you can trustReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.Follow UsThomson Reuters ProductsWestlawOpen in new tab, opens new tabBuild the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology.OnesourceOpen in new tab, opens new tabThe most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs.CheckpointOpen in new tab, opens new tabThe industry leader for online information for tax, accounting and finance professionals.Refinitiv ProductsRefinitiv WorkspaceOpen in new tab, opens new tab Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.Refinitiv Data CatalogueOpen in new tab, opens new tab Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.Refinitiv World-CheckOpen in new tab, opens new tabScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.Advertise With UsOpen in new tab, opens new tabAdvertising GuidelinesOpen in new tab, opens new tabCookiesOpen in new tab, opens new tabTerms of UseOpen in new tab, opens new tabPrivacyOpen in new tab, opens new tabDigital AccessibilityOpen in new tab, opens new tabCorrectionsOpen in new tab, opens new tabSite FeedbackOpen in new tab, opens new tabAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2022 Reuters. All rights reserved", "date": "Fri, 20 Jan 2023 22:23:00 GMT", "url": "https://www.reuters.com/world/china/china-says-covid-outbreak-easing-eve-travel-rush-2023-01-20/", "summary": "\n\n-The COVID outbreak has affected over 80% of the Chinese population and there are fears that the holiday season could see a surge in infections.\n-There are also concerns about the economic impact of the outbreak.\n-The article provides a brief summary of the COVID outbreak and the concerns that are being raised about it."}