{"title": "In Mexico, a reporter published a story. The next day he was dead", "content": "In Mexico, a reporter published a story. The next day he was dead HOME MAIL NEWS FINANCE SPORTS ENTERTAINMENT LIFE SEARCH SHOPPING YAHOO PLUS MORE... Download the Yahoo News app Yahoo News Yahoo News Search query Sign in Mail Sign in to view your mail News US Politics World COVID-19 Climate Change Health Science Originals The 360 Skullduggery Podcast Conspiracyland Contact Us … AdvertisementBreaking News:DOJ found classified docs in Biden's Delaware home during Friday search: President's lawyerClose this contentReutersIn Mexico, a reporter published a story. The next day he was deadRead full article1 / 4In Mexico, a reporter published a story. The next day he was deadInterview with wife of late journalist Gustavo Sanchez in Morro de Mazatan189Sarah KinosianJanuary 21, 2023, 2:07 AM·7 min readBy Sarah KinosianMEXICO CITY (Reuters) - Just after sunset on Thursday, February 10th, two men in a white Dodge Ram pickup pulled up in front of Heber Lopez Vasquez's small radio studio in southern Mexico. One man got out, walked inside and shot the 42-year-old journalist dead. Lopez's 12-year-old son Oscar, the only person with him, hid, Lopez's brother told Reuters.Lopez was one of 13 Mexican journalists killed in 2022, according to the Committee to Protect Journalists (CPJ), a New York-based rights group. It was the deadliest year on record for journalists in Mexico, now the most dangerous country for reporters in the world outside the war in Ukraine, where CPJ says 15 reporters were killed last year.A day earlier, Lopez–who ran two online news sites in the southern Oaxaca state–had published a story on Facebook accusing local politician Arminda Espinosa Cartas of corruption related to her re-election efforts.As he lay dead, a nearby patrol car responded to an emergency call, intercepted the pickup and arrested the two men. One of them, it later emerged, was the brother of Espinosa, the politician in Lopez's story.Espinosa has not been charged in connection with Lopez's killing. She did not respond to multiple requests for comment and Reuters could not find any previous comment she made about her role in corruption or on Lopez's story.Her brother and the other man remain detained but have yet to be tried. Their lawyer did not respond to multiple requests for comment.\"I already stopped covering drug trafficking and corruption and Heber's death still scares me,\" said Hiram Moreno, a veteran Oaxacan journalist who was shot three times in 2019, sustaining injuries in the leg and back, after writing about drug deals by local crime groups. His assailant was never identified. \"You cannot count on the government. Self-censorship is the only thing that will keep you safe.\"It is a pattern of fear and intimidation playing out across Mexico, as years of violence and impunity have created what academics call \"silence zones\" where killing and corruption go unchecked and undocumented.Story continues\"In silence zones people don't get access to basic information to conduct their lives,\" said Jan-Albert Hootsen, CPJ's Mexico representative. \"They don't know who to vote for because there are no corruption investigations. They don't know which areas are violent, what they can say and not say, so they stay silent.\"President Andres Manuel Lopez Obrador's spokesman did not respond to a request for comment about attacks on the media.Since the start of Mexico's drug war in 2006, 133 reporters have been killed for motives related to their work, CPJ determined, and another 13 for undetermined reasons. In that time Mexico has registered over 360,000 homicides.Aggression against journalists has spread in recent years to previously less hostile areas–such as Oaxaca and Chiapas–threatening to turn more parts of Mexico into information dead zones, say rights groups like Reporters Without Borders and 10 local journalists.Lopez was the second journalist since mid-2021 to be murdered in Salina Cruz, a Pacific port in Oaxaca. It nestles in the Isthmus of Tehuantepec, a skinny stretch of land connecting the Gulf of Mexico and the Pacific that has become a landing spot for precursor chemicals to make fentanyl and meth, according to three security analysts and a DEA source.Lopez's last story, one of several he wrote about Espinosa, covered the politician's alleged efforts to get a company constructing a breakwater in Salina Cruz's port to threaten workers to cast their vote for her re-election or else be fired.The infrastructure was a part of the Interoceanic Corridor–one of Lopez Obrador's flagship development projects in southern Mexico.Jose Ignacio Martinez, a crime reporter in the isthmus, and nine of Lopez's fellow journalists say since his murder they are more afraid to publish stories delving into the corridor project, drug trafficking and state collusion with organized crime.One outlet Reuters spoke to, which asked not to be named for fear of reprisals, said it had done an investigation on the corridor, but did not feel safe to publish after Lopez's death.Lopez Obrador's spokesman did not respond to a request for comment about corruption accusations related to the corridor.THE MECHANISMIn 2012 the government established the Mechanism for the Protection of Human Rights Defenders and Journalists.Known simply as the Mechanism, the body provides journalists with protections such as panic buttons, surveillance equipment, home police watch, armed guards and relocation. Since 2017, nine Mechanism-protected reporters have been murdered, CPJ found.Journalists and activists may request protection from the Mechanism, which evaluates their case along with a group of human rights defenders, journalists and representatives of nonprofits, as well as officials from various government agencies that make up a governing board. Not all those who request protection receive it, based on the analysis.At present there are 1,600 people enrolled in the Mechanism, including 500 journalists.One of those killed was Gustavo Sanchez, a journalist shot at close range in June 2021 by two motorcycle-riding hitmen. Sanchez, who had written critical articles about politicians and criminal groups, enrolled in the Mechanism for a third time after surviving an assassination attempt in 2020. Protection never arrived.Oaxaca's prosecutor at the time said Sanchez's coverage of local elections would be a primary line of investigation into his murder. No one has been charged in the case.Sanchez's killing triggered Mexico's human rights commission to produce a 100-page investigation into authorities' failings. Evidence \"revealed omissions, delays, negligence and breach of duties by at least 15 public servants,\" said the report.Enrique Irazoque, head of the Interior Ministry's department for the Defense of Human Rights, said the Mechanism accepted the findings, but highlighted the role local authorities played in the protection lag.Fifteen people within government and civil society told Reuters the Mechanism is under-resourced given the scope of the problem. Irazoque agreed, though he noted its staff of 40 increased last year to a staff of 70. Its 2023 budget increased to around $28.8 million from $20 million in 2022.In addition to the shortage of funding, Irazoque said that local authorities, state governments and courts need to do more, but there was a lack of political will.\"The Mechanism is absorbing all the problems, but the issues are not federal, they are local,\" he said in an interview with Reuters.More convictions are what Irazoque believes are most needed, saying the lack of legal repercussions for public officials encourages corruption.Impunity for journalist killings hovers around 89%, a 2021 report from the Interior Ministry, which oversees the Mechanism, showed. Local public servants were the biggest source of violence against journalists, ahead of organized crime, the report found.\"You would think the biggest enemy would be armed groups and organized crime,\" said journalist Patricia Mayorga, who fled Mexico after investigating corruption. \"But really it's the ties between those groups and the state officials that are the problem.\"Many Mexican journalists killed worked for small, independent, digital outlets that sometimes only published on Facebook, noted Irazoque, saying their stories dug deep into local political issues.Mexico's National Association of Mayors (ANAC) and its National Conference of Governors (CONAGO) did not respond to requests for comment about the role of state and local governments in journalist killings or allegations of corrupt ties to crime groups.President Lopez Obrador frequently pillories the press, calling out reporters critical of his administration and holding a weekly segment in his daily news conference dedicated to the \"lies of the week.\" He condemns the murders, while accusing adversaries of talking up the violence to discredit him.Irazoque says he has no evidence the president's verbal attacks have led to violence against journalists. Lopez Obrador's spokesman did not respond to a request for comment.\"What type of life is this?,\" journalist Rodolfo Montes said, eyeing security footage from inside his home where the Mechanism, in which he first enrolled in 2017, had installed cameras with eyes on the garage, street and entryway.Years earlier, a cartel rolled a bullet under the door as a threat, and he has been on edge ever since. An entire archive box of threats spread over a decade sat in the corner. Looking down at his phone after a cartel threatened his 24-year-old daughter just a few days before, he said, \"I'm living, but I'm dead, you know?\"(Editing by Claudia Parsons and Dave Graham; Additional reporting by Pepe Cortes in Oaxaca) AdvertisementAdvertisementTRENDINGABC NewsElizabeth Holmes bought one-way ticket to Mexico, prosecutors sayABC News·3 min readThe Daily BeastNew Brett Kavanaugh Sexual Assault Allegations Revealed in Secret Sundance DocThe Daily Beast·5 min readReutersRussia's Wagner chief writes to White House over new U.S. sanctionsReuters·1 min readINSIDERA woman who got wasted at a Marilyn Manson concert blew up $15 million worth of property. She's suing the company that served her.INSIDER·2 min readYahoo NewsFormer GOP Sen. Rob Portman: Trump won't be the Republican nomineeYahoo News·6 min readAdvertisementPOPULARThe fatal story of a Mexican reporterReuters Videos AdAmazon Left In Chaos After Shoppers Found This OutAd•Capital One ShoppingWhy this Ad?I like this adI don't like this adGo ad-free* Details emerge after shooting in Lakewood leaves 18-year-old deadCBS-DenverMan found dead in crashed car after up to 15 shots fired in East EndKTRK – Houston1 dead and 1 injured at Southern UniversityWDSU - New OrleansAdvertisementAdvertisement", "date": "Sat, 21 Jan 2023 10:07:59 GMT", "url": "https://news.yahoo.com/mexico-reporter-published-story-next-100759751.html", "summary": "\n\n-In Mexico, a reporter was killed the next day after publishing a story.\n-His wife spoke to Reuters about the fear journalists now live with, and said that aggression against journalists has spread to previously less hostile areas.\n-Since 2006, 133 reporters have been killed for motives related to their work, and 360,000 homicides have been registered in Mexico.\n-The Mechanism for the Protection of Human Rights Defenders and Journalists provides journalists with protections, such as home police watch, surveillance equipment, and relocation.\n-Since 2017, nine Mechanism-protected reporters have been murdered.\n-Journalists and activists may request protection from the Mechanism, which evaluates their case along with a group of human rights defenders, journalists, and representatives of nonprofits. Not all those who request protection receive it, based on the analysis.\n-At present, there are 1,600 people enrolled in the Mechanism, including 500 journalists."}