{"title": "Massive cane toad in Australian park, 'Toadzilla,' a record-breaker", "content": "Massive cane toad in Australian park, 'Toadzilla,' a record-breakerSkip to main content HomeElectionsPoliticsUkraineAbortion newsFactcheckVisual ExplainersCoronavirusNewslettersNationRace in AmericaWorldInvestigationsHealthEducationWeatherJust the FAQsVertical Storytelling Record-breaking 'Toadzilla' cane toad found in Australian parkCamille Fine | USA TODAYShow Caption Hide Caption 'Toadzilla:' Unexpectedly large cane toad discovered in AustraliaThe cane toad weighed in at nearly 6 pounds. Local news reported the toad was euthanized and taken to the Queensland Museum.Cody Godwin, USA TODAYA new “King of the Toads” discovered by Australian park rangers has been christened \"Toadzilla\" – and may lay claim to the coveted title of world’s biggest toad. Toadzilla, believed to be a female, was found deep in Conway National Park rainforest on Jan. 12 by park rangers who were \"shocked\" to find the animal while on patrol. Ranger Kylee Gray and her colleagues weighed the amphibian, which came in at a record-breaking 6 pounds. The last record, according to Guinness World Records, was set in 1991 by a Swedish pet toad at 5.8 pounds.Gray’s colleague, senior park ranger Barry Nolan, told Reuters the creature – an invasive cane toad that poses a threat to Australia's ecosystem – was euthanized like most other toads across Australia. Cane toads’ population exploded in Australia after they were introduced in 1935 to control cane beetles and other pests because they faced no natural predators, Nolan told the outlet.The world's oldest living dog: A chihuahua named Spike, takes Guinness World RecordMust-have cat calendar for 2023: Army Corps of Engineers depicts giant cats on infrastructure“A female cane toad like potentially Toadzilla would lay up to 35,000 eggs. So their capacity to reproduce is quite staggering. And all parts of the cane toad’s breeding cycle are poisonous to Australian native species, so prevention is a big part of how we need to manage them,” he said.Toadzilla’s body was donated to the Queensland Museum for research.Camille Fine is a trending visual producer on USA TODAY's NOW team. What's everyone talking about? Sign up for our trending newsletter to get the latest news of the day Facebook Twitter EmailShare your feedback to help improve our site!HelpTerms of ServiceYour California Privacy Rights/Privacy PolicyPrivacy PolicySite MapAccessibilityOur Ethical PrinciplesDo Not Sell My Info/Cookie Policy © Copyright Gannett 2023", "date": "Fri, 20 Jan 2023 16:08:01 GMT", "url": "https://www.usatoday.com/story/news/world/2023/01/20/worlds-largest-cane-toad-australia-toadzilla/11088915002/", "summary": "\n\nA new \"King of the Toads\" discovered by Australian park rangers has been christened \"Toadzilla\" - and may lay claim to the coveted title of world’s biggest toad. Toadzilla, believed to be a female, was found deep in Conway National Park rainforest on Jan. 12 by park rangers who were \"shocked\" to find the animal while on patrol. Ranger Kylee Gray and her colleagues weighed the amphibian, which came in at a record-breaking 6 pounds. The last record, according to Guinness World Records, was set in 1991 by a Swedish pet toad at 5.8 pounds.\n\nGray’s colleague, senior park ranger Barry Nolan, told Reuters the creature – an invasive cane toad that poses a threat to Australia's ecosystem – was euthanized like most other toads across Australia. Cane toads’ population exploded in Australia after they were introduced in 1935 to control cane beetles and other pests because they faced no natural predators, Nolan told the outlet.\n\nThe world's oldest living dog: A chihuahua named Spike, takes Guinness World Record\n\nMust-have cat calendar for 2023: Army Corps of Engineers depicts giant cats on infrastructure"}