{"title": "Macron wants €400 billion to ‘transform’ France’s forces through 2030", "content": "Macron wants €400 billion to ‘transform’ France’s forces through 2030 Sections Air Warfare Land Naval Space Cyber(Opens in new window) C4ISR(Opens in new window) Pentagon Congress Global TV/Video Thought LeadershipAir WarfareLandNavalPentagonCongressBudgetCyber(Opens in new window)C4ISR(Opens in new window)SpaceTraining & SimUnmannedGlobalAsia PacificEuropeMideast AfricaThe AmericasIndustryMilTechInterviewsOpinionEditorialCommentaryTop 100 CompaniesTV/VideoDefense News WeeklyMoney MinuteOutlookThought LeadershipWhitepapers & eBooks(Opens in new window)DSDs & SMRs(Opens in new window)Webcasts(Opens in new window)Events(Opens in new window)Newsletters(Opens in new window)Events CalendarNativeEarly Bird BriefDigital Edition(Opens in new window)SubscribeEuropeMacron wants €400 billion to ‘transform’ France’s forces through 2030By Vivienne Machi Jan 20, 06:15 PMFrance's President Emmanuel Macron walks on the deck of the amphibious helicopter carrier Dixmude docked in the French Navy base of Toulon, Southern France on Nov. 9, 2022. (Photo by Eric Gaillard/Pool/AFP via Getty Images)STUTTGART, Germany — Seven months after declaring the launch of a new “war economy” in France, President Emmanuel Macron has unveiled plans to spend hundreds of billions of euros on defense investments that will “transform” the military over the next decade.The nation’s next six-year military programming law – known in French as the “loi de programmation militaire,” or LPM – will shape the nation’s defense spending between 2024-2030. Drawing on current geopolitical circumstances and technological developments, Macron will request a €400 billion ($433.4 billion) investment for the 2024-2030 LPM, he announced in a Friday speech at the nation’s Mont-de-Marsan Air Base in southwestern France.If enacted, that sum would reflect a 35% increase over the current 2019-2025 LPM of €295 billion, and could cover a total of €413 billion military needs, he claimed.The current 2019-2025 LPM’s directive was simple: to “repair our armies,” Macron said. While that effort has progressed and is ongoing, the next LPM will empower France to “transform” its services to more quickly respond to global threats to its territories, he added.With the proposed funds, France will strengthen and modernize its deterrence, and “massively” boost its intelligence capabilities by at least 60%, including doubling the budgets of the nation’s two main intel and security organizations, Macron asserted. Increased surveillance, particularly via unmanned aerial systems (UAS) is also a priority, along with doubling the capacity to counter cyber attacks.Macron also spoke of “hardening” the military’s current capabilities under the proposed plan, including transitioning France’s Air Force to a 100% Rafale fighter fleet, away from the current mix of Rafales and Mirage 2000s, both built by Dassault Aviation. He did not elaborate on how that transition might occur.Other priorities include reinforcing the prowess and protection of France’s frigates, the ongoing modernization of its terrestrial systems, and buttressing its air defense and anti-submarine warfare capabilities. He confirmed that France’s next aircraft carrier – known as PANG for porte-avion nouvelle generation – will be built under this budget, and called for the development of new long-range guided munitions, with a twofold funding increase to do so.Macron also cited the need for France to invest in quantum technologies, and to more seamlessly integrate drone and artificial intelligence capabilities into its services. He reinforced the need for France to invest in undersea technologies that can reach depths of 6,000 meters, and announced plans to soon unveil a new “overseas strategy” that would support the nation’s overseas territories, calling the Indo-Pacific region the primary potential theater for future conflict.In his Friday speech, the president also issued a call to France’s defense industry to increase their efficiency and availability in producing new capabilities. Production cycles need to be shortened, and costs must be better controlled, he noted.Despite the considerable increase in funding over the previous law, the 2024-2030 LPM contains “no luxuries, no pleasures, no comforts,” Macron claimed. “There is only what is necessary.”The proposal will be sent in the near future to France’s parliament, he said, ahead of congressional debates expected in March, and a vote by summer 2023.About Vivienne MachiVivienne Machi is a reporter based in Stuttgart, Germany, contributing to Defense News' European coverage. She previously reported for National Defense Magazine, Defense Daily, Via Satellite, Foreign Policy and the Dayton Daily News. She was named the Defence Media Awards' best young defense journalist in 2020.Share:More In EuropeAmazon, other Pentagon cloud service providers face zero-trust testAmazon, Google, Microsoft and Oracle each told the Pentagon they could instate at least basic levels of zero trust, a cybersecurity official said.Pentagon strategy calls for integrated satellite comm networksThe plan features a three-phased approach, starting in fiscal 2023 with improving data standards — a step aimed at enabling better information sharing.Defense Innovation Unit eyes partnerships for drone-vetting effortDIU's Blue UAS has become the government standard for certifying drones that meet federal cybersecurity and supply chain requirements.Northrop, AT&T, Fujitsu relay intel with 5G during testing at new labWord of the successful demonstration comes nearly one year after Northrop and AT&T announced they would jointly develop a \"digital battle network.\"US military services exchanging cloud-computing wisdom amid JADC2 pushThe Army is expected to spend some $290 million on cloud uptake in the coming months, amid a push service officials dubbed the “year of action.”Featured VideoNew parental leave policy and Ukraine aid update | Defense News Weekly Full Episode 1.14.23Important financial steps to take before deployment — Money MinuteCanada expands joint strike fighter fleet | Defense DollarsStar of new movie talks bond between athletes, troopsTrending NowDARPA takes big step forward on X-plane that maneuvers with air burstsMacron wants €400 billion to ‘transform’ France’s forces through 2030British naval forces get specialized vessel for seabed operationsHouse authorizes training for Ukrainian pilots to use US aircraftFleet Forces team tackles ‘decoupling’ destroyers from carriersDefense News © 2022Defense News © 2022Terms of UsePrivacy PolicyTerms of ServiceGet UsSubscribeNewsletters(Opens in new window)Events(Opens in new window)RSS Feeds(Opens in new window)Contact UsAdvertiseGeneral Contacts, Subscription ServicesEditorial StaffAbout UsAbout UsCareers(Opens in new window)", "date": "Fri, 20 Jan 2023 18:15:32 GMT", "url": "https://www.defensenews.com/global/europe/2023/01/20/macron-wants-400-billion-to-transform-frances-forces-through-2030/", "summary": "\n\n-President Macron has announced plans to spend hundreds of billions of euros on defense investments that will \"transform\" the military over the next decade.\n-The proposed funds would reflect a 35% increase over the current 2019-2025 LPM of €295 billion, and could cover a total of €413 billion military needs.\n-Other priorities include reinforcing the prowess and protection of France’s frigates, the ongoing modernization of its terrestrial systems, and buttressing its air defense and anti-submarine warfare capabilities.\n-He confirmed that France’s next aircraft carrier – known as PANG for porte-avion nouvelle generation – will be built under this budget, and called for the development of new long-range guided munitions, with a twofold funding increase to do so.\n-Macron also cited the need for France to invest in quantum technologies, and to more seamlessly integrate drone and artificial intelligence capabilities into its services.\n-He reinforced the need for France to invest in undersea technologies that can reach depths of 6,000 meters, and announced plans to soon unveil a new “overseas strategy” that would support the nation’s overseas territories, calling the Indo-Pacific region the primary potential theater for future conflict."}