{"title": "Lula to visit Amazon amid vow to tackle Yanomami Indigenous crisis | Brazil | The Guardian", "content": "Lula to visit Amazon amid vow to tackle Yanomami Indigenous crisis | Brazil | The Guardian Skip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentBrazilLula to visit Amazon amid vow to tackle Yanomami Indigenous crisisMove comes after country’s minister for Indigenous people says issue is an ‘absolute priority’ On Friday, Lula announced he and Sônia Guajajara would make the visit to lead the government’s response to ‘outrageous levels of malnutrition’. Photograph: Douglas Magno/AFP/Getty ImagesOn Friday, Lula announced he and Sônia Guajajara would make the visit to lead the government’s response to ‘outrageous levels of malnutrition’. Photograph: Douglas Magno/AFP/Getty ImagesTom Phillips in BrasíliaFri 20 Jan 2023 20.31 ESTFirst published on Fri 20 Jan 2023 15.18 ESTBrazil’s first-ever minister for Indigenous peoples, Sônia Guajajara, has vowed to make tackling the humanitarian crisis plaguing the country’s largest Indigenous territory “an absolute priority”, as she prepared to fly into the region with the new president Luiz Inácio Lula da Silva.Under the former president, Jair Bolsonaro, thousands of illegal gold miners poured into the Yanomami enclave in the Amazon, bringing violence, pollution and a healthcare calamity captured in a recent series of photographs of severely malnourished children and adults.On Friday, Lula announced that he and Guajajara would make an emergency visit to the Amazon state of Roraima, where the Yanomami territory is located, to lead the government’s response to the “outrageous levels of malnutrition”.“Our Yanomami relatives are facing a humanitarian and health crisis. We cannot allow our relatives to die of malnutrition and hunger,” Guajajara tweeted.In December, shortly before being named minister, Guajajara visited the region to denounce an illegal 75-mile road powerful mining mafias had carved out of the 96,650 sq km (37,300 sq mile) territory.Interviewed last week in Brasília, she said solving the Yanomami crisis – which had exposed Yanomami children to horrifying levels of malaria, verminosis, malnutrition and diarrhoea – was at the top of her in-tray.Sônia Guajajara, Brazil’s first-ever minister for Indigenous peoples. Photograph: Valentina Ricardo“Every 72 hours a child is dying from one of these illnesses, according to the information we’ve received,” said Guajajara, who was born in the Araribóia territory of the Amazon. “Children are dying because of the polluted water and the lack of food caused by the presence of the illegal miners.”The 48-year-old politician said she had spoken to Brazil’s new justice minister, Flávio Dino, about launching a major security operation that would deploy troops to expel an estimated 20,000 miners from the supposedly protected territory, where about 27,000 members of the Yanomami and Ye’kwana peoples live.If Lula’s new government approved such plans, “we will be able to get these invaders out … in less than three months”, Guajajara said.On Monday, the health ministry dispatched a multidisciplinary team on a 10-day mission to the Yanomami territory to assess the health crisis.Thousands of tin ore and gold miners were removed from Yanomami lands in the early 1990s after global outrage at their impact on the region’s remote communities. A 9.6m-hectare reserve was created to safeguard Yanomami lives.But within a decade the prospectors had returned, with the number reaching new heights during Bolsonaro’s 2019-2022 administration as his anti-environmental rhetoric and policies emboldened rainforest wreckers.Guajajara recognised such an eviction would create an “emergency situation” outside the Yanomami territory, as huge numbers of impoverished garimpeiro (independent prospectors) found themselves out of work.A Yanomami man stands near an illegal gold mine. Photograph: Bruno Kelly/Reuters“These miners come from all over the country and end up being victims of this whole process too. We need to punish the politicians and business people who own these mines,” she said.“These are the ones who must be penalised. The miners are engaged in illegal activity. But often they’re doing it out of necessity rather than because they want to be. So we consider them victims too.”Guajajara said another of her ministry’s priorities would be supporting isolated Indigenous groups in the Amazon’s Javari valley region, where the British journalist Dom Phillips and the Brazilian Indigenous expert Bruno Pereira were murdered last June while documenting Indigenous efforts to protect the rainforest.Guajajara said that seven months on, the Javari continued to be blighted by “violence, persecution and murder” despite the domestic and international outcry.Beto Marubo, a Javari leader who was close to Pereira, said there had been little sign of action to protect the region’s Indigenous defenders since the two men were shot on the Itaquaí River.Marubo predicted the newly created ministry for Indigenous peoples would face major obstacles as it pursued ambitious goals.“We will have to deal with an extremely conservative congress containing people with absolutely no commitment to Indigenous rights or the environment,” he said.A protest in São Paulo calls for the demarcation of Indigenous land and for justice after the murders of Dom Phillips and Bruno Pereira. Photograph: Nelson Almeida/AFP/Getty Images“But it’s undeniably a historic event,” added Marubo, who hoped the start of Lula’s new government – which began on 1 January 2023 – increased the chances there would be justice after the murders of Phillips and Pereira.In her first speech as minister last week, Guajajara admitted the legacy of centuries of violence and discriminations towards Indigenous people that followed the “discovery” of Brazil in the year 1500 would not be vanquished overnight. “We know it will not be easy to overcome 522 years in four,” she said.But Guajajara believed Lula was genuinely committed to the Indigenous cause. “He’s not just pretending to support us – he really wants to make a difference and to do things differently to how they were done in the past,” she said.On Wednesday, during his first major TV interview this year, Lula vowed to “fight tooth and nail” to halt Amazon deforestation by 2030 and announced plans for a special division of the federal police to combat deforestation and drug trafficking.Guajajara said the new ministry – and the decision to put the Indigenous politician Joênia Wapichana in charge of the Indigenous agency Funai - was the fruit of generations of Indigenous struggle.“It’s unbelievable. Sometimes it feels like it’s still a dream,” she said. “But when you look back at the journey we made to reach this point, you see that this didn’t happen by chance – and it wasn’t easy.”TopicsBrazilIndigenous peoplesAmazon rainforestAmericasLuiz Inácio Lula da SilvanewsReuse this contentMost viewedMost viewedWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)", "date": "Fri, 20 Jan 2023 20:18:00 GMT", "url": "https://www.theguardian.com/world/2023/jan/20/brazil-indigenous-minister-sonia-guajajara-yanomami-crisis-illegal-miners", "summary": "\n\n- Brazil's new minister for Indigenous peoples, Sônia Guajajara, has vowed to make tackling the humanitarian crisis plaguing the country's largest Indigenous territory \"an absolute priority.\"\n- If Lula's new government approves such plans, \"we will be able to get these invaders out … in less than three months\"\n- Guajajara said another of her ministry's priorities would be supporting isolated Indigenous groups in the Amazon's Javari valley region, where the British journalist Dom Phillips and the Brazilian Indigenous expert Bruno Pereira were murdered last June while documenting Indigenous efforts to protect the rainforest."}