{"title": "Seoul fire highlights inequality between rich Gangnam, Guryong village - The Washington Post", "content": "Seoul fire highlights inequality between rich Gangnam, Guryong village - The Washington PostAccessibility statementSkip to main contentSearch NavigationDemocracy Dies in DarknessSign inThe Washington PostDemocracy Dies in DarknessWorldWar In Ukraine Africa Americas Asia Europe Middle East Foreign Correspondents AsiaGangnam fire highlights inequality in Seoul’s richest areaBy Min Joo KimJanuary 20, 2023 at 5:05 a.m. ESTOn Jan. 20, a large fire destroyed dozens of homes in Guryong village, the last shantytown in the glitzy Gangnam district of Seoul. (Video: Reuters)ListenComment on this storyCommentGift ArticleShareSEOUL — The Seoul neighborhood of Gangnam is synonymous worldwide with conspicuous consumption and glitzy high-rises, thanks to K-pop singer Psy’s megahit “Gangnam Style.” Lesser known is a shantytown in a corner of Gangnam district, whose makeshift homes were destroyed by a fire on Friday.Are you on Telegram? Subscribe to our channel for the latest updates on Russia’s war in Ukraine.ArrowRightThe blaze is the latest in fire, flood and other disasters over the years that have affected Guryong, one of Seoul’s last remaining slums.Some 60 homes were destroyed in the fire that raged for more than three hours after it broke out around 6:30 a.m. local time, said Shin Yong-ho, an official at the Gangnam Fire Station. No casualties were immediately reported.The flames were mostly extinguished by 10:10 a.m. after hundreds of firefighters, police officers and public workers were dispatched to the area. Dozens of firetrucks and 10 helicopters were also deployed.AdvertisementThe fire prompted an emergency instruction from South Korean President Yoon Suk Yeol, who expressed alarm about the “fire vulnerability of Guryong’s closely packed houses.” Yoon, who is in Switzerland for the World Economic Forum, called on officials to mobilize all available resources to prevent casualties, according to presidential spokeswoman Kim Eun-hye.The fire appears to have started at one of the dwellings, made with plywood and plastic sheets, Shin said. Investigations are underway to identify the exact cause.Guryong village started as a settlement for Seoul residents displaced as a result of the city’s urban renewal project ahead of the 1988 Summer Olympics. As part of the project, South Korea’s military dictatorship summarily cleared away low-income neighborhoods.For Seoul’s Olympics makeover, hundreds of thousands of residents saw their houses razed to make way for new roads, skyscrapers, stadiums and parks. Many of those evicted flocked to the barren hills outside Seoul and built makeshift homes to form what are now called “moon villages,” for their high elevation.AdvertisementThese slums still remain in Seoul, one of the most developed cities in the world. One of these moon villages served as the backdrop for the 2019 Oscar-winning South Korean film “Parasite,” a black comedy depicting the wide social divide in the country.Many residents of these villages are in their 60s or older, struggling to make ends meet amid a welfare shortfall in the rapidly aging society. Official data shows that around 40 percent of senior citizens in South Korea live in poverty, ranking the highest among the OECD group of developed nations.In Guryong, many of the elderly residents struggle with age-related health issues, according to Lee Un-cheol, deputy head of Guryong’s local community group. He told a radio interview that residents were notified promptly of the fire via emergency communications, and helpers were dispatched to evacuate those with impaired mobility.The cardboard shacks lining Guryong’s winding alleys have long been exposed to fire and other safety risks. There have been at least 16 instances of fire at the village since 2009, including one that killed a resident in 2014.The shantytown was also severely hit by last summer’s record rainfall and typhoons, which inflicted heavy economic losses on the capital. Despite repeated damage in Guryong, government plans for redevelopment of the area have made little headway over the years, because of disagreements over compensation and other issues.AdvertisementSeoul Mayor Oh Se-hoon visited the fire-hit village and instructed officials to draw up a relocation plan for those who lost homes in the incident. Gangnam authorities have secured dozens of hotel rooms as temporary dwellings for them. Fire authorities said some 500 residents were evacuated in the wake of the fire.Lim Jong-rye, an 82-year-old Guryong resident, told a local newspaper that he and his neighbors are “in disarray” and had nowhere to go ahead of the Lunar New Year, a major holiday in South Korea. CommentsGiftOutlineGift ArticleView moreLoading...TOP STORIESGoing GlobalEssential reporting and analysis from correspondents around the world.Air defenses deployed in Moscow, signaling fear of strikes on capitalTank dispute splits Ukraine’s allies as Zelensky seeks more firepower‘No life’ in Syrian cities as fuel crisis plunges country into darkness RefreshTry a different topicSign in or create a free account to save your preferencesCompanyAbout The Post Newsroom Policies & Standards Diversity and Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement Get The PostGift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Newspaper in Education Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsContact the Newsroom Contact Customer Care Contact the Opinions team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of UseDigital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Ad Choices washingtonpost.com © 1996-2023 The Washington Postwashingtonpost.com © 1996-2023 The Washington PostAbout The Post Contact the Newsroom Contact Customer Care Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App Policies & Standards Terms of Service Privacy Policy Cookie Settings Print Products Terms of Sale Digital Products Terms of Sale Submissions & Discussion Policy RSS Terms of Service Ad Choices", "date": "Fri, 20 Jan 2023 13:05:00 GMT", "url": "https://www.washingtonpost.com/world/2023/01/20/seoul-gangnam-fire-south-korea/", "summary": "\n\n-A fire destroyed dozens of homes in a slum in the Gangnam district of Seoul, highlighting inequality between the rich and poor in the country.\n-President Yoon Suk Yeol has called for all available resources to be mobilized to prevent casualties.\n-The fire was preceded by heavy rainfall and typhoons, which inflicted heavy economic losses on the capital.\n-Residents of the slum were notified promptly of the fire via emergency communications, and helpers were dispatched to evacuate those with impaired mobility.\n-The shantytown was also severely hit by last summer’s record rainfall and typhoons.\n-Gangnam authorities have secured dozens of hotel rooms as temporary dwellings for them."}