{"title": "Finland promises 400 million euros of aid to Ukraine, could add Leopards", "content": "Finland promises 400 million euros of aid to Ukraine, could add Leopards HOME MAIL NEWS FINANCE SPORTS ENTERTAINMENT LIFE SEARCH SHOPPING YAHOO PLUS MORE... Download the Yahoo News app Yahoo News Yahoo News Search query Sign in Mail News US Politics World COVID-19 Climate Change Health Science Originals The 360 Skullduggery Podcast Conspiracyland Contact Us Some parts of this page are not supported on your current browser version. Please upgrade to a recent browser version. AdvertisementBreaking News:DOJ found classified docs in Biden's Delaware home during Friday search: President's lawyerClose this contentReutersFinland promises 400 million euros of aid to Ukraine, could add LeopardsRead full articleAftermath of Dnipro apartment block destruction following missile strike36January 20, 2023, 12:54 AM·1 min readHELSINKI (Reuters) - Finland announced on Friday a new donation of more than 400 million euros ($434 million) worth of defence equipment for Ukraine, not including Leopard 2 heavy tanks which it said it could also send if there is an agreement with allies.The new donation would triple the total value of Finland's defence aid to Ukraine, bringing the total so far to 590 million euros, the Defence Ministry said in a statement.Miika Pynnonen, special adviser to Finland's defence minister, said a decision on donating Leopard 2 tanks, of which Finland has some 200, would be taken separately, following discussions with allies at Ramstein air base in Germany.\"I can only say that this package does not include Leopard tanks. (...) It consists of heavy weaponry and ammunition,\" Pynnonen told Reuters.Finland had earlier indicated it could send the German-made Leopard tanks if there were agreement among allies.Donation of the newest aid package became possible with the help of neighbouring Sweden, which agreed to help Finland quickly replace the donated equipment in case of a crisis. The two historically neutral Nordic countries are simultaneously applying to join the NATO Western military alliance NATO.The defence ministers of Finland and Sweden are to sign a Statement of Intent (SoI) on support for Ukraine in Ramstein later today, the Finnish ministry said.Under that agreement \"Finland supplies defence materiel to Ukraine, and Sweden expresses its readiness to support Finland as necessary,\" it said.The Swedish minister of defence, Pal Jonson, said the two countries \"are each other's closest allies and today's letter of intent shows that there is no predetermined limit to how this cooperation can develop\".($1 = 0.9227 euros)(Reporting by Anne Kauranen; Editing by Peter Graff) Advertisement AdvertisementTRENDINGABC NewsElizabeth Holmes bought one-way ticket to Mexico, prosecutors sayABC News·3 min readThe Daily BeastNew Brett Kavanaugh Sexual Assault Allegations Revealed in Secret Sundance DocThe Daily Beast·5 min readReutersRussia's Wagner chief writes to White House over new U.S. sanctionsReuters·1 min readINSIDERA woman who got wasted at a Marilyn Manson concert blew up $15 million worth of property. She's suing the company that served her.INSIDER·2 min readYahoo NewsFormer GOP Sen. Rob Portman: Trump won't be the Republican nomineeYahoo News·6 min readAdvertisementPOPULAR\"Breakthrough\": Ukrainian tank crews to start training with German Leopard 2Ukrayinska Pravda AdSearch the Best Companies for Hearing AidsAd•Aporia | Search Ads Ukraine’s allies fail to reach breakthrough on sending new tanksDefense NewsAgreement on tanks for Ukraine not reached at Ramstein meeting, but German government to check Leopard stocksUkrayinska PravdaEU's Borrell: Europe prepared to provide heavy tanks to UkraineReuters AdvertisementAdvertisement", "date": "Fri, 20 Jan 2023 08:54:25 GMT", "url": "https://news.yahoo.com/finland-promises-400-million-euros-085425547.html", "summary": "\n\n-The Ukrainian military will start training with Leopard 2 tanks from Germany, after the two countries agreed to increase their defense cooperation.\n-The training will help improve the Ukrainian military's skills in using the tanks, as well as the German military's skills in training Ukrainian tank crews.\n-The training will start in the spring."}