{"title": "Texas SB 147: Proposed law bans countries from buying property | khou.com", "content": "Texas SB 147: Proposed law bans countries from buying property | khou.com Skip Navigation Share on Facebook Share on Twitter Share on SMS Share on Email Navigation News Back Local Near Me Texas Politics Nation World Investigations Entertainment Heartwarming Features VERIFY Health Latest News Stories Driver crashes into home after being shot near George Bush Park, sheriff says 'Trash' | John Wall sounds off on his time with the Houston Rockets Weather Back Forecast Radar 10-Day Maps Hurricane Traffic Weather School Live Webcams Latest Weather Stories Houston Forecast: Periods of rain Saturday | Live radar Houston Forecast: Periods of rain Saturday Sports VERIFY Search Search: Search Right Now Houston, TX » 54° Houston, TX » Weather Closings Advertise Education Station Living in the Lone Star Texans Helping Texans Health Matters Our Story, Our History Monkeypox COVID-19 Great Day Houston VERIFY Sign up for our newsletter Uvalde school mass shooting Investigations At the border Heroes Nextdoor Live Webcams COVID Vaccine VOTE Tragedy at Astroworld Breaking News More () » Texas News Tensions erupt during rally against SB 147 in Fort Bend County The bill would ban governments, businesses and citizens of China, Iran, North Korea and Russia from buying land in Texas. More Videos Next up in 5 Example video title will go here for this video Author: Jason Miles Published: 6:53 PM CST January 20, 2023 Updated: 7:58 AM CST January 21, 2023 RICHMOND, Texas — Things got a tad tense Friday on the steps of the Fort Bend County Justice Center after protestors rallied against Senate Bill 147. SB 147 is a proposed Texas law that would ban governments, businesses and citizens of China, Iran, North Korea and Russia from buying real estate in Texas. \"I don't even recognize this country anymore,\" said one protestor. \"This is discrimination, okay?\" said another. Fort Bend County Judge KP George even attended the rally, speaking out against the proposed bill. \"If you see injustice happening, it is important to stand up and say this is not okay,\" George said. \"That’s what I’m doing.” George, who leads one of the nation's most diverse counties, said they’re mostly concerned about residents who may still have green cards. “Make it fair for all foreign people,\" said a rally attendee. 🔈Sound up 🔈Things got a tad tense during a rally AGAINST #SB147 which would ban governments, businesses + citizens of China, Iran, North Korea and Russia from buying land in Texas. A few counter protestors also showed up. I’ll have more from BOTH sides on @KHOU at 5 & 6 #khou11 pic.twitter.com/fFNIx7BD4F— Jason Miles (@JMilesKHOU) January 20, 2023 The bill, authored by Republican State Senator Lois Kolkhorst of Brenham, piggybacks on a 2021 law banning so-called hostile nations from owning or controlling critical infrastructure projects in Texas. \"I’m very much in support of SB 147,\" said Fort Bend County Republican Party Chair Bobby Eberle. \"We need to protect our homeland and this does it.” Eberle said penalizing individuals isn’t the priority and natives of the countries in question who have become U.S. citizens have nothing to worry about. In fact, Eberle believes they may be supportive. \"Because they don’t want those countries that they have escaped from getting more of a stranglehold or foothold in America,” said Eberle. Those against the bill said it's un-American. \"This is about freedom and dignity in my opinion,” said George. Sen. Kolkhorst said in a statement that this is a national security issue and that foreign entities could still lease land or other properties if SB 147 passes. Texas Gov. Greg Abbott has already said he intends to sign it. Jason Miles on social media: Facebook | Twitter | Instagram Before You Leave, Check This Out Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell My Personal Information © 2023 KHOU-TV. All Rights Reserved. KHOU would like to send you push notifications about the latest news and weather. Notifications can be turned off anytime in the browser settings. No Thanks Allow", "date": "Sat, 21 Jan 2023 01:20:30 GMT", "url": "https://www.khou.com/article/news/local/texas/texas-senate-bill-147/285-73ac25f0-ab06-4ace-9d2d-f2aa4eb06d3a", "summary": "\n\nTexas lawmakers are considering a bill that would ban governments, businesses, and citizens of China, Iran, North Korea, and Russia from buying land in Texas. The bill, authored by Republican State Senator Lois Kolkhorst of Brenham, piggybacks on a 2021 law banning so-called hostile nations from owning or controlling critical infrastructure projects in Texas. If the bill passes, it would be the first of its kind in the U.S. Those against the bill said it's un-American."}