{"title": "Watch: Don Lemon responds to Stephen Colbert's dig at his hoodie-suit combo | CNN Business", "content": "Watch: Don Lemon responds to Stephen Colbert's dig at his hoodie-suit combo | CNN Business CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Close icon Markets Tech Media Success Perspectives Videos More Markets Tech Media Success Perspectives Videos Audio Live TV Log In My Account Settings Log Out Your CNN account Log in to your CNN account Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio Edition US International Arabic Español Edition US International Arabic Español Markets Tech Media Success Perspectives Videos Follow CNN Business US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics SCOTUS Congress Facts First 2020 Election Business Markets Tech Media Success Perspectives Video Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Don Lemon responds to Colbert’s dig at his hoodie-suit combo Video Ad Feedback Don Lemon responds to Colbert's dig at his hoodie-suit combo Link Copied! Late Night's Stephen Colbert had a lot to say about the hoodie-suit combo Don Lemon recently wore on CNN This Morning. In response, Don explained why he flaunts the style status quo. 03:31 - Source: CNN Stories worth watching 16 videos Video Ad Feedback Don Lemon responds to Colbert's dig at his hoodie-suit combo 03:31 Now playing - Source: CNN Video Ad Feedback Disney just threw down the gauntlet in the WFH battle 02:05 Now playing - Source: CNN Video Ad Feedback This restaurant was empty. Now it has lines out the door thanks to TikTok 02:22 Now playing - Source: CNN Business Video Ad Feedback Extremely rare footage shows sea creature off the coast of Japan 00:45 Now playing - Source: CNN Video Ad Feedback See inside $18 million 'Invisible House' 00:50 Now playing - Source: CNN Business Video Ad Feedback The coolest new Olympic sport is one you may have tried 30 years ago 02:48 Now playing - Source: CNN Video Ad Feedback Video: Tesla car in autonomous mode causes pileup in San Francisco 01:18 Now playing - Source: CNN Video Ad Feedback See the first electrified and fastest-accelerating Corvette 01:16 Now playing - Source: CNN Business Video Ad Feedback Here's why your eggs are so expensive lately 02:37 Now playing - Source: CNN Video Ad Feedback 'Sober bar' owner says she's struggling to meet unprecedented demands 03:35 Now playing - Source: CNN Video Ad Feedback Officials roll out welcome banner to receive Chinese travelers at airport 02:17 Now playing - Source: CNN Video Ad Feedback 'Glass Onion' actress talks about the challenge of her role 02:38 Now playing - Source: CNN Video Ad Feedback 'You're just a hamster spinning on a wheel': Restaurant owner struggles to stay open 02:39 Now playing - Source: CNN Video Ad Feedback An iconic French food is under threat. Hear why one baker is speaking out 02:20 Now playing - Source: CNN Video Ad Feedback The debt ceiling drama, explained in 2 minutes 01:58 Now playing - Source: CNN Business Video Ad Feedback This horror film doll is dancing her way into viral fame 01:00 Now playing - Source: CNN Business See More Videos Ad Feedback Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics The Biden Presidency Facts First US Elections Business Markets Tech Media Success Perspectives Videos Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR Audio CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons Weather Climate Storm Tracker Wildfire Tracker Video More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN Audio Live TV Follow CNN Business Log In My Account Settings Log Out Your CNN account Log in to your CNN account Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. Terms of Use Privacy Policy Ad Choices Accessibility & CC About Newsletters Transcripts © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved. CNN Sans ™ & © 2016 Cable News Network.", "date": "Fri, 20 Jan 2023 12:56:17 GMT", "url": "https://www.cnn.com/videos/media/2023/01/20/don-lemon-colbert-hoodie-suit-outfit-bts-cnntm-crpog-vpx.cnn", "summary": "\n\nDon Lemon recently responded to Stephen Colbert's dig at his hoodie-suit combo on CNN This Morning. In response, Don explained why he flaunts the style status quo. He said that he wears the outfit to show that \"anything is possible.\" He also said that he doesn't think Colbert understands the power of style.\n\nSan Francisco 01:18 Now playing - Source: CNN Video Ad Feedback\n\nSee the first electrified and fastest-accelerating Corvette 01:16 Now playing - Source: CNN Business Video Ad Feedback\n\nHere's why your eggs are so expensive lately 02:37 Now playing - Source: CNN Video Ad Feedback\n\n'Sober bar' owner says she's struggling to meet unprecedented demands 03:35 Now playing - Source: CNN Video Ad Feedback\n\nOfficials roll out welcome banner to receive Chinese travelers at airport 02:17 Now playing - Source: CNN Video Ad Feedback\n\n'Glass Onion' actress talks about the challenge of her role 02:38 Now playing - Source: CNN Video Ad Feedback\n\n'You're just a hamster spinning on a wheel': Restaurant owner struggles to stay open 02:39 Now playing - Source: CNN Video Ad Feedback\n\nAn iconic French food is under threat. Hear why one baker is speaking out 02:20 Now playing - Source: CNN Video Ad Feedback\n\nThe debt ceiling drama, explained in 2 minutes 01:58 Now playing - Source: CNN Business Video Ad Feedback\n\nThis horror film doll is dancing her way into viral fame 01:00 Now playing - Source: CNN Business\n\nMost stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET.\n\nFactset: FactSet Research Systems Inc.\n\nAll rights reserved.\n\nChicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.\n\nDow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN.\n\nStandard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC"}