{"title": "Japan to downgrade COVID classification as it seeks to 'live with the virus' | The Japan Times", "content": "Japan to downgrade COVID classification as it seeks to 'live with the virus' | The Japan Times It looks like you're using an ad blocker. To enjoy our content, please include The Japan Times on your ad-blocker's list of approved sites. Thank you for supporting our journalism. PRINT SUBSCRIBERS | SUBSCRIBE | Login My Account 3 M/CLOUDY TOKYO (4 a.m.) TODAY'S PRINT EDITION Login SUBSCRIBE My Account PRINT SUBSCRIBERS ≫ (FREE ARTICLE) MENU Search News Opinion Life Community Culture Sports City Guide Support Search Search National Asia Pacific Business World Reference Multimedia News National World Business Asia Pacific Reference Columns Multimedia Opinion Editorials Commentary Cartoons Life Travel Digital Food & Drink Environment Style & Design Language Lifestyle People Columns Multimedia Community Voices Issues Our Lives Event listings How-tos Columns Culture Film Music Art Stage Events Festivals Books TV Columns Multimedia Sports Rugby Baseball Soccer Basketball Sumo Figure Skating Tennis More Sports Columns Multimedia City Guide Restaurants Places Support About us Faqs National Japan to downgrade COVID classification as it seeks to 'live with the virus' Sorry, but your browser needs Javascript to use this site. If you're not sure how to activate it, please refer to this site: https://www.enable-javascript.com/ Prime Minister Fumio Kishida speaks to reporters in Tokyo on Friday. | KYODO by Tomoko Otake staff writer Jan 20, 2023 SHARE Japan will downgrade the legal classification of COVID-19 this spring — bringing an end to quarantine guidelines for COVID-19 patients — and review border controls and mask recommendations, Prime Minister Fumio Kishida announced Friday, marking a major policy change nearly three years since the start of the pandemic. Though the exact timing has yet to be decided, the government will downgrade COVID-19 from the current Class II to Class V under the Infectious Diseases Control Law, putting it on par with the seasonal flu, Kishida said. The government will decide how to lift a range of pandemic measures after consulting a panel of medical experts under the health ministry, the prime minister told a news conference after meeting with ministers involved in the nation’s COVID-19 response. Unable to view this article? This could be due to a conflict with your ad-blocking or security software. Please add japantimes.co.jp and piano.io to your list of allowed sites. If this does not resolve the issue or you are unable to add the domains to your allowlist, please see this FAQ. We humbly apologize for the inconvenience. KEYWORDS Fumio Kishida, Katsunobu Kato, COVID-19, COVID-19 in Japan In a time of both misinformation and too much information, quality journalism is more crucial than ever.By subscribing, you can help us get the story right. SUBSCRIBE NOW RELATED Japan considers lifting indoor-masking guidelines Japan's lawmakers get OK to ditch masks during plenary session speeches Japan weighs lowering COVID-19 classification by spring at earliest With your current subscription plan you can comment on stories. However, before writing your first comment, please create a display name in the Profile section of your subscriber account page. Your subscription plan doesn't allow commenting. To learn more see our FAQ WHAT’S TRENDING EDITORS’ PICKS What to expect in the Year of the Rabbit Japan's government starts talks on 'unprecedented' steps to reverse birthrate decline Japan to allow e-scooter riding without a driver's license from July New Zealand’s Jacinda Ardern resigns as prime minister Japan to downgrade COVID classification as it seeks to 'live with the virus' Chris Hipkins set to replace Jacinda Ardern as New Zealand prime minister Yukihiro Takahashi: Style, substance and the knack for a beat Japanese designers begin the year with responsible and eco-friendly products Japan to downgrade COVID classification as it seeks to 'live with the virus' Over 70% of Tokyo's small and midsize firms have no plans to raise wages this year PODCAST DEEP DIVE Clutter, trash and hoarding disorder in Japan SPECIAL SUPPLEMENTS Sponsored contents planned and edited by JT Media Enterprise Division. 広告出稿に関するおといあわせはこちらまで Read more SUPPLEMENTS BINDER Bridges by SMS Global Insight GMI Post World Eye Reports Return to The Japan Times top page JT Digital Archives The Japan Times Alpha Study in Japan JT for Women JT Bookclub Japanese School Directory The Japan Times Jobs SUBSCRIBE NEWSLETTERS ePaper Edition News National World Business Asia Pacific Reference Columns Multimedia Opinion Editorials Commentary Cartoons Life Travel Digital Food & Drink Environment Style & Design Language Lifestyle People Columns Multimedia Community Voices Issues Our Lives Event listings How-tos Columns Culture Film Music Art Stage Events Festivals Books TV Columns Multimedia Sports Rugby Baseball Soccer Basketball Sumo Figure Skating Tennis More Sports Columns Multimedia City Guide Restaurants Places Support About us Faqs About us Contact us Work with us Privacy Policy Link policy Republishing FAQs Announcements Press Sitemap Advertise The Japan Times LTD. All rights reserved.", "date": "Fri, 20 Jan 2023 08:56:38 GMT", "url": "https://www.japantimes.co.jp/news/2023/01/20/national/covid-classification-change/", "summary": "\n\nJapan plans to downgrade COVID-19 from a Class II to a Class V under the Infectious Diseases Control Law, putting it on par with the seasonal flu. The government will consult a panel of medical experts before deciding how to lift a range of pandemic measures."}