{"title": "Russia's nuclear agency helps military sidestep sanctions: report | Fox News", "content": "Russia's nuclear agency helps military sidestep sanctions: report | Fox News Fox News U.S.PoliticsMediaOpinionBusinessEntertainmentSportsLifestyleWeatherTVFox NationListen More Expand / Collapse search Login Watch TV Menu Hot Topics Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. Facebook Twitter Instagram RSS Email Russia Published January 20, 2023 8:53am EST Russia's nuclear agency helps military sidestep sanctions: report Rosatom offers aid to Russian weapons manufacturers targeted by Western sanctions By Caitlin McFall | Fox News Facebook Twitter Flipboard Comments Print Email close Video Fox News interview with IAEA Director General Fox News' Alex Hogan interviews IAEA Director Rafael Grossi who lays out his current nuclear concerns and responds to Moscow’s claims that a Russian loss in Ukraine could trigger a \"nuclear war\". Russia’s nuclear energy agency Rosatom has been working to supply Russia's military with raw materials for missile fuel, components and technology in a move to help it circumvent sanctions and continue the war in Ukraine, a report by the Washington Post found Friday.According to a letter obtained by Ukrainian intelligence from a Rosatom chief in October 2022, the agency referred to a meeting with the defense ministry and offered to supply aid to the Russian military and to weapons manufacturers that are under international sanctions.The Russian weapons manufacturers reportedly included missile systems producer Almaz-Antey, maker of missile launch systems and unguided bombs NPK Tekhmash, producer of the infamous ballistic Iskander missiles Vysokotochniye Kompleksy, along with several over manufacturers that develop rocket launchers, cluster munitions, aircraft, armored vehicles and tanks. Rescuers work at the site where an apartment building was heavily damaged by a Russian missile strike, amid Russia's attack on Ukraine, in Dnipro, Ukraine Jan. 14, 2023. (Press service of the State Emergency Service of Ukraine/Handout via REUTERS)UKRAINE NUCLEAR PLANT WORKER SAYS RUSSIA EVACUATED ITS PERSONNEL AHEAD OF ATTACKS ON ZAPORIZHZHIAIt is unclear when Ukrainian intelligence got a hold of the letter, though reports surfaced earlier this month indicating that Kyiv was pushing the European Union to target the Russian energy company in its next round of sanctions. Despite Rosatom’s involvement in illegally occupying Ukraine’s Zaporizhzhia nuclear power plant since March 2022 and appeals made by Kyiv and NGOs, it has evaded Western sanctions.The U.S. and the EU blackballed Russian oil, natural gas and coal in a move to hinder Russian President Vladimir Putin’s war efforts, but Rosatom has remained out of the sanction crosshairs.The Biden administration reportedly considered sanctioning the Russian nuclear energy giant at the onslaught of the invasion, but ultimately decided against it as the White House looked to find cleaner energy alternatives. A Russian serviceman patrols the territory of the Zaporizhzhia Nuclear Power Station in Energodar on May 1, 2022. (ANDREY BORODULIN/AFP via Getty Images)US SENDING ANOTHER $2.5 BILLION IN MILITARY AID TO UKRAINEThe U.S. has stopped short of banning energy imports from Russian when it comes to mineral fuels including uranium, which account for roughly half of all uranium needs for U.S. nuclear power plants, reported Reuters last year.In 2019 Russian imports of mineral fuels totaled $13 billion according to the U.S. Trade Commission, though this figure dropped slightly in 2022. U.S. imports of mineral fuels remained Washington’s top imported good from Russia during the first seven months of the war in Ukraine, but fell by 17 percent from the year prior, accounting for 43 percent of total imports compared to 60 percent in first seven months of 2021, a report by the U.S. Trade Representative said in December 2022. Russian President Vladimir Putin listens to Rosatom state nuclear energy corporation Chief Sergei Kirienko (R) during a meeting with Hungarian Prime Minister Viktor Orban (unseen) in the Novo-Ogaryovo State Residence in Moscow on January 14, 2014 in Moscow, Russia. (Sasha Mordovets/Getty Images)CLICK HERE TO GET THE FOX NEWS APPEuropean nations like Poland, Estonia, Latvia and Lithuania have all called for Rosatom to be hit with international sanctions, and it is unclear if agency’s actions to help Russia evade sanctions will prompt the Biden administration to take further action.Fox News could not immediately reach the State Department for comment. Caitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Facebook Twitter Instagram Youtube Flipboard LinkedIn Slack RSS Newsletters Spotify iHeartRadio Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us Accessibility Statement This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.", "date": "Fri, 20 Jan 2023 13:53:00 GMT", "url": "https://www.foxnews.com/world/russia-nuclear-agency-helps-military-sidestep-sanctions-report", "summary": "\n\n- Russia's nuclear agency, Rosatom, helps military avoid sanctions by providing aid to Russian weapons manufacturers.\n- The Biden administration considered sanctioning Rosatom at the onslaught of the invasion of Ukraine, but ultimately decided against it due to the White House's search for cleaner energy alternatives.\n- In 2019, Russian imports of mineral fuels totaled $13 billion, but fell by 17% from the year prior.\n- The U.S. has stopped short of banning energy imports from Russian when it comes to mineral fuels, including uranium, which account for roughly half of all uranium needs for U.S. nuclear power plants."}