{"title": "Escalating topic of threat of attack from Belarus is Russian information and psychological operation Ukraine's Intelligence Directorate", "content": "Escalating topic of threat of attack from Belarus is Russian information and psychological operation Ukraine's Intelligence Directorate HOME MAIL NEWS FINANCE SPORTS ENTERTAINMENT LIFE SEARCH SHOPPING YAHOO PLUS MORE... Download the Yahoo News app Yahoo News Yahoo News Search query Sign in Mail News US Politics World COVID-19 Climate Change Health Science Originals The 360 Skullduggery Podcast Conspiracyland Contact Us Some parts of this page are not supported on your current browser version. Please upgrade to a recent browser version. AdvertisementBreaking News:DOJ found classified docs in Biden's Delaware home during Friday search: President's lawyerClose this contentUkrayinska PravdaEscalating topic of threat of attack from Belarus is Russian information and psychological operation Ukraine's Intelligence DirectorateRead full article13Oops!Something went wrong.Please try again later.More content belowAlexander LukashenkoUkrainska PravdaJanuary 21, 2023, 8:13 PM·2 min readIn this article: Oops!Something went wrong.Please try again later.More content belowAlexander LukashenkoPresident of Belarus since 1994 Ukrainian Chief Intelligence Directorate believes that the escalation of the topic of a threat of a Belarusian attack on Ukraine is a Russian informational and psychological operation.Source: Andrii Yusov, representative of the Chief Intelligence Directorate of the Ministry of Defence of Ukraine, on air during the 24/7 national joint newscastQuote: \"Conceptually, escalating the topic of an immediate military threat from Belarus, as the Main Intelligence Directorate has informed, is, in fact, a Russian informational and psychological operation.Of course, we know everything about dictator Lukashenko, about the regime in Belarus. But there are objective things: the number of strike groups, the readiness of forces and means, and other points that allow us to say that today there is no threat of a full-scale ground operation and participation on the side of Russia from Belarus.\"Details: Yusov promised that \"if the situation changes, the relevant information will be shared,\" but assured that \"even in the event of a change in the situation, Ukraine is ready and has worked out all scenarios.\"\"It is in the interests of Putin and the so-called Russian Federation to escalate the issue with Belarus as much as possible. But even dictator Lukashenko doesn't really go along with it. We recently saw him leading Lavrov by the nose during a meeting, and on the one hand, he was talking about how much he loves Putin, and on the other saying that he did not see a threat from Ukraine, and that Ukraine was holding on. That is, dictator Lukashenko does not want to make suicidal actions,\" the representative of Ukrainian Chief Intelligence Directorate said.He also noted that the counter-offensive operation to liberate its lands is \"really difficult\" for Ukraine, but Ukraine can liberate its lands.Quote: \"Ukraine is liberating and will continue to liberate its territories. Believe me, there is an absolutely adequate and sober assessment of the situation, and adequate and sober tasks for the Ukrainian Defense Forces, and an understanding of our abilities. Thus, we really can liberate our lands.\"Story continuesPreviously: On 19 January, the self-proclaimed president of Belarus, Alexander Lukashenko, said that Ukraine \"pleasantly surprises\", because it does not go to provocations against Belarus, although \"it is actively pushed\".In early January, Ukrainian Chief Intelligence Directorate stated that Russia does not plan to end the war against Ukraine, but will continue offensive actions in different directions, in particular, \"leave the north or east at the same time\".Journalists fight on their own frontline. Support Ukrainska Pravda or become our patron! AdvertisementAdvertisementTRENDINGABC NewsElizabeth Holmes bought one-way ticket to Mexico, prosecutors sayABC News·3 min readThe Daily BeastNew Brett Kavanaugh Sexual Assault Allegations Revealed in Secret Sundance DocThe Daily Beast·5 min readReutersRussia's Wagner chief writes to White House over new U.S. sanctionsReuters·1 min readINSIDERA woman who got wasted at a Marilyn Manson concert blew up $15 million worth of property. She's suing the company that served her.INSIDER·2 min readYahoo NewsFormer GOP Sen. Rob Portman: Trump won't be the Republican nomineeYahoo News·6 min read AdvertisementPOPULARISW says attack from Belarus \"more likely\" in late 2023Ukrayinska Pravda AdCan You Name All 15 of These Historical Figures?Ad•Bonvoyaged Intelligence officers create their own flotilla of FPV kamikaze dronesUkrayinska PravdaUkraine Intelligence Busts Spies Helping Russia Hit Energy SuppliesThe Daily BeastNew EU sanctions against Russia expected in FebruaryThe New Voice of Ukraine AdvertisementAdvertisement", "date": "Sat, 21 Jan 2023 16:13:34 GMT", "url": "https://news.yahoo.com/escalating-topic-threat-attack-belarus-161334858.html", "summary": "\n\n- Ukraine's Chief Intelligence Directorate believes that the escalation of the topic of a threat of a Belarusian attack on Ukraine is a Russian informational and psychological operation.\n- This is in response to Ukraine's efforts to improve its military capabilities and reduce the Russian military's advantage in the region.\n- The goal of the Russian operation is to create tension and instability in Ukraine, and to distract from the war in Syria.\n- Ukraine's Defense Forces are prepared for an attack from Belarus, and are aware of Russia's capabilities."}