{"title": "Water rescue: Man lost at sea survives on ketchup after weather pulls boat from St. Martin, rescued in Puerto Bolívar in Colombia - ABC7 Los Angeles", "content": "Water rescue: Man lost at sea survives on ketchup after weather pulls boat from St. Martin, rescued in Puerto Bolívar in Colombia - ABC7 Los Angeles WEATHER ALERTHigh Wind WarningFull StoryWEATHER ALERTHigh Surf AdvisoryFull StoryABC7 Eyewitness NewsWatch NowWATCH LIVELos AngelesOrange CountyInland EmpireVentura CountyCaliforniaEDITLog InWatchAppsLocal News Los AngelesOrange CountyInland EmpireVentura CountyCaliforniaCategories WeatherTrafficU.S. & WorldLive VideoPoliticsInvestigationsConsumerHealth & FoodWeatherEntertainmentSportsEquity ReportCommunityPetsAutomotiveStation Info #ABC7Eyewitness TipsTV ListingsABC7/ContactMeet the News TeamJobs/InternshipsABC7 Shopshows NewsmakersOur AmericaLocalishFollow Us:Welcome, Your AccountLog Out survivor story'It was rough': Man lost at sea for weeks survives on ketchupByHeather Chen, Angus Watson, Mitchell McCluskey and Stefano Pozzebon, CNN, CNNWireFriday, January 20, 2023 12:41PMEMBED <>More Videos <iframe width=\"476\" height=\"267\" src=\"https://abc7.com/video/embed/?pid=11064984\" frameborder=\"0\" allowfullscreen></iframe>ABC7 Chicago 24/7 StreamBOGOTA, Colombia -- A man who spent 24 days adrift in the Caribbean Sea says he survived by eating little more than ketchup, CNN reported.Elvis Francois, 47, was found 120 nautical miles northwest of Colombia's Puerto Bolívar after a plane saw the word \"help\" engraved on the hull of his sailboat, the Colombian navy said in a statement Thursday.\"I had no food. It was just a bottle of ketchup that was on the boat, garlic powder and Maggi (stock cubes) so I mixed it up with some water,\" Francois said in a video provided by the Colombian army.Francois, from the island nation of Dominica, said he had been making repairs to his boat near the Dutch part of the island of Saint Martin in December when adverse weather conditions pulled his boat out to sea.He said he lacked navigational knowledge and was unable to maneuver his boat back to shore -- spending weeks lost at sea.\"Twenty four days -- no land, nobody to talk to. Don't know what to do, don't know where you are. It was rough,\" he said. \"At a certain time, I lose hope. I think about my family.\"After being rescued, he was transferred to the port city of Cartagena where he received medical care and was later handed over to immigration authorities for his return home, Colombian officials said.(The-CNN-Wire & 2023 Cable News Network, Inc., a Time Warner Company. All rights reserved.)Report a correction or typoRelated Topics WATER RESCUE RESCUE WEATHER U.S. & WORLD MISSING MAN SURVIVOR STORY MISSING PERSONHomeAccuWeatherTrafficLocal NewsLos AngelesOrange CountyInland EmpireVentura CountyCaliforniaCategoriesWatchAppsU.S. & WorldLive VideoPoliticsInvestigationsConsumerHealth & FoodStation Info#ABC7Eyewitness TipsTV ListingsABC7/ContactMeet the News TeamJobs/InternshipsABC7 ShopShowsNewsmakersOur AmericaLocalishAppsFollow Us:HomeWeatherTrafficWatchPhotosAppsLos AngelesOrange CountyInland EmpireVentura CountyCaliforniaU.S. & WorldLive VideoPoliticsInvestigationsConsumerHealth & Food#ABC7Eyewitness TipsTV ListingsABC7/ContactMeet the News TeamJobs/InternshipsABC7 ShopPrivacy PolicyDo Not Sell My Personal InformationChildren's Privacy PolicyYour US State Privacy RightsTerms of UseInterest-Based AdsPublic Inspection FileFCC ApplicationsPrivacy PolicyDo Not Sell My Personal InformationChildren's Privacy PolicyYour US State Privacy RightsTerms of UseInterest-Based AdsPublic Inspection FileFCC ApplicationsCopyright © 2023 KABC Television, LLC. All Rights Reserved.", "date": "Fri, 20 Jan 2023 12:42:07 GMT", "url": "https://abc7.com/man-lost-at-sea-caribbean-water-rescue-ketchup/12720837/", "summary": "\n\n- A man who spent 24 days adrift in the Caribbean Sea says he survived by eating little more than ketchup, garlic powder and Maggi (stock cubes)\n- Francois, from the island nation of Dominica, said he had been making repairs to his boat near the Dutch part of the island of Saint Martin in December when adverse weather conditions pulled his boat out to sea\n- He said he lacked navigational knowledge and was unable to maneuver his boat back to shore -- spending weeks lost at sea\n- After being rescued, he was transferred to the port city of Cartagena where he received medical care and was later handed over to immigration authorities for his return home\n\nCONCISE BULLET POINTS SUMMARY:\n\n- A man spent 24 days adrift in the Caribbean Sea and survived by eating only ketchup, garlic powder and Maggi (stock cubes)."}