{"title": "Pig kills butcher at slaughterhouse in Hong Kong - CNN", "content": "Pig kills butcher at slaughterhouse in Hong Kong - CNN Stay Updated on Developing Stories View in App Home U.S. World Politics Business Opinion Health Entertainment Tech Style Travel Bleacher Living Videos International Live TV Live TV Struggling pig kills butcher at slaughterhouse in Hong Kong By Kathleen Magramo Updated 12:11 AM EST, Sat January 21, 2023 (CNN) A butcher died while trying to slaughter a pig in Hong Kong on Friday, the city's police said. The 61-year-old butcher, who worked in the Sheung Shui Slaughterhouse on the city's northern outskirts close to its border with mainland China, was knocked to the ground by the struggling pig and sustained a wound from a 40 centimeter (15 inch) meat cleaver, police told CNN.The butcher had been about to kill the pig -- which he had already shot with an electric stun gun -- when it regained consciousness and knocked him over, police said. A colleague found the man unconscious with the cleaver in his hand and a wound on his left foot, police said. He was taken to hospital and was later certified dead. The police force said the cause of death has yet to be determined. The city's Labour Department said it has launched an investigation. \"The Labour Department is saddened by the death of the person and expresses its deepest sympathy to his family,\" it said in a statement. \"We will complete the investigation as soon as possible to identify the cause of the accident, ascertain the liability of the duty holders and recommend improvement measures. We will take actions pursuant to the law if there is any violation of the work safety legislation,\" a department spokesman said. The city's Food and Environmental Hygiene Department, which manages livestock slaughterhouses, offered its condolences to the man's family in a statement. View on CNN Outbrain © 2023 Cable News Network. A Warner Media Company. All Rights Reserved. Terms of Use | Privacy Policy | AdChoices | Do not Sell my Personal Information | Manage cookies+", "date": "Sat, 21 Jan 2023 05:11:00 GMT", "url": "https://amp.cnn.com/cnn/2023/01/21/asia/hong-kong-pig-kills-butcher-intl-hnk/index.html", "summary": "`\n\n\n\nA butcher died while trying to slaughter a pig at a slaughterhouse in Hong Kong on Friday, the city's police said. The 61-year-old butcher, who worked in the Sheung Shui Slaughterhouse on the city's northern outskirts close to its border with mainland China, was knocked to the ground by the struggling pig and sustained a wound from a 40 centimeter (15 inch) meat cleaver, police told CNN. The butcher had been about to kill the pig -- which he had already shot with an electric stun gun -- when it regained consciousness and knocked him over, police said. A colleague found the man unconscious with the cleaver in his hand and a wound on his left foot, police said. He was taken to hospital and was later certified dead. The city's Labour Department said it has launched an investigation. \"The Labour Department is saddened by the death of the person and expresses its deepest sympathy to his family,\" it said in a statement. \"We will complete the investigation as soon as possible to identify the cause of the accident, ascertain the liability of the duty holders and recommend improvement measures. We will take actions pursuant to the law if there is any violation of the work safety legislation,\" a department spokesman said."}