{"title": "Afghanistan winter: At least 78 people die as temperatures plunge, Taliban says | CNN", "content": "Afghanistan winter: At least 78 people die as temperatures plunge, Taliban says | CNN CNN values your feedback 1. How relevant is this ad to you? 2. Did you encounter any technical issues? Video player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues Ad never loaded Ad prevented/slowed the page from loading Content moved around while ad loaded Ad was repetitive to ads I've seen previously Other issues Cancel Submit Thank You! Your effort and contribution in providing this feedback is much appreciated. Close Ad Feedback Close icon World Africa Americas Asia Australia China Europe India Middle East United Kingdom More Africa Americas Asia Australia China Europe India Middle East United Kingdom Audio Live TV Log In My Account Settings Log Out Your CNN account Log in to your CNN account Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio Edition US International Arabic Español Edition US International Arabic Español Africa Americas Asia Australia China Europe India Middle East United Kingdom Follow CNN US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics SCOTUS Congress Facts First 2020 Election Business Markets Tech Media Success Perspectives Video Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN At least 78 people die as winter temperatures plunge in Afghanistan, Taliban says By Ehsan Popalzai and Kathleen Magramo, CNN Published 11:17 PM EST, Thu January 19, 2023 Link Copied! Freezing temperatures swept Afghanistan's Badakhshan province on January 18, 2023. Omer Abrar/AFP/Getty Images CNN — At least 78 people have died in freezing conditions in Afghanistan in the last nine days, a Taliban official said Thursday, deepening a humanitarian crisis affecting millions of people now living under the control of the radical Islamist group. Shafiullah Rahimi, a spokesperson for the Taliban’s Ministry of Disaster Management, told CNN that along with the loss of human life, more than 77,000 livestock had also frozen to death in recent days. Temperatures fell as low as minus 28 degrees Celsius (minus 18 Fahrenheit) at the end of last week with fears that conditions could get even colder. The temperatures are well below average for this time of year, with the coldest conditions recorded in the north, according to CNN meteorologists. The United Nations Office for the Coordination of Humanitarian Affairs (UNOCHA) in Afghanistan said in a tweet Wednesday that livestock losses posed a further risk to families with more than 21 million people urgently needing food and agricultural support. The Taliban takeover in August 2021 has plunged Afghanistan into an economic and humanitarian crisis. Press Briefing by Deputy Secretary-General Amina J Mohammed on the launch of the 2022 Financing for Sustainable Development Report, United Nations, New York City, New York, April 12, 2022. (Photo by EuropaNewswire/Gado/Getty Images) EuropaNewswire/Gado/Getty Images Top UN female envoys meet Taliban in Kabul to discuss ban on women aid workers Humanitarian partners are providing heating, money for fuel and warm clothes to families, but the distribution of aid has been severely impacted by the Taliban’s ban on female aid workers, the UNOCHA in Afghanistan said in a tweet. At least half a dozen major foreign aid groups have temporarily suspended their operations in Afghanistan since December, when the Taliban ordered all local and international non-governmental organizations to stop their female employees from coming to work, or risk having their NGO licenses revoked. Some of the UN’s most senior female officials have been meeting Taliban leaders in Kabul to discuss the ban on female aid workers, after the agency had to suspend some of its “time-critical” programs in Afghanistan due to the absence of female aid workers. Women’s rights, freedoms and access to education have been severely eroded under the Taliban, which has recently barred females from accessing education. Half of Afghanistan’s population is experiencing acute hunger, and while conflict has subsided, violence, fear and deprivation remain, a UN report in November found. CNN’s Teele Rebane, Sophie Tanno, Sahar Akbarzai and Mohammed Tawfeeq contributed reporting. Related Ad Feedback Ad Feedback Ad Feedback Ad Feedback Search Log In My Account Settings Log Out Your CNN account Log in to your CNN account Live TV Audio US Crime + Justice Energy + Environment Extreme Weather Space + Science World Africa Americas Asia Australia China Europe India Middle East United Kingdom Politics The Biden Presidency Facts First US Elections Business Markets Tech Media Success Perspectives Videos Opinion Political Op-Eds Social Commentary Health Life, But Better Fitness Food Sleep Mindfulness Relationships Entertainment Movies Television Celebrity Tech Innovate Gadget Foreseeable Future Mission: Ahead Upstarts Work Transformed Innovative Cities Style Arts Design Fashion Architecture Luxury Beauty Video Travel Destinations Food & Drink Stay News Videos Sports Pro Football College Football Basketball Baseball Soccer Olympics Hockey Videos Live TV Digital Studios CNN Films HLN TV Schedule TV Shows A-Z CNNVR Audio CNN Underscored Electronics Fashion Beauty Health & Fitness Home Reviews Deals Money Gifts Travel Outdoors Pets CNN Store Coupons Weather Climate Storm Tracker Wildfire Tracker Video More Photos Longform Investigations CNN Profiles CNN Leadership CNN Newsletters Work for CNN World Audio Live TV Follow CNN Log In My Account Settings Log Out Your CNN account Log in to your CNN account Terms of Use Privacy Policy Ad Choices Accessibility & CC About Newsletters Transcripts © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved. CNN Sans ™ & © 2016 Cable News Network.", "date": "Fri, 20 Jan 2023 04:17:00 GMT", "url": "https://www.cnn.com/2023/01/19/asia/afghanistan-winter-deaths-intl-hnk/index.html", "summary": "\n\nAt least 78 people have died in Afghanistan due to the cold weather, with the Taliban saying that livestock losses pose a further risk to families. The Taliban takeover in August 2021 has plunged Afghanistan into an economic and humanitarian crisis. The UNOCHA is trying to negotiate with the Taliban to allow female aid workers to continue working, but so far the talks have not been successful."}