{"title": "‘Joe Biden has been constantly underestimated’: Chris Whipple on his White House book | Books | The Guardian", "content": "‘Joe Biden has been constantly underestimated’: Chris Whipple on his White House book | Books | The Guardian Skip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteUSWorldEnvironmentSoccerUS PoliticsBusinessTechScienceNewslettersFight to voteBooksInterview‘Joe Biden has been constantly underestimated’: Chris Whipple on his White House bookDavid Smith in Washington Joe Biden, with Kamala Harris, speaks to reporters in the Roosevelt Room of the White House. Photograph: Jim Watson/AFP/Getty ImagesJoe Biden, with Kamala Harris, speaks to reporters in the Roosevelt Room of the White House. Photograph: Jim Watson/AFP/Getty ImagesFight of His Life author on Kamala Harris’s struggles and growth, Afghanistan, a strong second year … and if Biden will run again@smithinamericaSat 21 Jan 2023 02.00 ESTThere are those who believe that at 80, Joe Biden is too old to serve a second term as president. Yet few clamour for him to hand over to the person who would normally be the heir apparent.The Fight of His Life review: Joe Biden, White House winnerRead moreTwo years in, Kamala Harris, the first woman of colour to be vice-president, has had her ups and downs. Her relationship with Biden appears strong and she has found her voice as a defender of abortion rights. But her office has suffered upheaval and her media appearances have failed to impress.Such behind-the-scenes drama is recounted in The Fight of His Life: Inside Joe Biden’s White House, written by the author, journalist and film-maker Chris Whipple and published this week. Whipple gained access to nearly all of Biden’s inner circle and has produced a readable half-time report on his presidency – a somewhat less crowded field than the literary genre that sprang up around Donald Trump.“In the beginning, Joe Biden liked having Kamala Harris around,” Whipple writes, noting that Biden wanted the vice-president with him for meetings on almost everything. One source observed a “synergy” between them.Harris volunteered to take on the cause of voting rights. But Biden handed her another: tackling the causes of undocumented immigration by negotiating with the governments of Guatemala, El Salvador and Honduras.“But for Harris,” Whipple writes, “the Northern Triangle would prove to be radioactive.”With the distinction between root causes and immediate problems soon lost on the public, Harris got the blame as migrants kept coming.One of her senior advisers tells Whipple the media could not handle a vice-president who was not only female but also Black and south Asian, referring to it as “the Unicorn in a glass box” syndrome. But Harris also suffered self-inflicted wounds. Whipple writes that she “seemed awkward and uncertain … she laughed inappropriately and chopped the air with her hands, which made her seem condescending”.An interview with NBC during a visit to Guatemala and Mexico was a “disaster”, according to one observer. Reports highlighted turmoil and turnover in Harris’s office, some former staff claiming they saw it all before when she was California attorney general and on her presidential campaign. Her approval rating sank to 28%, lower than Dick Cheney’s during the Iraq war.Biden and Harris had a real rapport, a real bond. Because of Covid they were thrown together in the White House But, Whipple writes, Biden and his team still thought highly of Harris.“Ron Klain [chief of staff] was personally fond of her. He met with the vice-president weekly and encouraged her to do more interviews and raise her profile. Harris was reluctant, wary of making mistakes.“‘This is like baseball,’ Klain told her. ‘You have to accept the fact that sometimes you will strike out. We all strike out. But you can’t score runs if you’re sitting in the dugout.’ Biden’s chief was channeling manager Tom Hanks in the film A League of Their Own. ‘Look, no one here is going to get mad at you. We want you out there!’”Speaking to the Guardian, Whipple, 69, reflects: “It’s a complicated, fascinating relationship between Joe Biden and Kamala Harris.“In the early months of the administration they had a real rapport, a real bond. Because of Covid they were thrown together in the White House and spent a lot of time together. He wanted her to be in almost every meeting and valued her input. All of that was and is true.“But when she began to draw fire, particularly over her assignment on the Northern Triangle, things became more complicated. It got back to the president that the second gentleman, Doug Emhoff, was complaining around town that her portfolio was too difficult and that in effect it was setting her up for failure. This really annoyed Biden. He felt he hadn’t asked her to do anything he hadn’t done for Barack Obama: he had the Northern Triangle as one of his assignments. She had asked for the voting rights portfolio and he gave it to her. So that caused some friction.”A few months into the presidency, Whipple writes, a close friend asked Biden what he thought of his vice-president. His reply: “A work in progress.” These four words – a less than ringing endorsement – form the title of a chapter in Whipple’s book.But in our interview, Whipple adds: “It’s also true that she grew in terms of her national security prowess. That’s why Biden sent her to the Munich Security Conference on the eve of the Russian invasion of Ukraine. She spent a lot of time in the meetings with the president’s daily brief and Biden’s given her some important assignments in that respect.”A former producer for CBS’s 60 Minutes, Whipple has written books about White House chiefs of staff and directors of the CIA. Each covered more than 100 years of history, whereas writing The Fight of His Life was, he says, like designing a plane in mid-flight and not knowing where to land it. Why did he do it?Chris Whipple. Photograph: David Hume Kennerly“How could I not? When you think about it, Joe Biden and his team came into office confronting a once-in-a-century pandemic, crippled economy, global warming, racial injustice, the aftermath of the attack on the Capitol. How could anybody with a political or storytelling bone in his body not want to tell that story? Especially if you could get access to Biden’s inner circle, which I was fortunate in being able to do.”Even so, it wasn’t easy. Whipple describes “one of the most leakproof White Houses in modern history … extremely disciplined and buttoned down”. It could hardly be more different from the everything-everywhere-all-at-once scandals of the Trump administration.What the author found was a tale of two presidencies. There was year one, plagued by inflation, supply chain problems, an arguably premature declaration of victory over the coronavirus and setbacks in Congress over Build Back Better and other legislation. Worst of all was the dismal end of America’s longest war as, after 20 years and $2tn, Afghanistan fell to the Taliban.“It was clearly a failure to execute the withdrawal in a safe and orderly way and at the end of the day, as I put it, it was a whole-of-government failure,” Whipple says. “Everybody got almost everything wrong, beginning with the intelligence on how long the Afghan government and armed forces would last and ending with the botched execution of the withdrawal, with too few troops on the ground.”Whipple is quite possibly the first author to interview Klain; the secretary of state, Antony Blinken; the CIA director, Bill Burns; and the chair of the joint chiefs of staff, Gen Mark Milley, about the Afghanistan debacle.Afghanistan was a whole-of-government failure. Everybody got almost everything wrong“What became clear was that everybody had a different recollection of the intelligence. While this administration often seems to be pretty much on the same page, I found that there was a lot more drama behind the scenes during the Afghan withdrawal and in some of the immediate aftermath,” he says.The book also captures tension between Leon Panetta, CIA director and defense secretary under Barack Obama, who was critical of the exit strategy – “You just wonder whether people were telling the president what he wanted to hear” – and Klain, who counters that Panetta favoured the war and oversaw the training of the Afghan military, saying: “If this was Biden’s Bay of Pigs, it was Leon’s army that lost the fight.”Whipple comments: “Ron Klain wanted to fire back in this case and it’s remarkable and fascinating to me, given his relationship with Panetta. Obviously his criticism got under Ron Klain’s skin.”Biden’s second year was a different story. “Everything changed on 24 February 2022, when Vladimir Putin invaded Ukraine. Joe Biden was uniquely qualified to rise to that moment and he did, rallying Nato in defiance of Putin and in defence of Ukraine. Biden had spent his entire career preparing for that moment, with the Senate foreign relations committee and his experience with Putin, and it showed.“Then he went on to pass a string of bipartisan legislative bills from the Chips Act to veterans healthcare, culminating in the Inflation Reduction Act, which I don’t think anybody saw coming.“One thing is for sure: Joe Biden has been constantly underestimated from day one and, at the two-year mark, he proves that he could deliver a lot more than people thought.”Biden looked set to enter his third year with the wind at his back. Democrats exceeded expectations in the midterm elections, inflation is slowing, Biden’s approval rating is on the up and dysfunctional House Republicans struggled to elect a speaker.His inner circle is bullish about Biden’s mental acuity and ability to govern. I never heard them express any concernBut political life moves pretty fast. Last week the justice department appointed a special counsel to investigate the discovery of classified documents, from Biden’s time as vice-president, at his thinktank in Washington and home in Delaware.Whipple told CBS: “They really need to raise their game here, I think, because this really goes to the heart of Joe Biden’s greatest asset, arguably, which is trust.”The mistake represents a bump in the road to 2024. Biden’s age could be another. He is older than Ronald Reagan was when he completed his second term and if he serves a full second term he will be 86 at the end. Opinion polls suggest many voters feel he is too old for the job. Biden’s allies disagree.Joe Biden speaks at the National Action Network’s MLK Jr Day breakfast, in Washington this week. Photograph: Michael Brochstein/Sopa Images/Rex/ShutterstockWhipple says: “His inner circle is bullish about Biden’s mental acuity and his ability to govern. I never heard any of them express any concern and maybe you would expect that from the inner circle. Many of them will tell you that he has extraordinary endurance, energy.“Bruce Reed [a longtime adviser] told me about flying back on a red-eye from Europe after four summits in a row when everybody had to drag themselves out of the plane and was desperately trying to sleep and the boss came in and told stories for six hours straight all the way back to DC.”During conversations and interviews for the book, did Whipple get the impression Biden will seek re-election?“He’s almost undoubtedly running. Andy Card [chief of staff under George W Bush] said something to me once that rang true: ‘If anybody tells you they’re leaving the White House voluntarily, they’re probably lying to you.’“Who was the last president to walk away from the office voluntarily? LBJ [Lyndon Baines Johnson]. It rarely happens. I don’t think Joe Biden is an exception. He spent his whole career … thinking about running or running for president and he’s got unfinished business. Having the possibility of Donald Trump as the Republican nominee probably makes it more urgent for him. He thinks he can beat him again.” The Fight of His Life: Inside Joe Biden’s White House is published in the US by Scribner TopicsBooksJoe BidenBiden administrationKamala HarrisUS politicsDemocratsRepublicansinterviewsReuse this contentMost viewedMost viewedUSWorldEnvironmentSoccerUS PoliticsBusinessTechScienceNewslettersFight to voteNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)", "date": "Sat, 21 Jan 2023 07:00:00 GMT", "url": "https://www.theguardian.com/books/2023/jan/21/fight-of-his-life-biden-book-white-house-chris-whipple-interview", "summary": "\n\n-Joe Biden has been constantly underestimated by many, and Chris Whipple discusses this in his new book, \"The Fight of His Life.\"\n-Whipple discusses how Biden and Kamala Harris have a strong relationship and how she has grown in her role as Vice President. He also discusses how she has been criticized for her work on the Northern Triangle, but has since overcome these challenges.\n-Whipple writes, a close friend asked Biden what he thought of his vice-president. His reply: “A work in progress.” These four words - a less than ringing endorsement - form the title of a chapter in Whipple’s book.\n-But in our interview, Whipple adds: “It’s also true that she grew in terms of her national security prowess. That’s why Biden sent her to the Munich Security Conference on the eve of the Russian invasion of Ukraine. She spent a lot of time in the meetings with the president’s daily brief and Biden’s given her some important assignments in that respect.”\n-A former producer for CBS’s 60 Minutes, Whipple has written books about White House chiefs of staff and directors of the CIA. Each covered more than 100 years of history, whereas writing The Fight of His Life was, he says, like designing a plane in mid-flight and not knowing where to land it. Why did he do it?\n-Chris Whipple. Photograph: David Hume Kennerly\n-Whipple is quite possibly the first author to interview Klain; the secretary of state, Antony Blinken; the CIA director, Bill Burns; and the chair of the joint chiefs of staff, Gen Mark Milley, about the Afghanistan debacle."}