{"title": "First UN aid convoy reaches area close to Soledar in Ukraine | Ukraine | The Guardian", "content": "First UN aid convoy reaches area close to Soledar in Ukraine | Ukraine | The Guardian Skip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentUkraineFirst UN aid convoy reaches area close to Soledar in UkraineSpokesperson says three trucks carrying supplies for 800 people have headed to scene of intense fighting Russia-Ukraine war – latest news updates A Ukrainian soldier near the northern front of the Donbas, which includes Donetsk oblast. Photograph: Edgar Gutiérrez/Sopa Images/Rex/ShutterstockA Ukrainian soldier near the northern front of the Donbas, which includes Donetsk oblast. Photograph: Edgar Gutiérrez/Sopa Images/Rex/ShutterstockPeter Beaumont and agenciesFri 20 Jan 2023 09.30 ESTLast modified on Fri 20 Jan 2023 10.18 ESTA UN humanitarian convoy has reached an area close to the town of Soledar in east Ukraine, where some of the fiercest fighting in the country has taken place in recent weeks.“Our colleagues in Ukraine have just reached government-controlled areas close to Soledar in eastern Donetsk oblast,” Jens Laerke, a spokesperson for the UN Office for the Coordination of Humanitarian Affairs, told reporters in Geneva. “This is the first interagency convoy to reach this area since the war began.”Laerke said the three-truck convoy had set off early on Friday from Dnipro carrying food, water, hygiene kits and medical supplies for 800 people.The Soledar area has been the scene of intense and continuing fighting even after a Russian claim that it had been taken, which is disputed by Ukraine. Russian forces have incurred heavy casualties, with Ukrainian forces holding defensive lines outside the town and continuing to strike Russian troops inside it.Before last week an estimated 500 civilians were still in Soledar although it was unclear how many remained.The convoy had reached an area close to the embattled saltmining town and the team was in the process of offloading the aid, Laerke said. “Recent fighting in and around Soledar has caused widespread destruction, leaving people there in dire need of humanitarian assistance,” he said, specifying that the aid was destined for civilians.Laerke said the UN hoped to be able to bring more convoys into the area, but that “access is something that needs to be assessed on a day-to-day basis”. “We hope to reach them again because when aid such as food and other materials come in, of course that will run out. That lasts for a certain period of time and then we need to return.”Asked whether a subsequent convoy may enter Soledar itself, he said it remained unclear. “It remains, as usual, conditioned by the security situation on the ground whether such a convoy could potentially move ahead in the future.” Both sides have suffered heavy losses in Soledar. Russian control of the town would improve its forces’ position as they push toward what has been their target for months, the nearby transport crossroads of Bakhmut.Russia’s defence ministry said on Friday its forces had taken control of Klishchiivka, a settlement south of Bakhmut. The village is about 6 miles (9km) south of Bakhmut, where units of Russia’s Wagner private militia have been locked for months in a battle of attrition with Ukrainian forces. However, Ukraine reported little change in the lines of conflict in the area on Friday morning.The arrival of the convoy came as a pro-Russian official, Vladimir Rogov, said on Telegram that fighting had “sharply increased” in the southern Ukraine region of Zaporizhzhia, where the front has been largely stagnant for months.Rogov and the Russian army said Moscow’s forces had seized the village of Lobkove, about 30 miles (50km) south of the Ukrainian-held regional capital, also called Zaporizhzhia.“Lobkove is ours,” Rogov said.He added that Russian forces had fired at Ukrainian positions with tanks, mortars and artillery in a dozen villages in the region. The Ukrainian army said on Friday that more than 20 settlements had been attacked.A day earlier Rogov had announced a “local offensive” in the region near the town of Orikhiv.Agence France-Presse and Reuters contributed to this reportTopicsUkraineUnited NationsAidRussiaEuropenewsReuse this contentMore on this storyMore on this storyRussian army announces new offensive in Zaporizhzhia – as it happened6h agoRussia-Ukraine war at a glance: what we know on day 332 of the invasion21h agoGermany faces backlash over reluctance to send tanks to Ukraine8h agoZelenskiy attends memorial service for Ukraine helicopter crash victims9h agoUK offers qualified backing for tribunal to prosecute Russia’s leaders1d agoUkraine frustrated as Germany holds back decision on supply of tanks1d agoLeopard 2 tanks: what are they and why does Ukraine want them?1d agoPoland could send Leopard tanks to Ukraine without German approval2d agoMost viewedMost viewedWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)", "date": "Fri, 20 Jan 2023 15:18:00 GMT", "url": "https://www.theguardian.com/world/2023/jan/20/first-un-aid-convoy-reaches-soledar-area-ukraine", "summary": "\n\n- A UN humanitarian convoy has reached an area close to the town of Soledar in east Ukraine, where some of the fiercest fighting in the country has taken place in recent weeks.\n- The convoy had set off early on Friday from Dnipro carrying food, water, hygiene kits and medical supplies for 800 people.\n- The Soledar area has been the scene of intense and continuing fighting even after a Russian claim that it had been taken, which is disputed by Ukraine. Russian forces have incurred heavy casualties, with Ukrainian forces holding defensive lines outside the town and continuing to strike Russian troops inside it.\n- Before last week an estimated 500 civilians were still in Soledar although it was unclear how many remained.\n- The convoy had reached an area close to the embattled saltmining town and the team was in the process of offloading the aid."}