{"title": "Gabon foreign minister dies of cardiac arrest in cabinet meeting | News | Al Jazeera", "content": "Gabon foreign minister dies of cardiac arrest in cabinet meeting | News | Al Jazeera Skip linksSkip to Contentplay Live Show navigation menuNavigation menuNewsShow more news sectionsMiddle EastAfricaAsiaUS & CanadaLatin AmericaEuropeAsia PacificUkraine warFeaturesEconomyOpinionVideoMoreShow more sectionsCoronavirusClimate CrisisInvestigationsInteractivesIn PicturesScience & TechnologySportsPodcastsplay Live Click here to searchsearchNewsGabon foreign minister dies of cardiac arrest in cabinet meetingMichael Moussa Adamo was a longtime ally of President Bongo, even before he became president in 2009.President Bongo described Gabon's foreign minister Michael Moussa Adamo as 'a great diplomat, a true statesman' [File: Shannon Stapleton/Reuters]Published On 20 Jan 202320 Jan 2023facebooktwitterwhatsappGabon’s Minister of Foreign Affairs Michael Moussa Adamo died of a heart attack during a cabinet meeting, according to the government and a presidential source. The 62-year-old who was an ally of President Ali Bongo Ondimba died “despite efforts by specialists” to revive him, the government said in a brief statement on Friday. A source close to the presidential palace said that he “had sat down at the start of the cabinet meeting and began to feel unwell”, according to AFP. Moussa Adamo was taken to a military hospital while unconscious but died just after midday, the source who spoke on condition of anonymity said. President Bongo described Moussa Adamo on Twitter as “a great diplomat, a true statesman”. “For me, he was, first of all, a friend, loyal and faithful, whom I could always count on,” said Bongo. Notre ministre des Affaires étrangères, Michael Moussa Adamo, s'en est allé ce jour.Il était un très grand diplomate, un véritable homme d'Etat.Pour moi, il était d'abord un ami, loyal et fidèle, sur lequel j'ai toujours pu compter.C'est une perte immense pour le #Gabon.#RIP — Ali Bongo Ondimba (@PresidentABO) January 20, 2023 Abdulla Shahid, Adamo’s counterpart in the Maldives, offered his sympathies to the late minister’s family on Twitter, as well. Shocked and extremely saddened to hear of the untimely demise of my dear friend Michael Moussa Adamo, Foreign Minister of #Gabon. My deepest condolences to his family and loved ones. And to the Government of Gabon on this loss. I will miss his friendship and wise advise. pic.twitter.com/ywNizXarJw — Abdulla Shahid (@abdulla_shahid) January 20, 2023 Moussa Adamo was born in 1961 in the northeastern town of Makokou. He started out as a presenter on national television and eventually, in 2000, while Bongo was defence minister, Moussa Adamo became chief of staff to the defence minister. When Bongo was elected president on the death of his father Omar Bongo Ondimba in 2009, Moussa Adamo served as his special adviser. After a decade as Gabon’s ambassador to the United States until 2020, he became first defence minister and then foreign minister in March last year. Source: News AgenciesAboutShow moreAbout UsCode of EthicsTerms and ConditionsEU/EEA Regulatory NoticePrivacy PolicyCookie PolicyCookie PreferencesSitemapCommunity GuidelinesWork for usHR QualityConnectShow moreContact UsAdvertise with usAppsChannel FinderTV SchedulePodcastsSubmit a TipOur ChannelsShow moreAl Jazeera ArabicAl Jazeera EnglishAl Jazeera Investigative UnitAl Jazeera MubasherAl Jazeera DocumentaryAl Jazeera BalkansAJ+Our NetworkShow moreAl Jazeera Centre for StudiesAl Jazeera Media InstituteLearn ArabicAl Jazeera Centre for Public Liberties & Human RightsAl Jazeera ForumAl Jazeera Hotel PartnersFollow Al Jazeera English:facebooktwitteryoutubeinstagram-colored-outlinerss© 2023 Al Jazeera Media Network", "date": "Fri, 20 Jan 2023 16:43:30 GMT", "url": "https://www.aljazeera.com/news/2023/1/20/gabon-foreign-minister-dies-of-heart-attack-amid-cabinet-meeting", "summary": "\n\n-Gabon's Minister of Foreign Affairs, Michael Moussa Adamo, died of a heart attack during a cabinet meeting on Friday.\n-Adamo was an ally of President Ali Bongo Ondimba and had served as his special adviser, defense minister, and foreign minister.\n-Bongo described Adamo as a \"great diplomat, a true statesman\" in a tweet after his death."}