{"title": "Is the U.S. Running Out of Weapons to Send Ukraine?", "content": "Is the U.S. Running Out of Weapons to Send Ukraine? Sat, Jan 21, 2023LOGIN Subscribe for $1 Newsweek Search U.S.WorldTech & ScienceCultureAutosRankingsHealthLifeOpinionExpertsEducationPodcastsVantageAbout UsAnnouncementsLeadershipCEO Dev PragadArchive NewsIs the U.S. Running Out of Weapons to Send Ukraine? By Jon Jackson On 1/20/23 at 1:53 PM EST Share Share on Facebook Share on Twitter Share on LinkedInShare on RedditShare on Flipboard Share via Email Comments News Ukraine Volodymyr Zelensky Russia Russia-Ukraine War Navy Secretary Carlos Del Toro earlier this month warned that the U.S. may find it \"challenging\" to continue to arm itself and supply weapons to Ukraine if weapon production doesn't increase.His comments came after European Union foreign policy chief Josep Borrell said in September that \"the military stocks of most [EU] member states has been, I wouldn't say exhausted, but depleted in a high proportion, because we have been providing a lot of capacity to the Ukrainians.\"Such statements have led some to speculate whether the United States—as well as other Ukraine allies—will reach a point when it can no longer send more weapons to Ukraine because it needs to maintain a stockpile for its own defense.\"Whether the West could run out of weapons to supply Ukraine is a straightforward question at the same time that it is complex,\" William Reno, professor and chair of the political science department at Northwestern University, told Newsweek. \"The straightforward answer is yes. Supplies are finite, including with increased production.\" In the main picture, President of Ukraine Volodymyr Zelensky is seen during a press conference following the tripartite meeting on January 11, 2023, in Lviv, Ukraine. The smaller image shows a Ukrainian soldier holding a U.S.-made Stinger MANPAD (man-portable air-defense system) on the frontline on December 29, 2022, in Bakhmut, Ukraine. Some have wondered how long the U.S. can continue suppling Ukraine with weapons while keeping its own stockpiles at an adequate level for defense. Photo by Stanislav Ivanov/Pierre Crom/Global Images Ukraine/Getty Images Reno said the topic of supplying weapons becomes more complex \"when one considers impacts of weapons transfers on the military preparedness of providers.\" He detailed how a U.S. military division may pass weapons on to another department for training and how that unit's \"command asks whether those transfers impair their own capacity to perform.\"\"Weapons transfers from smaller NATO member armed forces—Canada, Denmark, Norway—cut deeper into their capabilities and readiness,\" Reno said. \"They expect the U.S. to back them.\"However, Reno added that while the \"burn rate\" of weapons in Ukraine exceeds replacement capacities, the same \"is true on the Russian side too,\" resulting in Russian President Vladimir Putin turning to Iran and North Korea for armaments. Read more U.S. piles pressure on Germany to provide Ukraine Leopard 2 tanks Putin fighting Wagner Group's rise after ally claims war success: ISW Britain tossing more \"fire & forget\" brimstone rockets into Ukraine arsenal Sean Spoonts, a U.S. Navy veteran and editor-in-chief of Special Operations Forces Report (SOFREP), told Newsweek that \"'running out of weapons' is a relative term.\"\"The U.S. military maintains vast stocks of ammunition in storage in case of war to give time for U.S. arms makers to ramp up replacement production,\" Spoonts said.He added that when U.S. military officials speak of stockpiles getting low, they are often referring to a threshold in the inventory that is still capable of sustaining the U.S. military for months.\"Unlike Russia, which has a limited number of arms manufacturers making their weapons, the U.S. military relies on thousands of private companies both big and small to replace its stocks,\" Spoonts added.He further noted that the U.S. has international partners like South Korea who have the ability to produce large numbers of materials needed for weapons within a short deadline.George Mason University Schar School of Policy and Government professor Mark N. Katz told Newsweek that while Ukraine and Russia both continue using up large amounts of weapons, Ukraine President Volodymyr Zelensky's forces have an advantage.\"The difference, I believe, is that the West—especially the U.S.—has much greater capacity to produce weapons than does Russia and its allies,\" Katz said. \"And since Russian weapons have relied on Western inputs, which Moscow can no longer obtain, this puts a severe limit on Russia's ability to resupply itself.\"Steven Myers, a former member of the U.S. State Department Advisory Committee on International Economic policy and the National Security Membership Committee, told Newsweek that he believes the U.S. and Western allies could eventually hit their own issues with weapon production.\"Is the West going to run out of weapons? Yes and no,\" Myers said. \"The U.S. can't keep sending weapons—for example artillery shells—without replenishing its stockpile. The Pentagon has been asking its contractors to ramp up production. But contractors, being sensible, are more than a little reluctant to do so without guarantees by the Pentagon for covering the capital expenses required for increasing production rate.\"In Katz's estimation, if \"the outcome of the war will be significantly determined by which side can deploy and replace the most weapons, Ukraine has the advantage—so long as Western states continue to supply it.\"Spoonts credited much of Ukraine's success in the war to Western help, which he said Zelensky can likely continue to count on.\"They [Ukraine] are vulnerable in the sense that they probably could not continue the fight without the West's supplies. Negotiating with Russia, though, would not result in Ukraine continuing to exist as a country,\" Spoonts said. \"Ukraine has little choice but to fight for its survival, and the West has to continue supplying them to assure that or take most of the blame for their defeat.\"Newsweek reached out to the U.S. Department of Defense for comment. Request Reprint & Licensing, Submit Correction or view Editorial Guidelines The debate Gun Laws Have Disproportionate Impact on Black Communities | Opinion Gun Laws Have Disproportionate Impact on Black Communities | OpinionBy Jeff CharlesVS There's Nothing Racist About Gun Safety | Opinion There's Nothing Racist About Gun Safety | OpinionBy Ellis Henican Get the best of Newsweek via email CHOOSE YOUR SUBSCRIPTION PREMIUMNewsweek magazine delivered to your doorUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $9.99 DIGITAL+ Ad FreeUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $1NEWSLETTERBEST OF NEWSWEEK VIA EMAILJoin half a million readers enjoying Newsweek's free newsletters Email address Newsweek© 2023 NEWSWEEK DIGITAL LLC Editions:U.S. Edition日本PolskaRomâniaAbout UsMastheadDiversityAnnouncementsArchiveCareersCorrectionsContact UsPolicies and StandardsMission StatementAdvertiseCopyrightTerms & ConditionsPrivacy PolicyCookie PolicyTerms of SaleLeadershipCEO Dev PragadNewslettersDo Not Sell My Personal InformationGDPR Privacy Settings", "date": "Fri, 20 Jan 2023 18:53:18 GMT", "url": "https://www.newsweek.com/us-running-out-weapons-send-ukraine-1775408", "summary": "\n\n-The article discusses how the U.S. may find it \"challenging\" to continue to arm Ukraine if weapon production doesn't increase.\n-The article also discusses how the West could run out of weapons to supply Ukraine.\n-The U.S. has international partners like South Korea who have the ability to produce large numbers of materials needed for weapons within a short deadline.\n-George Mason University Schar School of Policy and Government professor Mark N. Katz told Newsweek that while Ukraine and Russia both continue using up large amounts of weapons, Ukraine President Volodymyr Zelensky's forces have an advantage.\"The difference, I believe, is that the West—especially the U.S.—has much greater capacity to produce weapons than does Russia and its allies,\" Katz said. \"And since Russian weapons have relied on Western inputs, which Moscow can no longer obtain, this puts a severe limit on Russia's ability to resupply itself.\"\n-Steven Myers, a former member of the U.S. State Department Advisory Committee on International Economic policy and the National Security Membership Committee, told Newsweek that he believes the U.S. and Western allies could eventually hit their own issues with weapon production.\"Is the West going to run out of weapons? Yes and no,\" Myers said. \"The U.S. can't keep sending weapons—for example artillery shells—without replenishing its stockpile. The Pentagon has been asking its contractors to ramp up production. But contractors, being sensible, are more than a little reluctant to do so without guarantees by the Pentagon for covering the capital expenses required for increasing production rate.\""}