{"title": "UN nuclear chief seeks to secure nuclear safety during Ukraine visit | Fox News", "content": "UN nuclear chief seeks to secure nuclear safety during Ukraine visit | Fox News Fox News U.S.PoliticsMediaOpinionBusinessEntertainmentSportsLifestyleWeatherTVFox NationListen More Expand / Collapse search Login Watch TV Menu Hot Topics Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. Facebook Twitter Instagram RSS Email World Published January 20, 2023 7:58am EST UN nuclear chief seeks to secure nuclear safety during Ukraine visit 'A nuclear war can never be won, must never be fought' By Alex Hogan , Benjamin Weinthal | Fox News Facebook Twitter Flipboard Comments Print Email close Video Fox News interview with IAEA Director General Fox News correspondent Alex Hogan interviews IAEA Director Rafael Grossi who lays out his current nuclear concerns and responds to Moscow’s claims that a Russian loss in Ukraine could trigger a \"nuclear war\". KYIV, Ukraine – The world’s most dangerous place is arguably the largest nuclear power plant Zaporizhzhia in Ukraine – the site of shelling during Russia’s invasion – and a laser-like of focus for Rafael Grossi, the director general of the International Atomic Energy Agency (IAEA)\"The situation around Zaporizhzhia is getting worse with the evolution of the conflict,\" declared Grossi, who sat down with Fox News on Thursday. \"The eastern front is, of course, heating up, so, I believe the establishment, some interim measure of protection of the nuclear site, is even more necessary and urgent than it ever was,\" Grossi added. \"And I am very anxious to see that I am not getting there as fast I was expecting it to be, or to happen. So this is why it's so important that I can transmit these to [Ukrainian] President [Volodymyr] Zelenskyy, get his support. And it will be my mission to get the Russians to also accept this.\" He issued a dire warning in response to former Russian President Dmitry Medvedev’s comment that \"The loss of a nuclear power [Russia] in a conventional war can provoke the beginning of a nuclear war.\" RUSSIAN PRESIDENT VLADIMIR PUTIN ANNOUNCES ANNEXATION OF 4 UKRAINIAN TERRITORIES AFTER 'SHAM' REFERENDUMS The Zaporizhzhia Nuclear Power Plant in Enerhodar on Sept. 11, 2022. (Stringer/AFP via Getty Images)Grossi said, \"A nuclear war can never be won, must never be fought, somebody said, and I think it is true. So I'm not passing judgment on the comments of a high official of any country. But this is my conviction. And one way to avoid this is to make sure that there are no nuclear accidents. So certainly, I hope that there will be no nuclear use during this conflict.\" The six nuclear reactors that form the Zaporizhzhia installation amid an unpredictable war conjure up worries of a China syndrome-like meltdown. Zaporizhzhia is the largest nuclear facility in Europe. According to the IAEA’s website, the idea for the inspection agency originated in President Dwight D. Eisenhower’s 1953 \"Atoms for Peace\" speech and \"was created in 1957 in response to the deep fears and expectations generated by the discoveries and diverse uses of nuclear technology.\" Grossi’s concerns about the volatile nuclear situation in Ukraine have prompted him to travel frequently to Ukraine since Russia’s invasion nearly a year ago on Feb. 24. \"This is my sixth visit to Ukraine since the war started. So we are very engaged. \" He added,, \"Well, I'm looking at a protracted presence because, of course, we are all hoping for a speedy solution and peace as soon as practicable, and so soon as possible. But I can foresee a prolonged presence.\" IAEA chief Rafael Grossi, right, talks to Ukainian Minister of Energy German Galushchenko during an inspection mission to Zaporizhzhia, on Aug. 31, 2022. (Genya Savilov/AFP via Getty Images)RUSSIA ACCUSED OF KIDNAPPING HEAD OF UKRAINE NUCLEAR PLANT Grossi noted, \"This week what I've been doing is I've been touring the country in a way and setting up these permanent missions, which have very specific technical tasks to perform. These places, although not in active combat zone, are not, of course, free from, you know, events. And as you have seen, and you see it here in Kyiv from time to time, there are hits and there have been occasions where there was a complete blackout and the stations had to be put in emergency mode. So there are lots of things we can do to support them, to provide technical assistance for them.\" The IAEA chief's itinerary includes a meeting with Zelenskyy \"to continue these consultations in order to set up the protection zone around Zaporizhzhia . \" The zone that Grossi referenced is the IAEA’s efforts over the last few months to create a no-fire zone around the Zaporizhzhia reactors. Ukraine insists that Russia withdraw its military from the atomic compound. Moscow has so far refused. CLICK HERE TO GET THE FOX NEWS APP Ukrainian Emergency Ministry rescuers wear protective clothing during a nuclear emergency training session for civilians in Kyiv on Sept. 7, 2022. (Mykola Tys/SOPA Images/LightRocket via Getty Images)There was a flip side to what Grossi described as a \"dismaying picture.\" He said \"On the positive side… I see all the nuclear facilities extremely well run. You know, we are inspectors and we have a very professional look at what we see. There are certain issues that we are looking at.\" Grossi continued that there are many challenges, especially with supplies. \"You shouldn't forget that these nuclear power plants are Russian technology here in the country. So when it comes to spare parts or when it comes to supplies, it's complicated. So the IAEA can help in this regard. \" Alex Hogan currently serves as a London-based correspondent for FOX News Channel (FNC) and joined the network in January 2020 as a general assignment reporter. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Facebook Twitter Instagram Youtube Flipboard LinkedIn Slack RSS Newsletters Spotify iHeartRadio Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us Accessibility Statement This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.", "date": "Fri, 20 Jan 2023 12:58:00 GMT", "url": "https://www.foxnews.com/world/un-nuclear-chief-seeks-secure-nuclear-safety-during-ukraine-visit", "summary": "\n\n-UN nuclear chief seeks to secure nuclear safety during Ukraine visit\n-He issued a dire warning in response to former Russian President Dmitry Medvedev’s comment that \"The loss of a nuclear power [Russia] in a conventional war can provoke the beginning of a nuclear war.\"\n-RUSSIAN PRESIDENT VLADIMIR PUTIN ANNOUNCES ANNEXATION OF 4 UKRAINIAN TERRITORIES AFTER 'SHAM' REFERENDUMS\n-Grossi said, \"A nuclear war can never be won, must never be fought, somebody said, and I think it is true. So I'm not passing judgment on the comments of a high official of any country. But this is my conviction. And one way to avoid this is to make sure that there are no nuclear accidents. So certainly, I hope that there will be no nuclear use during this conflict.\"\n-The six nuclear reactors that form the Zaporizhzhia installation amid an unpredictable war conjure up worries of a China syndrome-like meltdown.\n-Zaporizhzhia is the largest nuclear facility in Europe.\n-According to the IAEA’s website, the idea for the inspection agency originated in President Dwight D. Eisenhower’s 1953 \"Atoms for Peace\" speech and \"was created in 1957 in response to the deep fears and expectations generated by the discoveries and diverse uses of nuclear technology.\"\n-Grossi’s concerns about the volatile nuclear situation in Ukraine have prompted him to travel frequently to Ukraine since Russia’s invasion nearly a year ago on Feb. 24.\n-\"This is my sixth visit to Ukraine since the war started. So we are very engaged.\"\n-He added,, \"Well, I'm looking at a protracted presence because, of course, we are all hoping for a speedy solution and peace as soon`We have the opportunity to refine the concise summary (only if needed) with some more context below.It may or may not be relevant.`for them.\""}