{"title": "Saudi Arabia just said they are now 'open' to the idea of trading in currencies besides the US dollar — does this spell doom for the greenback? 3 reasons not to worry", "content": "Saudi Arabia just said they are now 'open' to the idea of trading in currencies besides the US dollar — does this spell doom for the greenback? 3 reasons not to worry HOME MAIL NEWS FINANCE SPORTS ENTERTAINMENT LIFE SEARCH SHOPPING YAHOO PLUS MORE... Yahoo Finance Yahoo Finance Sign in Mail Finance Watchlists My Portfolio Crypto Yahoo Finance Plus Dashboard Research Reports Investment Ideas Community Insights Webinars Blog News Latest News Yahoo Finance Originals Stock Market News Earnings Politics Economic News Morning Brief Personal Finance Crypto News Bidenomics Report Card Davos Screeners Saved Screeners Equity Screener Mutual Fund Screener ETF Screener Futures Screener Index Screener Analyst Rating Screener Technical Events Screener Smart Money Screener Top Holdings Screener Markets Calendars Trending Tickers Stocks: Most Actives Stocks: Gainers Stocks: Losers Top ETFs Futures World Indices Currencies Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility US Treasury Bonds Rates Currency Converter Videos Company of the Year Yahoo Finance Live Yahoo Finance Presents All Markets Summit Financing Your Future Real Estate Report Retirement ETF Report FA Corner Events Personal Finance Home Retirement Taxes Rates Industries Saved Screeners Equity Screener Mutual Fund Screener ETF Screener Futures Screener Index Screener Analyst Rating Screener Technical Events Screener Smart Money Screener Top Holdings Screener Contact Us Some parts of this page are not supported on your current browser version. Please upgrade to a recent browser version. AdvertisementU.S. markets closedS&P 5003,972.61+73.76 (+1.89%) Dow 3033,375.49+330.93 (+1.00%) Nasdaq11,140.43+288.17 (+2.66%) Russell 20001,867.34+30.99 (+1.69%) Crude Oil81.40+1.07 (+1.33%) Gold1,927.70+3.80 (+0.20%) Silver24.06+0.19 (+0.80%) EUR/USD1.0858+0.0024 (+0.22%) 10-Yr Bond3.4840+0.0870 (+2.56%) GBP/USD1.2401+0.0010 (+0.08%) USD/JPY129.5390+1.1400 (+0.89%) BTC-USD22,879.16+273.63 (+1.21%) CMC Crypto 200515.06+29.04 (+5.98%) FTSE 1007,770.59+23.30 (+0.30%) Nikkei 22526,553.53+148.30 (+0.56%) MoneyWiseSaudi Arabia just said they are now 'open' to the idea of trading in currencies besides the US dollar — does this spell doom for the greenback? 3 reasons not to worryRead full article1.9kOops!Something went wrong.Please try again later.More content belowUSD=XVishesh RaisinghaniJanuary 20, 2023, 1:32 PM·4 min readIn this article: Oops!Something went wrong.Please try again later.More content belowUSD=XSaudi Arabia just said they are now 'open' to the idea of trading in currencies besides the US dollar — does this spell doom for the greenback? 3 reasons not to worryThe 2023 World Economic Forum has been going on for just a few days and we’re already getting a glimpse of the future the global elites envision for us all.Saudi Arabia’s Finance Minister, Mohammed Al-Jadaan, stunned reporters in Davos when he expressed that the oil-rich nation was open to trading in currencies beside the U.S. dollar for the first time in 48 years.“There are no issues with discussing how we settle our trade arrangements, whether it’s in the U.S. dollar, the euro, or the Saudi riyal,” Al-Jadaan said.His comments are the latest signal that powerful nations across the world are plotting a “de-dollarization” of the global economy.Here’s why replacing the dollar is gaining popularity and why dethroning the greenback is easier said than done.Don't miss'Hold onto your money': Jeff Bezos says you might want to rethink buying a 'new automobile, refrigerator, or whatever' — here are 3 better recession-proof buysBetter than NFTs: You don't have to be ultra-rich to own a piece of a Pablo Picasso. Here's how to enter the fine art marketAmericans are paying nearly 40% more on home insurance compared to 12 years ago — here's how to spend less on peace of mindRebellion against the dollarThe dollar’s dominance of global trade and capital flows dates back at least 80 years. Over the last eight decades, the U.S. has been the world’s largest economy, most influential political entity and most powerful military force.However, economists from other countries are increasingly worried that the country has “weaponized” this position of power in recent years, according to the CBC. The U.S. implements sanctions to punish countries in conflict, threatens to devalue its own currency to win trade wars and leverages it to support its own economy at the expense of the rest of the world.Unsurprisingly, these moves have inspired a backlash from China, Russia and other prominent countries.At the 14th BRICS Summit last year, Russian President Vladimir Putin announced measures to create a new “international currency standard.” Meanwhile, China has been urging oil producers and major exporters to accept yuan for payments.Story continuesThis rebellion against the U.S. dollar could erode some of its influence, but there are reasons to believe the greenback’s dominance will be sustained.Replacing the dollar would be hardThe U.S. dollar’s dominance is underappreciated. As of late-2022, the greenback accounts for 59.79% of total foreign reserves. In comparison, the Euro accounts for 19.66%, while the Chinese renminbi accounts for just 2.76% of global reserves.China could expand its market share by twenty-fold and still lag the U.S. dollar by a wide margin.Put simply, replacing the U.S. dollar in foreign reserves is easier said than done.READ MORE: 4 simple ways to protect your money against white-hot inflation (without being a stock market genius)Other countries have a lot of catching upReserve currency status is closely correlated with the size of the issuing country’s economy. In other words, the largest economy usually has the reserve currency status.During the 19th century, the British pound was the world’s reserve currency because the British Empire’s colonies needed it for trade and commerce. For the past century, the U.S. dollar has dominated because the American economy is the largest by far.China’s growth has slowed down in recent years and some believe it will never overtake the U.S. Meanwhile, Russia was the 11th largest economy before it invaded Ukraine, despite being economically smaller in size than California or Texas alone.And India is growing rapidly, but it would need to grow 628% to match the U.S.’s GDP today. That could take 25 years.America’s economic lead is simply insurmountable.The U.S. will still be OKThe final reason Americans shouldn’t be worried about the dollar losing influence is that the worst-case scenario isn’t so bad. Some analysts believe that the future could be more multilateral.The U.S. may lose influence in some segments of the global economy but not lose dominance everywhere. For instance, the Chinese yuan could become more important for trade and cross-border payments, but the dollar could remain the preferred reserve currency for central banks of developed nations.That’s far from an economic nightmare for Americans.What to read nextYou could be the landlord of Walmart, Whole Foods and CVS (and collect fat grocery store-anchored income on a quarterly basis)Here's the golden secret to making your retirement fund as secure as Fort Knox60% of working Americans don’t feel confident they’ll have enough money to retire — here’s how to protect your assets heading into a recessionThis article provides information only and should not be construed as advice. It is provided without warranty of any kind.AdvertisementRelated QuotesSymbolLast PriceChange% ChangeUSD=XUSD/USD1.00000.00000.00%TRENDING 1. Soccer-Yorke leaves coaching role with A-League outfit Macarthur 2. German finance minister warns against quick decoupling from China 3. UPDATE 1-Japan PM Kishida weighs Feb. Ukraine visit to hold talks with Zelenskiy -Yomiuri 4. Japan PM Kishida weighs Feb. Ukraine visit and talks with Zelenskiy -Yomiuri 5. UPDATE 1-Peru arrests 200 in Lima; Machu Picchu ordered closed as protests flare Advertisement AdvertisementAdvertisementAdvertisement", "date": "Fri, 20 Jan 2023 21:32:00 GMT", "url": "https://finance.yahoo.com/news/saudi-arabia-just-said-now-213200817.html", "summary": "\n\n- Saudi Arabia has announced that they are now open to trading in currencies other than the US dollar.\n- There are some reasons to be skeptical about this announcement, but it's still unclear which currencies Saudi Arabia is open to trading in.\n- The US dollar is still the dominant currency in the world, and Saudi Arabia is still a very important part of the global economy.\n- America's economic lead is simply insurmountable, and the US will still be OK."}