{"title": "Lula administration ousts Gen. Julio Cesar de Arruda, head of Brazil's army after insurrection - The Washington Post", "content": "Lula administration ousts Gen. Julio Cesar de Arruda, head of Brazil's army after insurrection - The Washington PostAccessibility statementSkip to main contentSearch NavigationDemocracy Dies in DarknessSign inThe Washington PostDemocracy Dies in DarknessWorldWar In Ukraine Africa Americas Asia Europe Middle East Foreign Correspondents AmericasLula ousts head of Brazil’s army in wake of insurrectionBy Anthony Faiola and Marina Dias Updated January 21, 2023 at 5:44 p.m. EST|Published January 21, 2023 at 2:48 p.m. ESTDemonstrators during a pro-government protest in São Paulo, Brazil, on Jan. 9. (Tuane Fernandes/Bloomberg) ListenComment on this storyCommentGift ArticleShareRIO DE JANEIRO — President Luiz Inácio Lula da Silva ousted the head of Brazil’s army on Saturday, moving against the most senior military officer to be held accountable after the Jan. 8 insurrection, when right-wing rioters rampaged through this nation’s halls of power.Are you on Telegram? Subscribe to our channel for the latest updates on Russia’s war in Ukraine.ArrowRightThe order to fire Gen. Júlio Cesar de Arruda was delivered by Lula’s defense minister, José Múcio, according to a senior administration official who spoke on the condition of anonymity in order to speak candidly.The removal of Arruda came six days after The Washington Post reported that he had sought to protect rioters and supporters of defeated former president Jair Bolsonaro who were sheltering at a camp in front of army headquarters after storming and ransacking the presidential palace, the supreme court and congress.In addressing Arruda’s firing on Saturday evening, Múcio suggested Arruda’s conduct on the night of Jan. 8 was one reason for Arruda’s dismissal.Advertisement“After these last episodes, the issue with the camps, the issue of January 8th, relations with the command of the Army suffered a fracture in the level of trust. And we needed to stop that right at the beginning,” Múcio told reporters in Brasília while standing next to Arruda’s replacement, Gen. Tomás Miguel Ribeiro Paiva.Even after the night of the riots, however, Lula had sought to avoid a direct conflict with Arruda, said a senior judicial source who also spoke on the condition of anonymity in order to speak candidly.The official said Lula acted after Arruda refused his order to fire a former senior Bolsonaro aide, Col. Mauro Cid, who was also in command of an army battalion in the city of Goiânia.The decision now could further raise tensions between Lula and the military, which, along with Brazil’s police forces, is widely believed to harbor strong sympathies for Bolsonaro — a right-wing ideologue and former army captain who stacked the ranks of his cabinet and key civil posts with former members of the armed forces.The freedom to lie? Brazil’s right decries disinformation ‘witch hunt’Lula’s administration has already fired or forced into retirement at least 40 other rank-and-file members of the military who were involved in security at the presidential palace on the day of the attacks by Bolsonaristas — as Bolsonaro’s backers are known.AdvertisementJudicial authorities are now investigating alleged dereliction of duty and possible collusion with rioters by the military and security forces. The evidence being probed includes the actions of military officials on the night of the riots, a change in the security plan before the insurrectionists gathered outside the federal buildings on Jan. 8, police inaction and fraternization as rioters began entering the buildings, and the presence of a senior officer of the military police who had told superiors he was on vacation.“The January 8 riots have exposed Lula’s vulnerability vis-a-vis the military,” said Guilherme Casarões, a political scientist at the Getulio Vargas Foundation in São Paulo. “They have been complicit with the pro-Bolsonaro movements that were growing since election results came out. They also have been key players in spreading disinformation and conspiracy theories against the government they should be serving.”The Jan. 8 attack in Brazil echoed the Jan. 6, 2021, insurrection on the U.S. Capitol. Just as in the United States, the rioters in Brazil were driven by false allegations of electoral fraud. Like Trump — a close ally and political lodestar of the 67-year old former leader defeated on Oct. 30 — Bolsonaro has also refused to recognize defeat.AdvertisementBut the potential complicity of the military, or at least its sympathy for the rioters, has made the dynamic more dangerous for Lula. Many of the rioters are believed to have been residents of a protest camp that sprang up at army headquarters in Brasília on the night of the Oct. 30 election, when Bolsonaristas falsely claimed the defeated president had been robbed.On the night of the riots, Lula administration officials say, the president’s chief of staff, his justice and defense ministers, and other senior officials arrived at the space age-style army headquarters to negotiate the detention of insurrectionists and others in the protest camp.“‘You are not going to arrest people here,’” Arruda told Lula’s justice minister around 10:20 p.m., The Washington Post reported on Jan. 14.After initially refusing, military commanders agreed to allow security officials under Lula’s control to raid — but not until 6 a.m. the following day. Administration officials say they believe that gave the military time to warn hundreds of relatives and friends to leave.Brazil’s military blocked arrests of Bolsonaro rioters, officials sayBrazil’s Supreme Court moved on Jan. 13 to open an investigation into Bolsonaro as part of its probe into the “instigators and intellectual authors” behind the Jan. 8 assaults. Bolsonaro, who is currently holed up in Florida, spent much of his four-year term trying to undermine faith in Brazil’s reliable election system, attempts which escalated as polls showed him trailing Lula. Bolsonaro has denied any links to the rioters and has condemned political violence.AdvertisementArruda will be replaced by Gen. Paiva, the military commander for the Southeast. In a speech this week, Paiva called on Brazilians to respect the result of the October election and affirmed that the army is a nonpolitical and nonpartisan institution.Lula had publicly expressed distrust of the army after Jan. 8, but aides had said he would not fire the commander before investigations were completed to avoid worsening tensions between the executive and the armed forces.On Friday, Lula met with Arruda and the commanders of the Navy, Marcos Sampaio Olsen, and the Air Force, Marcelo Kanitz Damasceno. The meeting was intended to reduce tensions at the beginning of his government.Lula, observers say, now will have to balance the expectations of his backers for justice with the need to ensure he does not further alienate his senior brass.“Lula’s supporters expect the president to go on a witch hunt against Bolsonaristas in the military, [but] anything that may further fuel bad blood between generals and the administration will have dramatic political consequences for a president whose main task is to bring the country together,” Casarões said. CommentsGiftOutlineGift ArticleView moreLoading...TOP STORIESGoing GlobalEssential reporting and analysis from correspondents around the world.The freedom to lie? Brazil’s right decries disinformation ‘witch hunt’Opinion|The trial of Mexico’s former security chief is about more than drugsShe wrote books about sexual abuse by her uncle. Now, he’s going to prison. RefreshTry a different topicSign in or create a free account to save your preferencesCompanyAbout The Post Newsroom Policies & Standards Diversity and Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement Get The PostGift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Newspaper in Education Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsContact the Newsroom Contact Customer Care Contact the Opinions team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of UseDigital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Ad Choices washingtonpost.com © 1996-2023 The Washington Postwashingtonpost.com © 1996-2023 The Washington PostAbout The Post Contact the Newsroom Contact Customer Care Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App Policies & Standards Terms of Service Privacy Policy Cookie Settings Print Products Terms of Sale Digital Products Terms of Sale Submissions & Discussion Policy RSS Terms of Service Ad Choices", "date": "Sat, 21 Jan 2023 22:48:00 GMT", "url": "https://www.washingtonpost.com/world/2023/01/21/lula-brazil-army-arruda/", "summary": "\n\n- The Brazilian government has ousted General Julio Cesar de Arruda, the head of the Brazilian army, after he refused to fire a former senior Bolsonaro aide, Col. Mauro Cid, who was also in command of an army battalion in the city of Goiânia.\n- Arruda was fired after he refused to fire Col. Mauro Cid, who was also in charge of an army battalion in the city of Goiânia on the night of the Bolsonaristas' attack on the presidential palace.\n- Judicial authorities are now investigating alleged dereliction of duty and possible collusion with rioters by the military."}