{"title": "Entry to Machu Picchu suspended amid unrest in Peru\n | CNN Travel", "content": "Entry to Machu Picchu suspended amid unrest in Peru | CNN TravelDestinationsFood & DrinkNewsStayVideoSearchMenuEntry to Machu Picchu suspended amid unrest in PeruClaudia Rebaza and Hira Humayun, CNN • Updated 21st January 2023FacebookTwitterEmail(CNN) — Tourist entry to Machu Picchu Citadel and the Inca Trail Network has been suspended until further notice due to ongoing unrest in Peru, officials in the country said Saturday.The Decentralized Culture Directorate and Machu Picchu Historical Sanctuary Directorate said in a statement the day before that tourists who have a ticket for January 21 or later can claim a refund for up to one month after the end of protests.Earlier this week, protests in Peru continued across the country leaving at least 30 injured. At least two police officers were injured and 11 people detained as protests turned violent in the southern city of Puno on Friday. A police station in Puno was set on fire. Interior Minister Vicente Romero said protesters attacked police stations, government buildings and private businesses across the country Friday.On Saturday, Peru's National Police stormed the National University of San Marcos to remove protesters, the force said on Twitter. According to the tweets, authorities were requested by the university's legal representatives who said unidentified people \"had used violence\" against university staff and taken control of the university campus, including the institution's doors. The university said Saturday that the National Police cleared the university's doors, which had been occupied by protesters who \"participated in marches at the national level.\" Between 200 and 300 policemen entered the university campus with the help of an armored vehicle to remove protesters, according to state news agency Andina. Authorities used tear gas to disperse protesters who were stationed near the entrance gates, the news outlet added. Peru is seeing some of its worst political violence in recent decades. Protesters want new elections, the resignation of Boluarte, a change to the constitution and the release of Castillo, who is currently in pre-trial detention. At the core of the crisis are demands for better living conditions that have gone unfulfilled in the two decades since democratic rule was restored in the country.The Inca citadel of Machu Picchu is seen in Cusco, Peru, in this December 2, 2014 file photo. Enrique Castro-Mendivil/ReutersAccording to Andina, parts of the Urubamba-Ollantaytambo-Machu Picchu railway were damaged during the anti-government protests on Thursday, forcing train services to be suspended until further notice. The suspended train service left 417 people -- including 300 foreign nationals -- stranded in the Machu Picchu district. At least 300 of those tourists are foreigners, according to Peru's Minister of Foreign Trade and Tourism Luis Helguero.\"People are still trapped in Machu Picchu,\" Helguero said. \"417 tourists cannot leave the city, more than 300 are foreigners.\"Helguero said authorities are evaluating and repairing the damage so the tourists can be evacuated. Some tourists have been evacuated by foot, but the trek, Helguero said, was at least six to seven hours long.PeruRail said Thursday it was suspending its services to and from Machu Picchu, among other destinations, because tracks were blocked and damaged in various places. \"We regret the inconvenience this causes our passengers however due to a situation beyond the company's control because of the protests in Cuzco,\" the statement said.CNN's Karol Suarez contributed to this report.A year of the world'sBest BeachesThere's a perfect beach for every week of the year. Join us on a 12-month journey to see them allGo to the best beachesSearchLive TVAudioUSCrime + JusticeEnergy + EnvironmentExtreme WeatherSpace + ScienceWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomPolitics45CongressSCOTUSFacts First2020CandidatesBusinessMarketsTechMediaSuccessPerspectivesVideosOpinionPolitical Op-EdsSocial CommentaryHealthFoodFitnessWellnessParentingVital SignsEntertainmentStarsScreenBingeCultureMediaTechInnovateGadgetMission: AheadUpstartsWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkNewsStayVideosSportsPro FootballCollege FootballBasketballBaseballSoccerOlympicsVideosLive TV Digital StudiosCNN FilmsHLNTV ScheduleTV Shows A-ZCNNVRCouponsCNN UnderscoredExploreWellnessGadgetsLifestyleCNN StoreMorePhotosLongformInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNNAudioLive TVFollow CNN Terms of UsePrivacy PolicyAccessibility & CCAdChoicesAbout UsCNN Studio ToursModern Slavery Act StatementAdvertise with usCNN StoreNewslettersTranscriptsLicense FootageCNN NewsourceSitemap© 2023 Cable News Network.A Warner Bros. Discovery Company.All Rights Reserved.CNN Sans ™ & © 2016 Cable News Network.", "date": "Sat, 21 Jan 2023 21:25:00 GMT", "url": "https://www.cnn.com/travel/article/machu-picchu-entry-suspended-latam-intl/index.html"}