{"title": "Noem bans SD state gov't contracts with 6 nations", "content": "Noem bans SD state gov't contracts with 6 nations Skip to content KELOLAND.com Sign Up Sponsored By Toggle Menu Open Navigation Close Navigation Search Please enter a search term. Primary Menu News Local News Capitol News Bureau KELOLAND.com Originals Agriculture Automotive News Coronavirus Eye on KELOLAND HealthBeat Investigates MMIP in South Dakota Politics from The Hill National & World News Positively KELOLAND Press Releases South Dakota Legislative Session South Dakota Marijuana Your Local Election Headquarters Your Money Matters Top Stories Xcel prices exceed national average as rate increase … 44 mins ago Video Biggest snowfalls recorded in South Dakota history 4 hours ago School worker shot during teens’ fight in St. Paul 44 mins ago Video Inside KELOLAND: Emily’s Hope & 988 5 hours ago Video Weather KELOLAND Weather Radar Live Cam Closeline Submit A Closing Weather Alerts WeatherNow Stream KELOLAND Live Doppler HD Storm Center Storm Tracker App Rain Gauge Drought Sports SportsZone Scoreboard The KELO Cup SDSU Jackrabbits USD Coyotes Top Stories ‘Truly a miracle’: Peyton Hillis discharged Top Stories KELOLAND SportsZone – January 20 Video Top Stories SDSU wrestling wins seventh straight match 20 hours ago Powerhouse Plays – January 20 20 hours ago Video Northern State men take down Minnesota State 20 hours ago USF women battle No. 13 Duluth in 72-54 defeat 20 hours ago Watch Video Center Watch Newscasts KELOLAND WeatherNow Program Schedule CBS News Live Feed KELOXTRA CW of the Black Hills KELOLAND Living Arts & Crafts Show Book Club Watch KELOLAND Living Host Chat Across The Table Business Beat Do It Yourself Recipes Be Our Guest BestReviews BestReviews Daily Deals Be On The Show Our Team KELOLAND Living Golf Tour KELOLAND Living Newsletter Top Stories What is a nanodegree? AARP explains Video Top Stories The South Dakota Symphony celebrates the Lunar New … 1 day ago Video How to celebrate the year of the Rabbit 1 day ago Video Full body HIIT workout to try at home or the gym 1 day ago Video Helpful tips when trying to cut back on alcohol 1 day ago Video Employment Automall Community Buy Local Classifieds Contests Continuing the conversation Events Calendar Gas Prices KELOLAND Pets Obituaries Remarkable Women Tradition Of Caring Lottery Horoscopes About Contact Us uShare Our History Our People Captain 11 KELOLAND Careers Regional News Partners Sign Up For Newsletters Advertise With Us Online Services About BestReviews Do Not Sell My Personal Information Search Please enter a search term. South Dakota Gov. Kristi Noem gives budget address South Dakota Gov. Kristi Noem gives budget address Read Less Capitol News Bureau Noem bans SD state gov’t contracts with 6 nations by: Bob Mercer Posted: Jan 20, 2023 / 07:57 PM CST Updated: Jan 20, 2023 / 07:57 PM CST South Dakota Gov. Kristi Noem gives budget address South Dakota Gov. Kristi Noem gives budget address Read Less by: Bob Mercer Posted: Jan 20, 2023 / 07:57 PM CST Updated: Jan 20, 2023 / 07:57 PM CST SHARE PIERRE, S.D. (KELO) — South Dakota’s governor has directed that all offices, agencies and departments under her control in state government’s executive branch no longer engage in technology purchases or contracts with any business owned or controlled by a person, entity or government from China, Russia, Iran, North Korea, Venezuela or Cuba. The ban also calls for all contractors seeking or conducting business under a state contract to certify in writing they aren’t a prohibited entity and that they will notify the executive branch agency if they become one. The contract would then be terminated. Close Thanks for signing up! Watch for us in your inbox. Subscribe Now Capitol News Bureau SIGN UP NOW Gov. Kristi Noem filed a four-page executive order that takes effect Jan. 25. It states, in part, that “South Dakota is home to critical infrastructure vital to national security, such as the Ellsworth Airforce Base which will house and operate the B-21 Bomber.” It warns, “Cybersecurity vulnerabilities may lead to real-world consequences for South Dakota residents, including the targeted take-down of critical infrastructure by evil foreign governments.” Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Top albums from the 2023 Songwriters Hall of Fame … Recreational Sports / 10 hours ago The Songwriters Hall of Fame was established with the intent to spotlight the accomplishments of songwriters who have created the world’s most beloved songs. Overwhelmed by all the shapewear options? Here are … Sports Apparel / 11 hours ago Modern shapewear has come a long way. Here are the best shapewear items to help you look sleek and smooth in all your clothes. Best yoga socks Reviews / 16 hours ago Yoga is a whole-body practice that tones the body and relaxes the mind, but it can be challenging to relax if you’re constantly slipping around. View All BestReviews Close Thanks for signing up! Watch for us in your inbox. Subscribe Now Capitol News Bureau SIGN UP NOW Close Thanks for signing up! Watch for us in your inbox. Subscribe Now KELOLAND News First@4 SIGN UP NOW Top Stories Xcel prices exceed national average as rate increase … Seasonal Temps Ahead of MUCH Colder Air NEXT Week Biggest snowfalls recorded in South Dakota history White House chief of staff Klain to step down: report School worker shot during teens’ fight in St. Paul Top Stories More Stories Hockey Day South Dakota Sioux Falls could hit 5,000 loads of snow Barbara Walters dies at 93 A special delivery for Sanford Children’s Hospital Brewery uses barrels to build beer Running for a cause More Stories KELOLAND.com Video School worker shot during teenagers’ fight in St. … 44 mins ago Xcel prices exceed national average as rate increase … 45 mins ago Bill filings would change under Randolph plan 49 mins ago KELOLAND On The Go 1/21/23 12 hours ago KELOLAND On The Go 1/21/23 12 hours ago Songbird Kombucha selling fast in cans 21 hours ago Snowy shutterbugs at the Outdoor Campus 21 hours ago Crash near 10th and Sycamore Ave. 21 hours ago KELOLAND chief photographer highlights SD, midwest … 1 day ago Cellular issues in Sioux Falls area 1 day ago What causes black ice? 1 day ago Victim advocates say child labor happens in SD 1 day ago More Videos More from KELOLAND.com Bill filings would change under Randolph plan Inside KELOLAND: Emily’s Hope & 988 ‘Truly a miracle’: Peyton Hillis discharged Suspect arrested in Iowa 9 months after Ariz. killing 3 generations, 3 sets of twins, one Kansas family Shot by 6-year-old, Va. teacher is out of hospital Prosecutors: Elizabeth Holmes is a flight risk Buzz Aldrin gets married on 93rd birthday More from KELOLAND.com no iframe support! See Full Weather Forecast Trending Stories Arrests made in Sioux Falls drug ring Noem bans SD state gov’t contracts with 6 nations Suspect arrested in Iowa 9 months after Ariz. killing Arrest warrant for kidnapping issued for Clark Co. … The new owners of the South Dakota Powerball ranch Don't Miss! Alaska & Glacier Bay Cruise Don't Miss / 5 days ago Win Tickets to see Alabama! Contests / 2 weeks ago KELOLAND Pro Football Challenge Contests / 5 months ago Your Guide To Coronavirus KELOLAND.com Original / 3 years ago KELOLAND Investigates Don't Miss / 12 months ago View All Don't Miss Tweets by pierremercer KELOLAND Local News and Weather Follow Us News App Get the iOS app Get the Android app from Google Play Weather App Get the iOS Weather app Get the Android Weather app from Google Play Local News KELOLAND.com Original Weather Sports Investigates Capitol News Bureau Your Money Matters HealthBeat NewsNation Now KELOLAND Living Advertise With Us Advertising Terms and Conditions EEO Public File FCC Public File Information Privacy Policy Terms Of Use Covers FCC Applications Public File Assistance Contact The Hill NewsNation BestReviews Content Licensing Nexstar Digital Journalistic Integrity Do Not Sell or Share My Personal Information © 1998 - 2023 Nexstar Media Inc. | All Rights Reserved. ✕ × Close Ad", "date": "Sat, 21 Jan 2023 01:57:12 GMT", "url": "https://www.keloland.com/news/capitol-news-bureau/noem-bans-sd-state-govt-contracts-with-6-nations/"}