{"title": "Kidnapped women and children freed in Burkina Faso | News | Al Jazeera", "content": "Kidnapped women and children freed in Burkina Faso | News | Al Jazeera Skip linksSkip to Contentplay Live Show navigation menuNavigation menuNewsShow more news sectionsMiddle EastAfricaAsiaUS & CanadaLatin AmericaEuropeAsia PacificUkraine warFeaturesEconomyOpinionVideoMoreShow more sectionsCoronavirusClimate CrisisInvestigationsInteractivesIn PicturesScience & TechnologySportsPodcastsplay Live Click here to searchsearchNewsKidnapped women and children freed in Burkina FasoArmed men had abducted 66 people on January 12 and 13 outside two villages in the district of Arbinda.Burkina Faso is one of several countries in West Africa battling a rampant armed uprising with links to al-Qaeda and ISIL [File: Olympia de Maismont/AFP]Published On 21 Jan 202321 Jan 2023facebooktwitterwhatsappSecurity forces have rescued 66 women and children who were kidnapped by armed fighters in northern Burkina Faso last week. Armed men seized the women and their children on January 12 and 13 outside two villages in the district of Arbinda, in the Sahel region’s Soum province. Security forces conducted a rescue operation and freed 27 women and 39 babies, children and young girls in the adjacent Centre-Nord region, national broadcaster Radiodiffusion Television du Burkina (RTP) said on Friday. “They have found freedom after eight long days in the hands of their kidnappers,” an RTP presenter said. In its main evening news bulletin, RTB, referring to the army “operation”, showed images of the women freed and brought to the capital, Ouagadougou. Several government and security officials confirmed the news, Reuters and AFP news agencies reported. The abduction prompted alarm from the United Nations, while the country’s military government warned of a rise in attacks on civilians. Burkina Faso is one of several countries in West Africa battling a rampant armed uprising with links to al-Qaeda and ISIL (ISIS). Armed rebels have occupied territory in the country’s arid and mainly rural north, executing hundreds of villagers and displacing thousands more in the process. They have also blockaded certain areas in recent months and made it increasingly dangerous to deliver supplies to trapped citizens. Faced with acute food shortages, many villagers have resorted to picking wild fruit, leaves and seeds to feed their families. They say venturing into the bush makes them vulnerable to attacks. On Thursday, two suspected attacks in the country’s north and northwest killed at least 18 people, including 16 vigilantes supporting the army. Captain Ibrahim Traore, leader of the military government that seized power last September, said in December that his aim was to take back territory occupied by “hordes of terrorists”. Last week, he said the armed rebels were switching tactics to “focus on civilians”. Source: News AgenciesAboutShow moreAbout UsCode of EthicsTerms and ConditionsEU/EEA Regulatory NoticePrivacy PolicyCookie PolicyCookie PreferencesSitemapCommunity GuidelinesWork for usHR QualityConnectShow moreContact UsAdvertise with usAppsChannel FinderTV SchedulePodcastsSubmit a TipOur ChannelsShow moreAl Jazeera ArabicAl Jazeera EnglishAl Jazeera Investigative UnitAl Jazeera MubasherAl Jazeera DocumentaryAl Jazeera BalkansAJ+Our NetworkShow moreAl Jazeera Centre for StudiesAl Jazeera Media InstituteLearn ArabicAl Jazeera Centre for Public Liberties & Human RightsAl Jazeera ForumAl Jazeera Hotel PartnersFollow Al Jazeera English:facebooktwitteryoutubeinstagram-colored-outlinerss© 2023 Al Jazeera Media Network", "date": "Sat, 21 Jan 2023 07:08:22 GMT", "url": "https://www.aljazeera.com/news/2023/1/21/women-children-freed-in-burkina-faso-after-kidnapping"}