{"title": "Air India fined over 'peegate' scandal", "content": "Air India fined over 'peegate' scandal SUBSCRIBE THAILAND WORLD BUSINESS OPINION AUTO LIFE LEARNING TRAVEL MORE+ Other Services JOBS HOME DELIVERY Digital products EPAPER SMS DIGITAL ARCHIVE Other DATA HUB SPECIAL FEATURES VIDEO SPORTS TECH PROPERTY PHOTOS Section Thailand General Politics Special Report PR News World Business Opinion Columnists Postbag Sports Auto News Review Sports Auto News Review Life Arts & Entertainment Social & Lifestyle Learning Video Thailand World Travel & Lifestyle Business Travel Tech Property Photos Other Services JOBS HOME DELIVERY About Us CONTACT US ONLINE ADVERTISING TELL US WHAT YOU THINK Other DATA HUB SPECIAL FEATURES SUBSCRIBE Digital Products TODAY’S PAPER EPAPER SMS DIGITAL ARCHIVE Air India fined over 'peegate' scandal 0 World Air India fined over 'peegate' scandal Drunk bank executive accused of urinating on female passenger but no action taken for weeks published : 21 Jan 2023 at 15:28 writer: AFP 27 0 An Air India aircraft is pictured on the tarmac at the Indira Gandhi International airport in New Delhi. (Photo: AFP) NEW DELHI: Air India has been fined $37,000 for its handling of an incident in which a drunk bank executive was accused of urinating on a female passenger, Indian media have reported.The man allegedly relieved himself on the 72-year-old woman seated in business class on a Nov 26 flight from New York to New Delhi, an incident dubbed “peegate” by the media. The Indian Directorate General of Civil Aviation also fined Air India’s director of in-flight services 300,000 rupees in addition to the carrier’s penalty of three million rupees ($37,000), reports on Friday and Saturday said. The flight’s pilot also had his licence suspended for three months for “failing to discharge his duties” to ensure safety and discipline. The banker, Indian national Shankar Mishra, was allowed to disembark as normal when the aircraft landed in India and no immediate action was taken. The woman complained and, after the story was widely reported in the Indian media, police arrested Mishra weeks later after he went to ground and reportedly switched off his phone. The US bank Wells Fargo fired him from his job as vice-president of its Indian operations after the “deeply disturbing” allegations. Air India faced severe criticism for its handling of the woman’s complaint and the airline’s chief executive was forced to issue an apology. “Air India acknowledges that it could have handled these matters better, both in the air and on the ground and is committed to taking action,” chief executive Campbell Wilson said. Mishra has been refused bail. His lawyer, Ramesh Gupta, told a hearing last week that the woman, an Indian classical dancer, had in fact urinated on herself. According to Indian media, Gupta also said that, because of where she was seated, it was impossible for Mishra to have urinated on her without also doing so on another woman who has “made no such complaint”. The case is the latest embarrassing incident to be reported in India’s booming airline sector in recent months, including shirtless brawls and passengers having heated arguments with cabin crew. Another inebriated man was accused of urinating on the blanket of a woman on a flight from Paris to India last month but no action was taken after he issued a written apology, reports said. 27 0 Keywords Air India unruly passenger TRENDING Do you like the content of this article? COMMENT MORE IN SECTION Hong Kong worshippers flock to Wong Tai Sin Temple for Lunar New Year ritual after 2-year Covid suspension Processions, lunches and concert to crown King Charles III Brazil's Lula sacks army commander after anti-government riots Buzz Aldrin, second man on the Moon, marries on 93rd birthday ‹› MOST RECENT World Hong Kong worshippers flock to Wong Tai Sin Temple for Lunar New Year ritual after 2-year Covid suspension Hong Kong's most well-known Taoist temple has resumed the ritual of burning the first incense sticks of the Lunar New Year after a two-year suspension because of the Covid-19 pandemic. 07:08 Thailand Free breast cancer checks for gold card holders: NHSO The National Health Security Office (NHSO) on Saturday approved free breast cancer screening for women universal healthcare card holders with immediate family members who have had the condition. 07:06 Thailand City train changes 'baffling' Commuters missing their ride as stations fail to coordinate. 06:16 THAILAND General Politics Special Report PR News WORLD BUSINESS OPINION Columnists Postbag SPORTS AUTO News Review LIFE Arts & Entertainment Social & Lifestyle Guru LEARNING LIFE Arts & Entertainment Social & Lifestyle Guru B Magazine LEARNING VIDEO Thailand World Travel & Lifestyle TRAVEL TECH PROPERTY PHOTOS DIGITAL PRODUCTS & SERVICES EPaper SMS Digital Archive Jobs Home Delivery OTHER Data Hub Special Features STAY INFORMED.GET DAILY UPDATES FROM THE BANGKOK POST. Please put in a valid-email. Thank you for subscribing our enewsletter. You will get the updates within 24 hours. SUBSCRIBE By subscribing, you accept the terms and conditions in our privacy policy. ©2023 Bangkok Post Public Company Limited Terms of use Republishing permission Privacy policy Cookies policy Online advertising Contact us Tell us what you think Partnership", "date": "Sat, 21 Jan 2023 08:28:00 GMT", "url": "https://www.bangkokpost.com/world/2488054/air-india-fined-over-peegate-scandal"}