{"title": "Ukraine May Get 'Huge Add' to Military That Could Level Russia's Advances", "content": "Ukraine May Get 'Huge Add' to Military That Could Level Russia's Advances Sat, Jan 21, 2023LOGIN Subscribe for $1 Newsweek Search U.S.WorldTech & ScienceCultureAutosRankingsHealthLifeOpinionExpertsEducationPodcastsVantageAbout UsAnnouncementsLeadershipCEO Dev PragadArchive NewsUkraine May Get 'Huge Add' to Military That Could Level Russia's Advances By Jon Jackson On 1/20/23 at 4:11 PM EST Share Share on Facebook Share on Twitter Share on LinkedInShare on RedditShare on Flipboard Share via Email Comments News Netherlands Ukraine Volodymyr Zelensky Russia A government official from the Netherlands on Thursday said his country would consider supplying F-16 fighter jets to Ukraine if Kyiv made such a request.Dutch Minister of Foreign Affairs Wopke Hoekstra made the statement about the jets during a parliamentary debate, according to the Dutch website NL Times. Hoekstra reportedly said the Dutch Cabinet would mull over a request for F-16s with an \"open mind,\" adding that there would be \"no taboos\" for the delivery of regular equipment to the Eastern European country.John Spencer, a retired U.S. Army major and chair of Urban Warfare Studies at the Madison Policy Forum, told Newsweek on Friday that the addition of F-16s to Ukrainian President Volodymyr Zelensky's forces would have a noticeable impact at a time when Russian forces have made recent gains on the battlefield.\"It would give Ukraine what it doesn't have now, which is a much larger air force capability,\" Spencer said. \"It would be a huge add to Ukraine.\" Ukrainian President Volodymyr Zelensky is seen during a press conference on January 11 in Lviv, Ukraine. Inset, a Dutch F-16 fighter jet returning to a military airbase on June 30, 2016. On Thursday, a Dutch official said the country would consider giving Ukraine F-16s if Kyiv asked for them. Photos by Stanislav Ivanovs/Global Images Ukraine/ROBIN VAN LONKHUIJSEN/AFP/Getty Images Hoekstra's comments about F-16s came on the same day that Dutch Minister of Defense Kajsa Ollongren said the Netherlands would be willing to cover the costs for Leopard tanks to be sent to Ukraine as part of a coalition of allies.\"That is definitely something that we would be willing to do,\" Ollongren told Bloomberg News about such a plan regarding the Leopards. \"We are all waiting to hear what the German position is on this, but I'm an advocate to trying to find a solution and trying to send tanks to Ukraine.\"Her comments regarding Germany was in reference to a Friday meeting at Ramstein Air Base in Germany. The U.S.-led meeting of Ukraine's allies centered on military support for Zelensky, and the topic of German-made Leopard 2 tanks was one of the main talking points.U.S. Secretary of Defense Lloyd J. Austin III told reporters Friday that the meeting ended with Germany still undecided on whether or not to allow Leopard 2 tanks to be sent to Ukraine. Read more Russia's massive deaths in Ukraine are \"absolute catastrophe\": U.S. General Is the U.S. running out of weapons to send Ukraine? Putin fighting Wagner Group's rise after ally claims war success: ISW If a deal with the Netherlands for F-16s comes to fruition, however, Ukraine would at least be given a formidable weapon in the air, according to Spencer.\"F-16s have multi-role platform. It can do close air support and air supremacy type of roles,\" Spencer said.He also added that a government official floating the idea of such an offer doesn't mean a plan has been established, and pointed to the U.S. rejecting a plan last year by Poland to transfer MiG-29 fighter jets to a U.S. base in Germany.If the F-16s deal comes together, though, Spencer said the fighter jets \"would be a great addition to their capabilities, especially in preparing for spring offense.\"Newsweek reached out to the Netherland's Ministry of Foreign Affairs for comment. Request Reprint & Licensing, Submit Correction or view Editorial Guidelines The debate Gun Laws Have Disproportionate Impact on Black Communities | Opinion Gun Laws Have Disproportionate Impact on Black Communities | OpinionBy Jeff CharlesVS There's Nothing Racist About Gun Safety | Opinion There's Nothing Racist About Gun Safety | OpinionBy Ellis Henican Get the best of Newsweek via email CHOOSE YOUR SUBSCRIPTION PREMIUMNewsweek magazine delivered to your doorUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $9.99 DIGITAL+ Ad FreeUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $1NEWSLETTERBEST OF NEWSWEEK VIA EMAILJoin half a million readers enjoying Newsweek's free newsletters Email address Newsweek© 2023 NEWSWEEK DIGITAL LLC Editions:U.S. Edition日本PolskaRomâniaAbout UsMastheadDiversityAnnouncementsArchiveCareersCorrectionsContact UsPolicies and StandardsMission StatementAdvertiseCopyrightTerms & ConditionsPrivacy PolicyCookie PolicyTerms of SaleLeadershipCEO Dev PragadNewslettersDo Not Sell My Personal InformationGDPR Privacy Settings", "date": "Fri, 20 Jan 2023 21:11:39 GMT", "url": "https://www.newsweek.com/ukraine-may-get-huge-add-military-that-could-level-russias-advances-1775444"}