{"title": "Time to join NATO? Moldova eyes joining ‘a larger alliance’ – POLITICO", "content": "Time to join NATO? Moldova eyes joining ‘a larger alliance’ – POLITICO Sunday, January 22, 2023 POLITICO Live About POLITICO Live Upcoming Events More Info About Us Media Solutions Content Studio Press Print Edition Contact Us Jobs Careers at POLITICO Primary Menu Politico Pro Sign up to newsletters Sign In Search for: Submit Politico Pro Explore Newsletters & podcasts Featured Sections Brussels France Germany Britain Coronavirus in Europe Migration Elections in Europe Defense Foreign Policy Poll of Polls Continent EU-China EU Recovery Plan Italian election 2022 Special Reports Policy Areas Agriculture and Food Competition and Industrial Policy Cybersecurity and Data Protection Energy and Climate EU-UK Financial Services Health Care Mobility Sustainability Technology Trade Trade UK Featured Series POLITICO 28 Series Global Policy Lab Climate, Changed Work Reloaded Silent Killers After Corona The Road to COP26 Telescope: AIDS EU in Africa Changemakers The wonk's survival guide to the EU Green Deal Commentary Unpacked Beyond The Bubble From Across the Pond Club Med Declassified POLITICO Live See all future events See all past events About POLITICO Live Editions EU Edition U.K. Edition U.S. Edition Publications Print Edition Newsletters Brussels Playbook London Playbook Playbook Paris Davos Playbook Sunday Crunch Berlin Bulletin London Influence EU Influence Digital Bridge China Direct Politico Confidential Global Policy Lab: Living Cities Podcasts EU Confidential Westminster Insider Campaign Confidential Davos Confidential our apps Play Store App Store Social Links Facebook Twitter LinkedIn Discover POLITICO Pro In-depth reporting, data and actionable intelligence for policy professionals – all in one place. What is POLITICO Pro? Policy areas Our Pro coverage Request a demo Contact us Hot Topics Davos Qatargate War in Ukraine France Living Cities POLITICO 28 Time to join NATO? Moldova eyes joining ‘a larger alliance’ President Maia Sandu tells POLITICO a ‘serious discussion’ is taking place about locking into a broader military alliance. Sandu was careful not to name-check NATO, anathema to Russian President Vladimir Putin, who is already trying to destabilize Moldova’s pro-EU government | Pool photo by Yoan Valat/AFP via Getty images By Suzanne Lynch January 20, 2023 7:17 pm CET 4 minutes read Share on Facebook Share on Twitter Share on Linkedin Share on WhatsApp Mail Print Press play to listen to this article Voiced by artificial intelligence. DAVOS, Switzerland — Russia’s invasion of Ukraine is prompting soul-searching in neighboring Moldova about whether the country needs to shift away from its constitutionally-enshrined neutrality and lock itself into a “larger alliance.” When asked about potential NATO accession, Moldova’s President Maia Sandu said in an interview with POLITICO the country was still weighing its next step, and whether it would require a constitutional change to do so. “Now, there is a serious discussion … about our capacity to defend ourselves, whether we can do it ourselves, or whether we should be part of a larger alliance,” she said. “And if we come, at some point, to the conclusion as a nation that we need to change neutrality, this should happen through a democratic process.” In her response, Sandu was careful not to name-check NATO, anathema to Russian President Vladimir Putin, who is already trying to destabilize Moldova’s pro-EU government. Russia has warned against further military cooperation between Moldova and Western allies. You may like World’s cartoonists on this week’s events By POLITICO America in decline? World thinks again By Matthew Kaminski Macron proposes major boost to French defense spending amid Ukraine war By Clea Caulcutt Although Moldova is not a member of NATO, it does cooperate with the organization and contributes to the NATO-led peacekeeping force in Kosovo. Sandu, along with other leaders, met with NATO Secretary-General Jens Stoltenberg in New York during the United Nations General Assembly in September last year. Moldova’s foreign minister, Nicu Popescu, attended December’s NATO meeting in Bucharest — the first time a Moldovan foreign minister has participated in a NATO ministerial. At that gathering, allies reconfirmed support for Moldova, including through the provision of training for Moldovan defense forces. Neighboring NATO member Romania is also particularly keen to increase military co-operation. The most glaring obstacle to Moldova’s further integration is that Russian soldiers are based inside the country, within the breakaway region of Transnistria. Still, the military calculus is becoming more pressing. Moldova has found itself perilously close to the conflict that began almost a year ago. Just last week, missile debris was again found, in the north of the country. Attacks against energy infrastructure in Ukraine also knock out power in Moldova. Moldova must perform a delicate dance: on the one hand staying true to its pro-Western and EU trajectory, on the other, not aggravating Russia to the point where it might use military force. ‘Peaceful country’ Russia has repeatedly warned Moldova about military cooperation with the West, viewing the former Soviet state as under its sphere of influence. But Sandu pushes back against any perception that Moldova’s move to strengthen its defense — either by increasing its own military capacity, or by forging closer relations with other allies — is provocative, saying that Russia, not Ukraine or Moldova, is the aggressor. “Moldova is a peaceful country. It’s not Moldova that started a war against its neighbors,” she said. “Russian propaganda managed to convince part of the population that neutrality means you don’t have to invest in your defense sector, that neutrality means you do nothing and you have no capacity to defend yourself, which is wrong.” Sandu, a former World Bank official, was elected in 2020 on an anti-corruption drive. In June, the country will host the second meeting of the European Political Community, a Europe-wide forum for EU and non-EU countries, which first convened in Prague last year. Moldova, which under the pro-Western Sandu government is committed to joining the EU, was granted candidate status in June. While discussions on accession are ongoing, the prospect of membership is still years away. Nonetheless, the EU has upped its support for the country, allocating hundreds of millions of euros to Moldova in the form of loans and grants since the Russian invasion of Ukraine. To help facilitate Moldova’s move away from Russian gas, the country’s electricity grid was synchronized with the EU last year — a significant further step toward the West. Overall, Sandu says the country remains highly “vulnerable,” and is subject to Russian hybrid war through propaganda and misinformation. But for the moment, it’s not facing military threats. The reason? Ukrainian bravery and resilience. “Thanks to the Ukrainians’ courage and resistance, we are not facing military threats as of now,” she says. “We are facing a range of risks, but none of it compares to the situation in Ukraine and, and to the price that Ukrainians are paying.” More from ... Suzanne Lynch Related Content Germany snubs Ukraine’s tank request To go or not to go? Von der Leyen’s COVID committee dilemma US cable: Russian paramilitary group set to get cash infusion from expanded African mine From Davos: Tanks to Ukraine — Irish PM Leo Varadkar — EU-US trade fight Let’s not make it official: NATO allies reluctant to increase spending goals Careers at POLITICO Journaliste politique, Paris Location: Paris | Department: Editorial HR Trainee, Learning & Development Location: Brussels | Department: Internships Strategy and Operations Associate Location: Brussels | Department: Corp & Exec All job postings Careers at POLITICO View the Latest Issue Read the latest print issue online Next up RT France to shut down after accounts frozen January 21, 2023 8:22 pm CET By Laura Kayali ‘We need action’: Time runs out for Ukraine as allied countries debate sending tanks January 21, 2023 1:38 pm CET By Paul McLeary and Lili Bayer Scholz, Macron seek to reset fraught relations with big celebration January 21, 2023 12:15 pm CET By Clea Caulcutt and Hans von der Burchard White House sets additional sanctions against Russia’s Wagner Group January 21, 2023 11:59 am CET By Kelly Hooper Related Tags Banks Conflict Cooperation Crisis Davos Defense Electricity Energy Energy prices Gas Military Misinformation Resilience Risk and compliance War War in Ukraine Related Countries Germany Moldova Russia Transnistria Ukraine Related People Maia Sandu Explore politico EU Brussels Latest news, analysis and comment from POLITICO’s editors and guest writers in Europe. Germany Latest news, analysis and comment on German politics and beyond. France Latest news, analysis and comment on French politics and beyond. Elections in Europe Latest news, analysis and comment on elections in Europe and beyond. Coronavirus in Europe The latest news, data and analysis on the world’s pandemic response. Migration Latest news, analysis and comment on migration in Europe and beyond. Defense Latest news, analysis and comment on defense in Europe and beyond. Continent Latest news, analysis and comment from POLITICO’s editors and guest writers on the continent. Policy Areas Agriculture and Food Competition and Industrial Policy Cybersecurity and Data Protection Health Care Energy and Climate EU-UK Financial Services Mobility Sustainability Technology Trade Trade UK Newsletters Brussels Playbook Playbook Paris London Playbook Davos Playbook Sunday Crunch Politico Confidential London Influence EU Influence Global Policy Lab: Living Cities Berlin Bulletin Digital Bridge China Direct Explore Products Series POLITICO 28 Series Global Policy Lab Climate, Changed Work Reloaded Silent Killers After Corona The Road to COP26 Telescope: AIDS EU in Africa Changemakers The wonk's survival guide to the EU Green Deal Commentary Unpacked Beyond the Bubble From Across the Pond Club Med Declassified Podcasts EU Confidential Westminster Insider Davos Confidential Campaign Confidential our apps Play Store App Store Print Edition POLITICO Live Explore the live extension of our journalism Discover POLITICO Pro In-depth reporting, data and actionable intelligence for policy professionals – all in one place. Politico Logo About us Contact us Privacy Policy Cookie Policy Media Solutions Press Print Edition Jobs Careers at POLITICO Ts&Cs FAQs Close login modal Log in Log in to access content and manage your profile. If you do not have an account you can register here. Email address Password Forgot your password? Remember me Log in By logging in, you confirm acceptance of our POLITICO Privacy Policy. Privacy", "date": "Fri, 20 Jan 2023 18:17:00 GMT", "url": "https://www.politico.eu/article/maia-sandu-moldova-nato-alliance-joining-ukraine-war-russia-invasion/"}