{"title": "Iranian currency falls to record low amid isolation and sanctions | Reuters", "content": "Iranian currency falls to record low amid isolation and sanctions | Reuters Skip to main contentReuters homeWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsMoreMy ViewRegisterMacro Matters3 minute readJanuary 21, 20234:02 PM UTCLast Updated agoIranian currency falls to record low amid isolation and sanctionsReutersA currency dealer poses for a photo with a U.S one dollar bill and the amount being given when converting it into Iranian rials in an exchange shop in Tehran, Iran December 25, 2022. Majid Asgaripour/WANA (West Asia News Agency) via REUTERS DUBAI, Jan 21 (Reuters) - Iran's troubled currency fell to a record low against the U.S. dollar on Saturday amid the country's increasing isolation and possible Europe Union sanctions against Tehran's Revolutionary Guards or some of its members.Ties between the EU and Tehran have deteriorated in recent months as efforts to revive nuclear talks have stalled. Iran has detained several European nationals and the bloc has become increasingly critical of the violent treatment of protesters and the use of executions.The EU is discussing a fourth round of sanctions against Iran and diplomatic sources have said members of the Revolutionary Guards will be added to the bloc's sanctions list next week. But some EU member states want to go further and classify the Guards as a whole as a terrorist organisation.The dollar was selling for as much as 447,000 rials on Iran's unofficial market on Saturday, compared with 430,500 the previous day, according to the foreign exchange site Bonbast.com.The rial has lost 29% of its value since nationwide protests following the death in police custody of a 22-year-old Kurdish Iranian woman, Mahsa Amini, on Sept. 16.The unrest has posed one of the biggest challenges to theocratic rule in Iran since the 1979 Islamic Revolution.The economic Ecoiran website blamed the continued fall of the rial on an apparent \"global consensus\" against Iran.\"Increasing political pressures, such as placing the Revolutionary Guards on a list of terrorist organisations, and imposing restrictions on Iran-linked ships and oil tankers... are factors pointing to a global consensus against Iran, (which may affect) the dollar's rate in Tehran,\" Ecoiran said.The European Parliament called on Wednesday for the EU to list Iran's Guards as a terrorist group, blaming the powerful force for the repression of protesters and the supply of drones to Russia. The assembly cannot compel the EU to add the force to its list, but the text was a clear political message to Tehran.Panama's vessel registry, the world's largest, has withdrawn its flag from 136 ships linked to Iran's state oil company in the last four years, the country's maritime authority said this week. read more Iran's central bank governor Mohammad Reza Farzin on Saturday blamed the fall of the rial on \"psychological operations\" which Tehran says its enemies are organising to destabilise the Islamic Republic.\"Today, the central bank faces no restrictions in terms of foreign currency and gold resources and reserves, and media deceit and psychological operations are the main factors behind the fluctuation in the free exchange rate,\" state broadcaster IRIB cited Farzin as saying.Facing an inflation rate of about 50%, Iranians seeking safe havens for their savings have been trying to buy dollars, other hard currencies or gold.Reporting by Dubai newsroomOur Standards: The Thomson Reuters Trust Principles.Read NextMacro MatterscategoryChina's on the move again, economic outlook brightens, article with imageJanuary 13, 2023GalleryMacro MatterscategoryJapan's biggest banks to raise housing loan rates after BOJ's policy tweak, article with galleryDecember 30, 2022Macro MatterscategoryJapan's tourism restart stirs hope of service-sector recovery -PMI, article with imageOctober 5, 2022Macro MatterscategorySouth Korea's Sept inflation slows but tightening bias seen intact, article with imageOctober 5, 2022Macro MattersIranian currency falls to record low amid isolation and sanctions, article with imageMacro Matterscategory · January 21, 2023Iran's troubled currency fell to a record low against the U.S. dollar on Saturday amid the country's increasing isolation and possible Europe Union sanctions against Tehran's Revolutionary Guards or some of its members.VideoU.S. MarketscategoryU.S. home sales slump to 12-year low; glimmers of hope emerging, article with videoJanuary 21, 2023VideoUnited StatescategoryU.S. hits debt ceiling as partisan standoff sparks economic worries, article with videoJanuary 20, 2023Macro MatterscategoryFed's Waller, citing \"good news,\" backs quarter-point increase at next meeting, article with imageJanuary 20, 2023Macro MatterscategorySmaller Fed rate increase may augur end to 'ongoing' hikes, article with imageJanuary 20, 2023Site IndexBrowseWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsOpen in new tab, opens new tabLifestyleAbout ReutersAbout ReutersOpen in new tab, opens new tabCareersOpen in new tab, opens new tabReuters News AgencyOpen in new tab, opens new tabBrand Attribution GuidelinesOpen in new tab, opens new tabReuters LeadershipOpen in new tab, opens new tabReuters Fact CheckOpen in new tab, opens new tabReuters Diversity ReportOpen in new tab, opens new tabStay InformedDownload the AppOpen in new tab, opens new tabNewslettersOpen in new tab, opens new tabInformation you can trustReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.Follow UsThomson Reuters ProductsWestlawOpen in new tab, opens new tabBuild the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology.OnesourceOpen in new tab, opens new tabThe most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs.CheckpointOpen in new tab, opens new tabThe industry leader for online information for tax, accounting and finance professionals.Refinitiv ProductsRefinitiv WorkspaceOpen in new tab, opens new tab Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.Refinitiv Data CatalogueOpen in new tab, opens new tab Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.Refinitiv World-CheckOpen in new tab, opens new tabScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.Advertise With UsOpen in new tab, opens new tabAdvertising GuidelinesOpen in new tab, opens new tabCookiesOpen in new tab, opens new tabTerms of UseOpen in new tab, opens new tabPrivacyOpen in new tab, opens new tabDigital AccessibilityOpen in new tab, opens new tabCorrectionsOpen in new tab, opens new tabSite FeedbackOpen in new tab, opens new tabAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2022 Reuters. All rights reserved", "date": "Sat, 21 Jan 2023 16:02:00 GMT", "url": "https://www.reuters.com/markets/currencies/iranian-currency-falls-record-low-amid-isolation-sanctions-2023-01-21/"}