{"title": "Subscribe to read | Financial Times", "content": "Subscribe to read | Financial TimesAccessibility helpSkip to navigationSkip to contentSkip to footerSign InSubscribeOpen side navigation menuOpen search barFinancial TimesSubscribeSign InmyFTSearch the FTSearchClose search barHomeWorldSectionsWorld HomeGlobal EconomyUKUSChinaAfricaAsia PacificEmerging MarketsEuropeWar in UkraineAmericasMiddle East & North AfricaAustralia & NZMost ReadGermany defies allies’ pressure to send tanks to UkraineWhy are Ukraine’s allies arguing about tanks?Chris Hipkins lined up to replace Jacinda Ardern as New Zealand prime ministerEmmanuel Macron to boost French defence spending in response to Ukraine warFed governor backs quarter-point interest rate rise at next policy meetingUSCompaniesSectionsCompanies HomeEnergyFinancialsHealthIndustrialsMediaProfessional ServicesRetail & ConsumerTech SectorTelecomsTransportMost ReadBanks prepare for deepest job cuts since the financial crisisRentokil takes on the world’s rat problem with facial recognitionMorgan Stanley cuts CEO James Gorman’s pay to $31.5mn after profits dropRoman Arnold: the German entrepreneur who bet big on bikes and wonSteven Cohen’s Point72 finally gains UK regulatory approvalTechMarketsSectionsMarkets HomeAlphavilleMarkets DataCryptofinanceCapital MarketsCommoditiesCurrenciesEquitiesFund ManagementTradingMoral MoneyETF HubMost Read‘Nightmare’: collapse of leading crypto lender traps investorsFTX lawyers accuse Sam Bankman-Fried of ‘assault by Twitter’Elon Musk plays down influence of his tweets on Tesla’s share priceEuro regains ground against dollar as global economic outlook improvesSteven Cohen’s Point72 finally gains UK regulatory approvalClimateOpinionSectionsOpinion HomeColumnistsThe FT ViewThe Big ReadLexObituariesLettersMost ReadIs life in the UK really as bad as the numbers suggest? Yes, it isMorgan Stanley pulls the Pepsi trick on GoldmanChatGPT will force school exams out of the dark agesPodcasts aren’t as smart as you thinkSmartphones? They’re so very 2022Work & CareersSectionsWork & Careers HomeBusiness School RankingsBusiness EducationEntrepreneurshipRecruitmentBusiness BooksBusiness TravelMost ReadWanted: older workers for flexible and desirable jobsTyler Cowen: ‘Economists can’t predict the effects of new technologies. Surely that should humble us a bit?’Life & ArtsSectionsLife & Arts HomeArtsBooksFood & DrinkFT MagazineHouse & HomeStyleTravelFT GlobetrotterMost Read300 nuclear missiles are heading your way. You must respond. What now?The men who wear shorts all winterMartin Wolf: in defence of democratic capitalismThe outlandish double life of an American conman in ScotlandSpain and the Hispanic World at the Royal Academy — glories of gilded ages shine againHTSIMenuSearchHomeWorldUSCompaniesTechMarketsClimateOpinionWork & CareersLife & ArtsHTSIFinancial TimesSubscribeSign InSearch the FTSearchClose search bar Vladimir Putin is losing the energy war Hear it from the experts Let our global subject matter experts broaden your perspective with timely insights and opinions you can’t find anywhere else. Subscribe to unlock this article Try unlimited access Try full digital access and see why over 1 million readers subscribe to the FTOnly $1 for 4 weeks Then $69 per month New customers only Cancel anytime during your trial Then $69 per month New customers only Cancel anytime during your trial Keep reading for $1 Purchase a Trial subscription for $1 for 4 weeks You will be billed $69 per month after the trial ends What is included in my trial? During your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages. Standard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here. Change the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section. What happens at the end of my trial? If you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for $69 per month. For cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial. You may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here. Any changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel. When can I cancel? You may change or cancel your subscription or trial at any time online. Simply log into Settings & Account and select \"Cancel\" on the right-hand side. You can still enjoy your subscription until the end of your current billing period. What forms of payment can I use? We support credit card, debit card and PayPal payments. See more details about the trial Read more about Trial Explore our subscriptions Individual Find the plan that suits you best. Digital Print Print + digital Group Premium access for businesses and educational institutions. Get Started Check if your university or organisation offers FT membership to read for free. Cookies on FT Sites We use cookies and other data for a number of reasons, such as keeping FT Sites reliable and secure, personalising content and ads, providing social media features and to analyse how our Sites are used. Accept & continue Manage cookies Useful linksSupportView Site TipsHelp CentreContact UsAbout UsAccessibilitymyFT TourCareersLegal & PrivacyTerms & ConditionsPrivacy PolicyCookiesCopyrightSlavery Statement & PoliciesServicesShare News Tips SecurelyIndividual SubscriptionsGroup SubscriptionsRepublishingExecutive Job SearchAdvertise with the FTFollow the FT on TwitterFT ChannelsSecondary SchoolsToolsPortfolioToday's Newspaper (ePaper)Alerts HubBusiness School RankingsEnterprise ToolsNews feedNewslettersCurrency ConverterCommunity & EventsFT CommunityFT Live EventsFT ForumsFT Board DirectorBoard Director ProgrammeMore from the FT GroupMarkets data delayed by at least 15 minutes. © THE FINANCIAL TIMES LTD 2023. FT and ‘Financial Times’ are trademarks of The Financial Times Ltd.The Financial Times and its journalism are subject to a self-regulation regime under the FT Editorial Code of Practice.Close drawer menuFinancial TimesInternational EditionSubscribe for full accessSearch the FTSearchSwitch to UK EditionTop sectionsHomeWorldShow more WorldGlobal EconomyUKUSChinaAfricaAsia PacificEmerging MarketsEuropeWar in UkraineAmericasMiddle East & North AfricaAustralia & NZUSShow more USUS EconomyUS CompaniesUS Politics & PolicyCompaniesShow more CompaniesEnergyFinancialsHealthIndustrialsMediaProfessional ServicesRetail & ConsumerTech SectorTelecomsTransportTechMarketsShow more MarketsAlphavilleMarkets DataCryptofinanceCapital MarketsCommoditiesCurrenciesEquitiesFund ManagementTradingMoral MoneyETF HubClimateOpinionShow more OpinionColumnistsThe FT ViewThe Big ReadLexObituariesLettersWork & CareersShow more Work & CareersBusiness School RankingsBusiness EducationEntrepreneurshipRecruitmentBusiness BooksBusiness TravelLife & ArtsShow more Life & ArtsArtsBooksFood & DrinkFT MagazineHouse & HomeStyleTravelFT GlobetrotterPersonal FinanceShow more Personal FinanceProperty & MortgagesInvestmentsPensionsTaxBanking & SavingsAdvice & CommentNext ActHTSISpecial ReportsFT recommendsLexAlphavilleLunch with the FTFT Globetrotter#techAsiaMoral MoneyFTfmNewslettersVideoPodcastsNews feedFT Live EventsFT ForumsBoard Director ProgrammemyFTPortfolioToday's Newspaper (ePaper)CrosswordOur AppsHelp CentreSubscribeSign In", "date": "Fri, 20 Jan 2023 05:01:30 GMT", "url": "https://www.ft.com/content/daf62a50-bf3d-4513-bbef-9e56cca1dcc5"}