{"title": "Border Patrol nabbed 17 people on FBI terror watch list at southern border in December | Fox News", "content": "Border Patrol nabbed 17 people on FBI terror watch list at southern border in December | Fox News Fox News U.S.PoliticsMediaOpinionBusinessEntertainmentSportsLifestyleWeatherTVFox NationListen More Expand / Collapse search Login Watch TV Menu Hot Topics Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper. Facebook Twitter Instagram RSS Email Border security Published January 21, 2023 4:23pm EST Border Patrol nabbed 17 people on FBI terror watch list at southern border in December Customs and Border Protection's latest numbers mean that here have been 38 terror watch list encounters on the border since October By Adam Shaw , Bill Melugin | Fox News Facebook Twitter Flipboard Comments Print Email close Video Who’s really in control of the southern border, according to Yuma residents Border town residents in Yuma, Arizona shared their concerns for national security as more migrants flood into the U.S. after paying the cartels for entry.Border Patrol agents stopped 17 people on the FBI’s terror watch list at the southern border in December, bringing the total of individuals arrested at the southern border to 38 already for the current fiscal year.Customs and Border Protection's (CBP) latest numbers for December, released on Friday, revealed Border Patrol has arrested 17 people at the southern border whose names match on the FBI's Terrorist Screening Database (TSDB) -- which contains information about the identities of those who are known or \"reasonably suspected\" of being involved in terrorist activities. December’s numbers bring the total number of terror watch list arrests between the ports of entry since FY 2023 began on Oct 1. to 38.There were 98 terror watch list arrests in FY22, 15 in FY21 and just three in FY 20 at the southern border caught between ports of entry.BIDEN BLAMES GOP FOR SCORING ‘POLITICAL POINTS’ ON IMMIGRATION, AS BORDER NUMBERS HIT NEW HIGH SASABE, ARIZONA - JANUARY 23: A U.S. Border Patrol agent stands on a cliff looking for migrants that crossed the border wall between the U.S. and Mexico near the city of Sasabe, Arizona, Sunday, January 23, 2022. (Photo by Salwan Georges/The Washington Post via Getty Images)At the ports of entry at the northern and southern borders, meanwhile, CBP’s Office of Field Operations has encountered 125 people on the TSDB so far this fiscal year. In FY 2022 there were 380 apprehensions, 157 in FY21 and 196 in FY20.While the numbers encountered by Border Patrol are a slim fraction of the more than 251,000 migrants encountered at the southern border in December, it has raised concerns from Republicans not only about some of the people trying to get into the U.S. -- but also how many may be slipping past overwhelmed Border Patrol agents.OVER QUARTER OF A MILLION MIGRANT ENCOUNTERS IN DECEMBER ALONE, CBP CONFIRMSCBP sources told Fox News this week that there were more than 70,000 gotaways in the month of December, similar to the number detected in November. There were nearly 600,000 in FY 2022.Republicans have pointed to the enormous numbers at the border, including gotaways, to dispute the claim by the Biden administration that the border is \"secure.\" The Biden administration, meanwhile, said this week that it is dealing with a mass migration that has \"gripped our hemisphere.\"TOP HOMELAND REPUBLICAN BLASTS ‘AFTER DARK’ BORDER NUMBERS RELEASE, PROMISES ‘TIDES ARE CHANGING’ \"The threats and the challenges we face are evolving, increasingly diverse, and dynamic. Yet we can meet this moment if and only if we work together,\" Homeland Security Secretary Alejandro Mayorkas said at the U.S. Conference of Mayors. VideoHe also said DHS was \"executing a comprehensive strategy to secure our borders and build a safe, orderly and humane immigration system working within a broken system in desperate need of legislative reform.\"However, Republicans on the House Homeland Security Committee have promised to increase scrutiny on the administration’s policies in the wake of the new numbers, and taking aim at \"this refusal to enforce law and order at the border.\" \"We look forward to having Secretary Mayorkas before the Committee soon to provide answers and accountability for the significant threat these border security policies have had on our homeland security posture,\" Chairman Mark Green said in a statement on Friday. Adam Shaw is a politics reporter for Fox News Digital, primarily covering immigration and border security.He can be reached at adam.shaw2@fox.com or on Twitter. Get the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content. Arrives Tuesdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! More from Politics 2 mins ago DOJ seizes more classified docs from Biden's Wilmington home after 12-hour search 1 hour ago AOC says Biden border policies 'replications' of Trump-era rules 2 hours ago Nancy Pelosi called priests to perform 'exorcism' after husband's hammer attack, daughter says 3 hours ago Border Patrol nabbed 17 people on FBI terror watch list at southern border in December Coronavirus U.S. CrimeMilitaryEducationTerrorImmigrationEconomyPersonal FreedomsFox News InvestigatesWorld U.N.ConflictsTerrorismDisastersGlobal EconomyEnvironmentReligionScandalsOpinion Politics ExecutiveSenateHouseJudiciaryForeign PolicyPollsElectionsEntertainment Celebrity NewsMoviesTV NewsMusic NewsStyle NewsEntertainment VideoBusiness Personal FinanceEconomyMarketsWatchlistLifestyleReal EstateTechLifestyle Food + DrinkCars + TrucksTravel + OutdoorsHouse + HomeFitness + Well-beingStyle + BeautyFamilyFaithScience ArchaeologyAir & SpacePlanet EarthWild NatureNatural ScienceDinosaursTech SecurityInnovationDronesComputersVideo GamesMilitary TechHealth CoronavirusHealthy LivingMedical ResearchMental HealthCancerHeart HealthChildren's HealthTV ShowsPersonalitiesWatch LiveFull EpisodesShow ClipsNews ClipsAbout Contact UsCareersFox Around the WorldAdvertise With UsMedia RelationsCorporate InformationCompliance Other Fox WeatherFox NationFox News ShopFox News GoFox News RadioNewslettersPodcastsApps & Products Facebook Twitter Instagram Youtube Flipboard LinkedIn Slack RSS Newsletters Spotify iHeartRadio Fox News New Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning Policy Help Contact Us Accessibility Statement This material may not be published, broadcast, rewritten, or redistributed. ©2023 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.", "date": "Sat, 21 Jan 2023 21:23:00 GMT", "url": "https://www.foxnews.com/politics/border-patrol-nabbed-17-people-fbi-terror-watch-list-southern-border-december"}