{"title": "Russia-Ukraine war at a glance: what we know on day 332 of the invasion | Ukraine | The Guardian", "content": "Russia-Ukraine war at a glance: what we know on day 332 of the invasion | Ukraine | The Guardian Skip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian content licensing siteWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentRussia-Ukraine war at a glanceUkraineRussia-Ukraine war at a glance: what we know on day 332 of the invasionRussia claims to have captured village near Bakhmut; Germany declines to take decision on supplying Ukraine with tanks See all our Russia-Ukraine war coverage A resident rides by a broken Ukrainian tank near the city of Bakhmut. Germany has declined to take a decision on supplying Kyiv with its Leopard 2 tanks. Photograph: ReutersA resident rides by a broken Ukrainian tank near the city of Bakhmut. Germany has declined to take a decision on supplying Kyiv with its Leopard 2 tanks. Photograph: ReutersGuardian staffFri 20 Jan 2023 22.02 ESTLast modified on Fri 20 Jan 2023 22.19 EST Russia claimed to have captured of a village in eastern Ukraine as part of its months-long push towards the city of Bakhmut. Russian defence ministry spokesman Igor Konashenkov said Klishchiivka, 9km south of Bakhmut, had been “liberated”. The claim could not be independently verified. Ukrainian officials made no immediate comment. Russian proxy forces in the self-proclaimed Donetsk People’s Republic earlier said they had taken control of Klishchiivka. US officials have begun to nudge the Ukrainians to shift focus away from Bakhmut and focus on preparation for an offensive in the south. Joe Biden’s administration reportedly believes there is a high potential for the Russians to eventually push Ukrainian forces out of the hotly contested city, which has seen some of the war’s most intense fighting to date. Germany’s foreign intelligence service, the BND, is also reportedly alarmed by the losses the Ukrainian army is taking in Bakhmut. Gen Mark Milley, the chairman of the US joint chiefs of staff, said he did not believe it was realistic to expect Ukraine to push Russian troops out of its internationally recognised territory in 2023. “From a military standpoint, I still maintain that from this year it would be very, very difficult to militarily eject Russian forces from every inch of Russian-occupied Ukraine,” he said at a press conference at the Ramstein US air force base in Germany. Germany has declined to take a decision on whether to give Leopard 2 tanks to Ukraine at a special international summit held at Ramstein. It had been hoped in Europe and the US that Germany would at least allow Leopards owned by countries such as Poland and Finland to be re-exported, but despite days of pleading, Berlin’s newly appointed defence minister said no final decision had been taken. Ukraine’s president, Volodymyr Zelenskiy, pleaded with Germany and western allies to send their battle tanks to Kyiv at the opening of the meeting in Ramstein. Urgent action was necessary, the Ukrainian leader said, because “Russia is concentrating its forces, last forces, trying to convince everyone that hatred can be stronger than the world”. The US defence secretary, Lloyd Austin, said the group of Kyiv-supporting defence ministers were focused on “making sure that Ukraine has the capability that it needs to be successful right now”. Speaking after the Ramstein airbase meeting, Austin described Germany as a “reliable ally”. The Kremlin said supplying additional tanks to Kyiv would not “fundamentally change anything”. Russia’s relationship with the US was at its “lowest point historically”, Kremlin spokesperson Dmitry Peskov also said, with “no hope” of bilateral relations improving “in the foreseeable future”. A former US navy Seal has been killed in Ukraine, American officials said on Friday. Daniel W Swift, a 1st class petty officer who deserted his post in San Diego in March 2019, was injured in Dnipro and died of his wounds on Wednesday. Officials said he was not fighting in an official capacity. The navy said it “cannot speculate as to why the former sailor was in Ukraine”. EU countries are reportedly working on a 10th round of Russia-related sanctions. The next package of sanctions “will be somewhere around” the anniversary of Russia’s invasion of Ukraine on 24 February, one senior diplomat told Reuters. EU officials are also seeking approval from the ministers for a seventh tranche of military aid for Ukraine worth €500m. The US will impose additional sanctions against the Wagner Group, the White House national security council spokesperson, John Kirby, has said. The US treasury department plans to designate Wagner as a significant transnational criminal organisation, which would freeze any assets the group has in the US and prohibit Americans from providing Wagner with funds, goods or services. Italian authorities are on the hunt for a Russian oligarch after two of his luxury yachts that were seized under EU sanctions mysteriously disappeared from a port in Sardinia. The yachts, belonging to Dmitry Mazepin, the billionaire owner of a mineral fertiliser company, went missing from the Sardinian port of Olbia within weeks of each other last summer. TopicsUkraineRussia-Ukraine war at a glanceEuropeRussianewsReuse this contentMore on this storyMore on this storyRussian army announces new offensive in Zaporizhzhia – as it happened7h agoGermany faces backlash over reluctance to send tanks to Ukraine8h agoZelenskiy attends memorial service for Ukraine helicopter crash victims10h agoFirst UN aid convoy reaches area close to Soledar in Ukraine1d agoUK offers qualified backing for tribunal to prosecute Russia’s leaders1d agoUkraine frustrated as Germany holds back decision on supply of tanks1d agoLeopard 2 tanks: what are they and why does Ukraine want them?1d agoPoland could send Leopard tanks to Ukraine without German approval2d agoMost viewedMost viewedWorldEuropeUSAmericasAsiaAustraliaMiddle EastAfricaInequalityGlobal developmentNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)", "date": "Sat, 21 Jan 2023 03:19:00 GMT", "url": "https://www.theguardian.com/world/2023/jan/21/russia-ukraine-war-at-a-glance-what-we-know-on-day-332-of-the-invasion"}