{"title": "Wagner Group Numbers Swell As Prigozhin Becomes Problem For Putin", "content": "Wagner Group Numbers Swell As Prigozhin Becomes Problem For Putin Sat, Jan 21, 2023LOGIN Subscribe for $1 Newsweek Search U.S.WorldTech & ScienceCultureAutosRankingsHealthLifeOpinionExpertsEducationPodcastsVantageAbout UsAnnouncementsLeadershipCEO Dev PragadArchive WorldWagner Group Numbers Swell As Prigozhin Becomes Problem For Putin By Jack Dutton On 1/20/23 at 5:27 AM EST Share Share on Facebook Share on Twitter Share on LinkedInShare on RedditShare on Flipboard Share via Email Comments World Vladimir Putin Wagner Group Ukraine Soledar Russia's shadowy mercenary collective, the Wagner Group, continues to expand to \"up to 50,000\" fighters in Ukraine, amid reports that the organization's main financier Yevgeny Prigozhin is becoming \"increasingly bold\" in his criticism of the Russian military—posing a problem for Vladimir Putin.The private mercenaries have been heavily involved in the fighting in Ukraine, and have claimed credit for the recent fall of Soledar, a strategic town in the Donetsk region, nine kilometers north of Bakhmut. Prigozhin, a billionaire oligarch who has been a long-time ally of Putin's, has used the capture of the town to discredit Russia's army.The British ministry of defense gave an update on the Wagner Group in its daily intelligence update on Friday, where it noted that the group registered as a legal entity at the end of last year, signaling its rapid expansion. Businessman Yevgeny Prigozhin shows Russian Prime Minister Vladimir Putin his school lunch factory outside St Petersburg on September 20, 2010. Since the 2022 Russian invasion of Ukraine, Prigozhin has become \"increasingly bold\" in his criticism of the Russian military—posing a problem for Vladimir Putin. AFP via Getty Images/ALEXEY DRUZHININ/ SPUTNIK \"The registration continues the remarkably rapid development of the traditionally opaque group's public profile. Prigozhin only admitted to founding Wagner in September 2022; in October 2022, it opened a glossy HQ in St Petersburg,\" the ministry said.\"Wagner almost certainly now commands up to 50,000 fighters in Ukraine and has become a key component of the Ukraine campaign. The registration likely aims to maximize Prigozhin's commercial gain and to further legitimize the increasingly high-profile organization.\"The group first appeared in Ukraine in 2014, when it participated in the annexation of Crimea. In January, reports emerged that said the Wagner Group was resorting to recruiting prisoners from Belarus to fight in Ukraine. In an assessment of the Russian offensive campaign on Thursday, the Institute for the Study of War said that Putin is likely increasingly siding with adversaries of Prigozhin and his group, in a possible effort to reduce the businessman's influence in Russia. The U.S.-based think tank noted that Putin on Wednesday met with St Petersburg Governor Alexander Beglov—\"one of Prigozhin's overt enemies\"—for the first time since March 2022, to discuss the city's role in the Ukraine war. A man wearing military camouflage stands at the entrance of the 'PMC Wagner Centre', associated with the founder of the Wagner private military group (PMC) Yevgeny Prigozhin, during the official opening of the office block on the National Unity Day, in St Petersburg, on November 4, 2022. The Institute for the Study of War recently said that Putin is likely increasingly siding with adversaries of Wagner Group founder Prigozhin. AFP via Getty Images/Olga MALTSEVA Read more Putin's critics are getting louder Former Russian commander suggests his country will \"sink\" by year's end Wagner boss says troops have \"a lot to learn\" from Ukrainian fighters Putin's Poseidon and the radioactive tidal wave of death Putin recently reappointed Colonel General Aleksandr Lapin, the former commander of the Central Military District (CMD), as the chief of staff of the Russian Ground Forces, despite Lapin being heavily criticized by the siloviki—around five million people in the country's security forces that include state security, the police, the investigative committee, and other agencies—a faction of which the Wagner Group founder is a prominent member.Prigozhin, along with another close Putin ally, the Chechen leader Ramzan Kadyrov, criticized the Russian military's new ban on soldiers having beards.Viktor Sobolev, a retired lieutenant-general and member of Russia's parliament, defended the ban on beards, personal smartphones, and tablets as an \"elementary part of military discipline,\" in an interview with RBC News on Wednesday.Prigozhin called the retired general's remarks \"absurd\" and \"archaisms from the 1960s.\"He also said \"beards are customary for many Muslim and Orthodox Christian fighters\" and personal electronic devices were necessary for \"modern warfare.\"Newsweek has contacted the Kremlin for comment. Request Reprint & Licensing, Submit Correction or view Editorial Guidelines The debate Gun Laws Have Disproportionate Impact on Black Communities | Opinion Gun Laws Have Disproportionate Impact on Black Communities | OpinionBy Jeff CharlesVS There's Nothing Racist About Gun Safety | Opinion There's Nothing Racist About Gun Safety | OpinionBy Ellis Henican Get the best of Newsweek via email CHOOSE YOUR SUBSCRIPTION PREMIUMNewsweek magazine delivered to your doorUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $9.99 DIGITAL+ Ad FreeUnlimited access to Newsweek.comAd free Newsweek.com experienceiOS and Android app accessAll newsletters + podcastsFROM $1NEWSLETTERBEST OF NEWSWEEK VIA EMAILJoin half a million readers enjoying Newsweek's free newsletters Email address Newsweek© 2023 NEWSWEEK DIGITAL LLC Editions:U.S. Edition日本PolskaRomâniaAbout UsMastheadDiversityAnnouncementsArchiveCareersCorrectionsContact UsPolicies and StandardsMission StatementAdvertiseCopyrightTerms & ConditionsPrivacy PolicyCookie PolicyTerms of SaleLeadershipCEO Dev PragadNewslettersDo Not Sell My Personal InformationGDPR Privacy Settings", "date": "Fri, 20 Jan 2023 10:27:53 GMT", "url": "https://www.newsweek.com/wagner-group-numbers-swell-prigozhin-becomes-problem-putin-1775231"}