{"title": "Church of England apologizes for treatment of LGBTQ people | AP News", "content": "Church of England apologizes for treatment of LGBTQ people | AP NewsAP NEWS Email:GoListenSectionsU.S. NewsWorld NewsPoliticsSportsEntertainmentBusinessTechnologyHealthScienceOdditiesLifestylePhotographyVideosListenSectionsAP Top NewsU.S. NewsWorld NewsAfricaAsia PacificAustraliaEuropeLatin AmericaMiddle EastPoliticsPresident BidenElection coverageCongressSupreme CourtSportsNFL PlayoffsTennisNBANHLCollege basketballMLBEntertainmentFilm ReviewsMoviesMusicTelevisionFashionBusinessU.S. economyFinancial marketsVideosTechnologyHealthCOVID-19MoreAP InvestigationsClimate and environmentOdditiesPhotographyTravelScienceAP Fact CheckLifestyleReligionPress ReleasesTrending NewsAP Top 25 MoviesNFL PlayoffsRussia-Ukraine warSearchhttps://apnews.com/article/london-england-religion-lgbtq-people-f645680c8cecd031bbcfdde9cc0c3628Click to copyhttps://apnews.com/article/london-england-religion-lgbtq-people-f645680c8cecd031bbcfdde9cc0c3628Click to copyRelated topicsAnglicanismEuropeAP Top NewsLondonEnglandReligionLGBTQ peopleChurch of England apologizes for treatment of LGBTQ peopleBy DANICA KIRKAJanuary 20, 2023 GMTLONDON (AP) — The Church of England formally apologized Friday for its treatment of LGBTQ people, even as it said that same-sex couples still won’t be allowed to marry in its churches.The apology from the church’s bishops came in a report following five years of debate on the church’s position on sexuality. The report will be delivered to the church’s national assembly, the General Synod, which is meeting in London next month.“We want to apologize for the ways in which the Church of England has treated LGBTQI+ people – both those who worship in our churches and those who do not,” the bishops said in a statement. “For the times we have rejected or excluded you, and those you love, we are deeply sorry. The occasions on which you have received a hostile and homophobic response in our churches are shameful, and for this we repent.’’Nonetheless, the Church of England’s stance that matrimony is restricted to unions between one man and one woman will remain in place. It has instead proposed offering same-sex couples the chance to have a church service with prayers of dedication, thanksgiving or for God’s blessing after they have a civil wedding or register a civil partnership.ADVERTISEMENTSame-sex marriage has been legal in England and Wales since 2013, but the church did not change its teaching when the law changed.ReligionReligious leaders sue to block Missouri's abortion banPriest still missing 6 months after leaving apartmentDora Jean Edwards, mother of Louisiana governor, dies at 87Historic Black churches receive $4M in preservation grantsChurch leaders described the decision on church services as a significant change that acknowledges the lived experience of some faithful Christians. But deep divisions remain, and the bishops acknowledged that some clergy will choose not to use the new prayers to bless the unions of same-sex couples.Among them will be Archbishop of Canterbury Justin Welby, the spiritual leader of the Anglican Church. He described the introduction of the prayers as “a moment of joy and celebration″ but said his role in the Anglican communion makes his primary task to work for unity among some 85 million members.“Because of my pastoral care and responsibility of being a focus of unity for the whole communion ... I will not personally use them in order not to compromise that pastoral care,″ he told reporters.Jayne Ozanne, a prominent campaigner for LGBTQ people in the church, expressed disappointment with the stand of the bishops, arguing that God did not discriminate — and “neither should we.″“We’ve had apology after apology after apology, and this one frankly, sounds hollow and cruel,″ Ozanne wrote on Twitter. “Because if you apologise and then carry on with the abuse, it is akin to domestic abuse. The fact that the bishops don’t see that is what angers me.”AP NEWSTop StoriesVideoContact UsAccessibility StatementCookie SettingsDownload AP NEWSConnect with the definitive source for global and local newsMore from APap.orgAP InsightsAP Definitive Source BlogAP Images SpotlightAP ExploreAP BooksAP StylebookFollow APThe Associated PressAboutContactCustomer SupportCareersTerms & ConditionsPrivacyAll contents © copyright 2023 The Associated Press. All rights reserved.", "date": "Fri, 20 Jan 2023 10:50:20 GMT", "url": "https://apnews.com/article/london-england-religion-lgbtq-people-f645680c8cecd031bbcfdde9cc0c3628"}