{"title": "Jacinda Ardern’s resignation speaks volumes about New Zealand politics - Vox", "content": "Jacinda Ardern’s resignation speaks volumes about New Zealand politics - Vox Skip to main content clock menu more-arrow no yes mobile Vox homepage Give Give Newsletters Newsletters Site search Search Search Vox main menu Even Better Recode The Goods Future Perfect The Highlight Crossword Podcasts Video Explainers Covid Culture Politics & Policy Science & Health World Technology Energy & Environment Business & Finance More Even Better Recode The Goods Future Perfect The Highlight Crossword Podcasts Video Explainers Covid Culture Politics & Policy Science & Health World Technology Energy & Environment Business & Finance ✕ Jacinda Ardern is a global icon — but she’s still a politician Ardern led New Zealand through some of its biggest crises, but the country’s political winds are shifting. By Ellen Ioanes Jan 21, 2023, 7:00am EST Share this story Share this on Facebook Share this on Twitter Share All sharing options Share All sharing options for: Jacinda Ardern is a global icon — but she’s still a politician Reddit Pocket Flipboard Email New Zealand Prime Minister Jacinda Ardern announced her resignation on January 19, 2023. Kerry Marshall/Getty Images Ellen Ioanes covers breaking and general assignment news as the weekend reporter at Vox. She previously worked at Business Insider covering the military and global conflicts. After nearly six years leading New Zealand, Jacinda Ardern’s tenure as prime minister will come to an end February 7, as her Labour Party dips in the polls and the country appears poised for a recession. It’s also the end of at least one phase of her international prominence. Ardern didn’t become famous because of New Zealand’s primacy in the international order, but rather because of who she was, and her specific responses to the national and international catastrophes that defined her tenure. She was celebrated for her leadership through a white supremacist mass shooting at two mosques in the city of Christchurch, and through the Covid-19 crisis — two moments that put her in stark contrast to bombastic, autocratic leaders like former US President Donald Trump and Brazil’s Jair Bolsonaro, in addition to making her a symbol for young women in leadership. Citing burnout after five and a half years in office, Ardern announced Thursday that she would step down prior to the end of her term and wouldn’t seek reelection. “I know there will be much discussion in the aftermath of this decision as to what the so-called ‘real’ reason was,” she told a news conference Thursday. “The only interesting angle you will find is that after going on six years of some big challenges, that I am human.” Ardern was not the first woman prime minister in New Zealand’s history, but was the youngest ever PM and gave birth while in office, pushing her further into the international spotlight as a young, feminist leader at a time — at least in many Western countries and the US in particular — when older men seemed to retain their grip on power despite social progress. But domestic politics, not international acclaim, determine a country’s leadership within a democracy, and Ardern’s Labour Party has plummeted in the polls as the economic fallout from the Covid-19 crisis sets in. New Zealand’s post-Covid economy is pointed toward a recession, and child poverty — one of Ardern’s causes — continues to rise, bringing about dissatisfaction from both the left and the right. By every conceivable metric, Ardern met the moment during the two major crises that defined her administration, and her gifts for communication, empathy, and collaboration were well-suited to those crises. She remains popular within the Labour Party and was, until recently, more popular than the overall party in public opinion polling. However, as economic circumstances change and New Zealanders are eager to move on from Covid-19, Ardern’s counterpart in the conservative National Party, Christopher Luxon, has been gaining ground in the polls, indicating that the majority Labour won in 2020 could come to an end in October, when Ardern has called for elections. Though Ardern’s announcement caught international observers by surprise, it was perhaps less of a shock to New Zealanders, Kathy Smits, a professor of politics and international relations at the University of Auckland, told Vox. “The historical example that really comes to my mind, and to a lot of people’s minds, is in Britain after the war — [Winston] Churchill was voted out in 1945. He led Britain through the war and was an incredibly popular prime minister, and yet people were ready for a change,” she said. “I think in this environment, there’s something kind of similar going on there.” Like many countries around the world, New Zealand is ready for a change Ardern rightly won international plaudits for her response to the 2019 shootings at the Al Noor mosque and Linwood Islamic Center in Christchurch, which killed 51 people. The shooter was an avowed neo-Nazi and white nationalist who used semiautomatic weapons to carry out the slaughter. Ardern immediately connected to the Muslim community and committed the government to paying funeral costs for victims. Her decisive but emotional and empathetic response projected her onto the international stage early in her leadership; her proposal shortly after the shooting to ban semiautomatic weapons, too, demonstrated her ability to act boldly in the public interest. That was in particularly stark contrast to the US which, despite consistent mass shootings, has largely failed to enact meaningful policy change, barring a bill of tailored reforms passed last year. “The thing that Jacinda is really, really great about is communication — kind of the symbolic dimensions of leadership, bringing people together. She’s really good at that,” Smits said. But as important as Ardern’s global profile is, there’s no getting around the hard facts of domestic democratic politics. Inflation continues to batter economies across the globe; in New Zealand, that’s playing out in particular in the housing market. Many New Zealanders make their income through real estate — owning and renting properties. But skyrocketing housing prices, Smits explained, combined with high interest rates, have crippled that sector of New Zealand’s economy and helped push the country toward a recession. It’s also squeezed the housing market, making affordable housing difficult for many New Zealanders to find. Ardern also failed to make significant headway on child poverty in New Zealand, which is among the highest in the Western world. “It’s really at quite shocking levels,” Smits said, particularly among Māori and Pacific populations. Though Ardern’s administration managed to decrease the percentage of children in poverty marginally during her tenure, critics argue that the government didn’t go nearly far enough, especially given that it was one of her major policy issues. Furthermore, New Zealand has a fairly low tax rate, despite that taxes or some form of income are needed to fund social programs like the kinds that would help alleviate childhood poverty. But Ardern’s party refused to implement capital gains taxes on income — with Ardern saying that such a tax hike would never occur under her leadership. Those domestic issues have made Labour vulnerable from both the right and the left; more progressive politicians and voters are disappointed with the party’s inability to make real and significant headway on social issues — in part because the government refused to take necessary measures to raise money that would support social programs, Smits said. But perhaps more than a defeat for Labour, the next elections could be more of a return to form for New Zealand’s Parliament, which operates on a mixed member proportional system. That means any one party is unlikely to get a clear, overwhelming majority of seats, requiring coalition government. And after several years of crisis within the National Party, opposition leader Christopher Luxon seems to have strengthened his party’s position sufficiently to pull in some Labour defectors, Smits said, although it’s too early to tell what the outcome of the next election will be. It’s not just New Zealand that’s ready for a change; Brazil’s Bolsonaro was ousted by former President Luiz Inacio “Lula” da Silva last year. In Italy, the far-right Giorgia Meloni replaced technocratic Prime Minister Mario Draghi last year, and in 2021 longtime German Chancellor Angela Merkel stepped down after 16 years in power. Ardern’s impact is significant and will likely outweigh her government’s inadequacies Western feminists have embraced Ardern, and rightly so, as a politician who balances power with compassion; a woman who had a baby while also guiding her country through some of the most challenging years in recent memory. Leaders like Hillary Clinton, World Health Organization Director-General Tedros Adhanom Ghebreyesus, and former Australian Prime Minister Julia Gillard tweeted in support of Ardern and the impact of her time in office, with Gillard saying, “Her example has been a shining light to many, especially women.” .@jacindaardern showed the world a new style of leadership by deciding to foreground kindness and empathy. Her example has been a shining light to many, especially women. I congratulate her on all she has achieved to date and wish her well in this next phase of her life.— Julia Gillard (@JuliaGillard) January 19, 2023 Ardern’s symbolic impact, in addition to her leadership, will likely be a major part of her legacy. Ardern took her child, Neve, to a United Nations General Assembly meeting in 2018, when she was just three months old — making history in the process. She was the first elected leader to give birth in office since Benazir Bhutto did the same in 1990, and only the second ever to do so. Ardern’s style, too, is a marked shift not only from the machismo of autocratic leaders like Trump and Bolsonaro, but the often-combative nature of politics generally, as Richard Shaw, a politics professor at Massey University in New Zealand, told NBC Thursday. “I think what she offered to the world actually was a model for doing democratic politics that does not rely upon abusing other people,” Shaw said. “She never uses the term ‘enemy’ to describe anybody.” Though it’s probably not the driving force behind her resignation, Shaw said, that particular leadership style had also fixated “the political right, and the misogynists in particular, and the anti-vaxxers and the fringe dwellers in our political community” on Ardern. It’s impossible to know just what Ardern’s legacy will be, but her power as a symbol not just of a successful leader — who is also a woman and a mother — had arguably the same effect as former President Barack Obama’s election as America’s first Black president. Both set a new standard for progress, even if their domestic policies didn’t live up to progressive ideals. But more than just the fact of her being a woman, a mother, and a world leader, she presented a compelling model of how leaders could behave and make decisions, even difficult ones, with clarity and compassion. Will you support Vox’s explanatory journalism? Millions turn to Vox to educate themselves, their family, and their friends about what’s happening in the world around them, and to learn about things that spark their curiosity. Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all. Please consider making a one-time contribution to Vox today. One-Time Monthly Annual $95/year $120/year $250/year Other $ Yes, I'll give $120/year Yes, I'll give $120/year We accept credit card, Apple Pay, and Google Pay. You can also contribute via Next Up In World Most Read Why we all need subtitles now The “zombie” fungus in The Last of Us, explained by a biologist Jacinda Ardern is a global icon — but she’s still a politician 5 myths about gas stoves, the latest culture war clash Were bivalent boosters worth it? vox-mark Sign up for the newsletter Future Perfect Each week, we explore unique solutions to some of the world's biggest problems. Thanks for signing up! Check your inbox for a welcome email. Email (required) Oops. Something went wrong. Please enter a valid email and try again. By submitting your email, you agree to our Terms and Privacy Notice. You can opt out at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. For more newsletters, check out our newsletters page. Subscribe The Latest Dobbs didn’t end the anti-abortion movement By Ellen Ioanes The “zombie” fungus in The Last of Us, explained by a biologist By Benji Jones Play Why we all need subtitles now By Edward Vega 5 myths about gas stoves, the latest culture war clash By Rebecca Leber What it means to be a “good” Real Housewife By Alex Abad-Santos Were bivalent boosters worth it? By Keren Landman Chorus Terms of Use Privacy Notice Cookie Policy Do Not Sell or Share My Personal Info Licensing FAQ Accessibility Platform Status Contact Send Us a Tip Masthead About Us Press Room Editorial Ethics and Guidelines Vox MediaVox Media Vox Media logo. Author Login Advertise with us Jobs @ Vox Media © 2023 Vox Media, LLC. All Rights Reserved", "date": "Sat, 21 Jan 2023 12:00:00 GMT", "url": "https://www.vox.com/world/2023/1/21/23562489/jacinda-ardern-new-zealand-prime-minister-resign"}