{"title": "London, Scotland head for showdown as gender debate rages | Gender Equity News | Al Jazeera", "content": "London, Scotland head for showdown as gender debate rages | Gender Equity News | Al Jazeera Skip linksSkip to Contentplay Live Show navigation menuNavigation menuNewsShow more news sectionsMiddle EastAfricaAsiaUS & CanadaLatin AmericaEuropeAsia PacificUkraine warFeaturesEconomyOpinionVideoMoreShow more sectionsCoronavirusClimate CrisisInvestigationsInteractivesIn PicturesScience & TechnologySportsPodcastsplay Live Click here to searchsearchREPORTER'S NOTEBOOKNews|Gender EquityLondon, Scotland head for showdown as gender debate ragesIn an unprecedented move, London has used its powers to block Scotland’s gender reform bill.Transgender rights supporters protest in favour of Scottish gender reform bill outside Downing Street in London [Henry Nicholls/Reuters]By Sonia GallegoPublished On 20 Jan 202320 Jan 2023facebooktwitterwhatsappLondon, United Kingdom – What is a Woman? Wasn’t this question already settled? Didn’t the fight for women’s equality end with protections being enshrined in law, in the case of the UK, in the 2010 Equality Act that covers women’s sex-based protections? Apparently not. This week, the UK has witnessed an explosion of the issue, all over again. On Monday, the UK government triggered a Section 35 order to prevent Scotland’s Gender Recognition Reform (GRR) Bill from reaching royal assent and passing into law. It was the first time in Scotland’s devolved history that such a block has been used to prevent a law, so a historic moment in Scotland-UK relations. The UK’s Scotland Secretary, Alister Jack, said he did not take the decision “lightly” and claimed the bill would have a significant effect on “equalities matters” in Scotland, England and Wales. “This is the necessary and correct course of action,” he said. This is a full-frontal attack on our democratically elected Scottish Parliament and it's ability to make it's own decisions on devolved matters. @scotgov will defend the legislation & stand up for Scotland’s Parliament. If this Westminster veto succeeds, it will be first of many https://t.co/3WXrjyivvC — Nicola Sturgeon (@NicolaSturgeon) January 16, 2023 Scottish First Minister Nicola Sturgeon described the order as “a full-frontal attack” on the Scottish Parliament and pledged to challenge the decision in the courts. Yet according to legal experts, even those who are sympathetic to the changes the GRR bill would bring, Sturgeon does not have a strong case. Put simply, the issue of gender – a social construct built from sex stereotypes that has no biological markers – is a devolved matter and the power to legislate on that rests in Edinburgh. But the issue of equality and balancing that along with all the other protected characteristics resides in Westminster. The 2010 Equality Act is a UK-wide legislation. It covers the protection of the following characteristics: age, disability, gender reassignment, marriage and civil partnership, pregnancy and maternity, race, religion or belief, sex and sexual orientation. According to the act, a person’s legal sex is their biological sex as recorded at birth. A person who obtains a gender recognition certificate (GRC) can change their birth certificate, get married or have a civil partnership certificate in their affirmed gender. It also ensures that the affirmed gender is recorded in death certificates. It does not change the legal status of being a mother or father of a child and it is not needed to change sex markers on passports, driving licences, medical records or any other documents. In the UK, to obtain a GRC, you need to be above 18 years of age, have a medical diagnosis of gender dysphoria, and have lived in the affirmed gender for two years. Transgender rights supporters protest in favour of Scottish gender reform bill outside Downing Street in London, January 17, 2023 [File: Henry Nicholls/Reuters] The GRC costs $6 and those who want one do not need to have undergone any gender affirmation medical procedures, but they need to swear an oath to commit to remaining in their acquired gender for life. In other words, it could be a male with a medical diagnosis of gender dysphoria but has had no surgery – so their body is as any other male who does not have gender dysphoria. The Scottish government has argued that this process is too difficult and dehumanising. The GRR bill, which passed in the Scottish Parliament in Holyrood last month, states that a medical diagnosis of gender dysphoria would no longer be needed. Anyone applying would only need to have been living in their “acquired gender” – which does not appear to have a definitive meaning in official documents – for three months. And people aged 16 and above could apply, with the proviso that 16-18-year-olds would have a further three months of reflection. Critics say members of the Scottish Parliament (MSP) spent considerable time on the bill but failed to meaningfully engage women’s groups, religious communities and organisations that deal with issues of domestic abuse whose victims are, overwhelmingly, women. For Women Scotland, a grassroots group, maintains that the process was skewed from the offset and that last-minute consultations with women’s groups were too late to have any effect on decisions regarding the content of the bill. Even representatives of the United Nations are divided on the matter. The UN’s expert on gender identity, Victor Madrigal-Borloz, said the bill would bring Scotland in line with UN guidelines on gender. Yet the UN’s special rapporteur on violence against women and girls, Reem Alsalem, said the bill would “potentially open the door for violent males who identify as men to abuse the process of acquiring a gender certificate and the rights that are associated with it”. During the debate, amendments were tabled for provisions to be put in place to protect women in prisons, women seeking intimate care, ensuring single-sex wards in hospitals, and preventing sexual offenders from acquiring a GRC. All were voted down and that caused consternation. The fact of the matter remains that in removing a medical diagnosis of gender dysphoria, it becomes open to anyone who, for any reason, wishes to change their identity and sex markers on their birth certificate. “’Transgender’ is not mentioned anywhere on the face of this bill,” says Susan Smith, one of the founders of For Women Scotland. “Simplifying a process would mean making it easier for its own cohort of people to use that process. But what they have done is to open it up for anybody. “We know how many hundreds of sex offenders disappear every year because they change their name – this is one step further … and we keep being told in all the debates that we’re awful for raising this, because trans people are not sex offenders. “Fine. If they’re not, then it would hurt nobody to ensure explicitly that sex offenders would not be able to apply for these [GRCs] because if trans people are not sex offenders, then no sex offenders would be applying for these.” Getting clear answers to this dilemma requires looking at the data. Next week, @ScotParl will vote on the #GRRBill.I've sent the Government evidence of the UN's longstanding position that legal recognition of gender identity is a human right & self-identification is the appropriate standard for it.Read the legal opinion: https://t.co/1O0B6iM9wN pic.twitter.com/i3tDEg8KlQ — IE SOGI, Victor Madrigal-Borloz (@victor_madrigal) December 16, 2022 According to the UK’s Ministry of Justice, sex offenders are over-represented in the category of transwomen. Figures show that in prisons, the sex-offending rate for women is just more than 3 percent. For men, it is close to 17 percent. In the category of transwomen, that rate reaches nearly 60 percent. I, for one, do not believe that a person who has a debilitating condition that leads them to think they are in the wrong-sexed body is naturally inclined to commit sex offences. What I think is the more probable explanation is that sex offenders are assuming a trans identity to move to the female state or for any other reason known only to them. And importantly, while the Scottish government says the Section 35 order goes against the will of the Scottish Parliament, public polling on the bill suggests that Holyrood is going against Scottish public opinion. Sixty percent of people polled disagreed that the diagnosis of gender dysphoria should be removed to obtain a GRC, even among those who are pro-independence. The language used by the government is also very telling, as they have not invoked the will of the Scottish people but the Scottish Parliament. By pursuing this issue, Sturgeon is playing a tricky game which may affect her popularity. The constitutional aspect of this debate has just begun, but the arguments at the root of it have been raging for the past few years. Critics insist that if women’s legal sex includes males who have a certificate, it amounts to the erasure of women in law. Only one thing is certain. The debate is set to rage on. Source: Al JazeeraAboutShow moreAbout UsCode of EthicsTerms and ConditionsEU/EEA Regulatory NoticePrivacy PolicyCookie PolicyCookie PreferencesSitemapCommunity GuidelinesWork for usHR QualityConnectShow moreContact UsAdvertise with usAppsChannel FinderTV SchedulePodcastsSubmit a TipOur ChannelsShow moreAl Jazeera ArabicAl Jazeera EnglishAl Jazeera Investigative UnitAl Jazeera MubasherAl Jazeera DocumentaryAl Jazeera BalkansAJ+Our NetworkShow moreAl Jazeera Centre for StudiesAl Jazeera Media InstituteLearn ArabicAl Jazeera Centre for Public Liberties & Human RightsAl Jazeera ForumAl Jazeera Hotel PartnersFollow Al Jazeera English:facebooktwitteryoutubeinstagram-colored-outlinerss© 2023 Al Jazeera Media Network", "date": "Fri, 20 Jan 2023 11:56:27 GMT", "url": "https://www.aljazeera.com/news/2023/1/20/scotlands-gender-reform-bill-ignites-debate-on-women"}