{"title": "Protests in Stockholm, including Koran-burning, draw condemnation from Turkey | Reuters", "content": "Protests in Stockholm, including Koran-burning, draw condemnation from Turkey | Reuters Skip to main contentReuters homeWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsMoreMy ViewRegisterWorld4 minute readJanuary 22, 202312:17 AM UTCLast Updated agoProtests in Stockholm, including Koran-burning, draw condemnation from TurkeyReutersSTOCKHOLM, Jan 21 (Reuters) - Protests in Stockholm on Saturday against Turkey and Sweden's bid to join NATO, including the burning of a copy of the Koran, sharply heightened tensions with Turkey at a time when the Nordic country needs Ankara's backing to gain entry to the military alliance.\"We condemn in the strongest possible terms the vile attack on our holy book ... Permitting this anti-Islam act, which targets Muslims and insults our sacred values, under the guise of freedom of expression is completely unacceptable,\" the Turkish Foreign Ministry said.Its statement was issued after an anti-immigrant politician from the far-right fringe burned a copy of the Koran near the Turkish Embassy. The Turkish ministry urged Sweden to take necessary actions against the perpetrators and invited all countries to take concrete steps against Islamophobia.A separate protest took place in the city supporting Kurds and against Sweden's bid to join NATO. A group of pro-Turkish demonstrators also held a rally outside the embassy. All three events had police permits.Swedish Foreign Minister Tobias Billstrom said that Islamophobic provocations were appalling.\"Sweden has a far-reaching freedom of expression, but it does not imply that the Swedish Government, or myself, support the opinions expressed,\" Billstrom said on Twitter.The Koran-burning was carried out by Rasmus Paludan, leader of Danish far-right political party Hard Line. Paludan, who also has Swedish citizenship, has held a number of demonstrations in the past where he has burned the Koran.Paludan could not immediately be reached by email for a comment. In the permit he obtained from police, it says his protest was held against Islam and what it called Turkish President Tayyip Erdogan's attempt to influence freedom of expression in Sweden.Several Arab countries including Saudi Arabia, Jordan and Kuwait denounced the Koran-burning. \"Saudi Arabia calls for spreading the values of dialogue, tolerance, and coexistence, and rejects hatred and extremism,\" the Saudi Foreign Ministry said in a statement.Sweden and Finland applied last year to join NATO following Russia's invasion of Ukraine but all 30 member states must approve their bids. Turkey has said Sweden in particular must first take a clearer stance against what it sees as terrorists, mainly Kurdish militants and a group it blames for a 2016 coup attempt.[1/7] A demonstration against Turkish President Recep Tayyip Erdogan and Sweden?s NATO bid, arranged by the Kurdish Democratic Society Center at Norra Bantorget in Stockholm, Sweden, January 21, 2023. Christine Olsson/TT News Agency/via REUTERS 12345At the demonstration to protest Sweden's NATO bid and to show support for Kurds, speakers stood in front of a large red banner reading \"We are all PKK\", referring to the Kurdistan Workers Party that is outlawed in Turkey, Sweden, and the United States among other countries, and addressed several hundred pro-Kurdish and left-wing supporters.\"We will continue our opposition to the Swedish NATO application,\" Thomas Pettersson, spokesperson for Alliance Against NATO and one of organizers of the demonstration, told Reuters.Police said the situation was calm at all three demonstrations.In Istanbul, people in a group of around 200 protesters set fire to a Swedish flag in front of the Swedish consulate in response to the burning of the Koran.SWEDISH MINISTER'S VISIT CANCELLEDEarlier on Saturday, Turkey said that due to lack of measures to restrict protests, it had cancelled a planned visit to Ankara by the Swedish defence minister.Jonson said separately that he and Akar had met on Friday during a gathering of Western allies in Germany and had decided to postpone the planned meeting.Turkish Defence Minister Hulusi Akar said he had discussed with Erdogan the lack of measures to restrict protests in Sweden against Turkey and had conveyed Ankara's reaction to Jonson on the sidelines of a meeting of the Ukraine Defence Contact Group.\"It is unacceptable not to make a move or react to these (protests). The necessary things needed to be done, measures should have been taken,\" Akar said, according to a statement by Turkish Defence Ministry.Turkey's Foreign Ministry had already summoned Sweden's ambassador on Friday over the planned protests.Finland and Sweden signed a three-way agreement with Turkey in 2022 aimed at overcoming Ankara's objections to their membership of NATO. Sweden says it has fulfilled its part of the memorandum but Turkey is demanding more, including the extradition of 130 people it deems to be terrorists.Reporting by Omer Berberoglu, Ezgi Erkoyun and Bulent Usta in Istanbul and Niklas Pollard and Simon Johnson in Stockholm Additional reporting by Moaz Abd-Alaziz in Cairo Writing by Ezgi Erkoyun and Niklas Pollard Editing by Toby Chopra and Frances KerryOur Standards: The Thomson Reuters Trust Principles.Read NextEuropecategoryWagner Group to send Kyiv bodies of soldiers killed in Soledar, report says, article with imageJanuary 21, 2023VideoEuropecategoryThousands join rightist rally against Spanish government, article with videoJanuary 21, 2023GalleryAmericascategoryPeru arrests 200 in Lima; Machu Picchu ordered closed as protests flare, article with gallery12:14 AM UTC . Updated undefined agoAfricacategoryU.S. military says Somalia strike killed 30 al Shabaab fighters, article with imageJanuary 21, 2023WorldVenezuela releases ex-interior minister from prison; he will go to Spain, article with imageWorldcategory · January 21, 2023A Venezuelan court on Saturday released former Interior Minister Miguel Rodriguez Torres from jail after he was imprisoned for nearly five years, allowing him to travel to Spain, relatives of the former official said.United KingdomcategoryCoronation of Britain's King Charles to be celebrated with street parties, light shows, article with imageJanuary 21, 2023Africacategory(OFFICIAL) Treasury's Yellen breaks ground on rural electrification project in Senegal, article with imageJanuary 21, 2023EuropecategoryNew German defence minister to travel to Ukraine soon, Bild am Sonntag reports, article with imageJanuary 21, 2023GalleryAmericascategoryColombia, ELN rebels to resume peace talks in Mexico in February, article with galleryJanuary 21, 2023Site IndexBrowseWorldBusinessLegalMarketsBreakingviewsTechnologyInvestigationsOpen in new tab, opens new tabLifestyleAbout ReutersAbout ReutersOpen in new tab, opens new tabCareersOpen in new tab, opens new tabReuters News AgencyOpen in new tab, opens new tabBrand Attribution GuidelinesOpen in new tab, opens new tabReuters LeadershipOpen in new tab, opens new tabReuters Fact CheckOpen in new tab, opens new tabReuters Diversity ReportOpen in new tab, opens new tabStay InformedDownload the AppOpen in new tab, opens new tabNewslettersOpen in new tab, opens new tabInformation you can trustReuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.Follow UsThomson Reuters ProductsWestlawOpen in new tab, opens new tabBuild the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology.OnesourceOpen in new tab, opens new tabThe most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs.CheckpointOpen in new tab, opens new tabThe industry leader for online information for tax, accounting and finance professionals.Refinitiv ProductsRefinitiv WorkspaceOpen in new tab, opens new tab Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile.Refinitiv Data CatalogueOpen in new tab, opens new tab Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.Refinitiv World-CheckOpen in new tab, opens new tabScreen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.Advertise With UsOpen in new tab, opens new tabAdvertising GuidelinesOpen in new tab, opens new tabCookiesOpen in new tab, opens new tabTerms of UseOpen in new tab, opens new tabPrivacyOpen in new tab, opens new tabDigital AccessibilityOpen in new tab, opens new tabCorrectionsOpen in new tab, opens new tabSite FeedbackOpen in new tab, opens new tabAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2022 Reuters. All rights reserved", "date": "Sun, 22 Jan 2023 00:17:00 GMT", "url": "https://www.reuters.com/world/turkey-cancels-swedish-defence-minister-visit-after-protest-permit-2023-01-21/"}