{"title": "Scholz, Macron seek to reset fraught relations with big celebration – POLITICO", "content": "Scholz, Macron seek to reset fraught relations with big celebration – POLITICO Sunday, January 22, 2023 POLITICO Live About POLITICO Live Upcoming Events More Info About Us Media Solutions Content Studio Press Print Edition Contact Us Jobs Careers at POLITICO Primary Menu Politico Pro Sign up to newsletters Sign In Search for: Submit Politico Pro Explore Newsletters & podcasts Featured Sections Brussels France Germany Britain Coronavirus in Europe Migration Elections in Europe Defense Foreign Policy Poll of Polls Continent EU-China EU Recovery Plan Italian election 2022 Special Reports Policy Areas Agriculture and Food Competition and Industrial Policy Cybersecurity and Data Protection Energy and Climate EU-UK Financial Services Health Care Mobility Sustainability Technology Trade Trade UK Featured Series POLITICO 28 Series Global Policy Lab Climate, Changed Work Reloaded Silent Killers After Corona The Road to COP26 Telescope: AIDS EU in Africa Changemakers The wonk's survival guide to the EU Green Deal Commentary Unpacked Beyond The Bubble From Across the Pond Club Med Declassified POLITICO Live See all future events See all past events About POLITICO Live Editions EU Edition U.K. Edition U.S. Edition Publications Print Edition Newsletters Brussels Playbook London Playbook Playbook Paris Davos Playbook Sunday Crunch Berlin Bulletin London Influence EU Influence Digital Bridge China Direct Politico Confidential Global Policy Lab: Living Cities Podcasts EU Confidential Westminster Insider Campaign Confidential Davos Confidential our apps Play Store App Store Social Links Facebook Twitter LinkedIn Discover POLITICO Pro In-depth reporting, data and actionable intelligence for policy professionals – all in one place. What is POLITICO Pro? Policy areas Our Pro coverage Request a demo Contact us Hot Topics Davos Qatargate War in Ukraine France Living Cities POLITICO 28 Scholz, Macron seek to reset fraught relations with big celebration Despite planned show of unity in Paris, disagreements still dog Franco-German relationship. French President Emmanuel Macron and German Chancellor Olaf Scholz | Ludovic Marin/AFP via Getty images By Clea Caulcutt and Hans von der Burchard January 21, 2023 12:15 pm CET 6 minutes read Share on Facebook Share on Twitter Share on Linkedin Share on WhatsApp Mail Print Press play to listen to this article Voiced by artificial intelligence. PARIS/BERLIN — German Chancellor Olaf Scholz and French President Emmanuel Macron will aim to reboot their problematic relations with a big ceremony on Sunday as shared frustration over a new U.S. law helps them overcome differences. Paris and Berlin have been at odds in recent months over defense, energy and finances, as well as Scholz’s controversial €200 billion package for energy price relief, which was announced last fall without previously involving the French government. These tensions culminated in Macron snubbing Scholz by canceling, in an unprecedented manner, a planned press conference with the German leader in October. Sunday’s Franco-German summit, which unites both cabinets as well as a group of parliamentarians from both countries in Paris, comes also amid growing pressure from Kyiv to provide Ukrainian forces with the means to fight back against Russia’s aggression. The Ukrainians want tanks, in particular Germany’s Leopard 2 tanks, but they have also called on France to send Leclerc tanks. “There are some major challenges in the defense and security sector, especially when it comes to the question of how we can reduce dependency on the United States,” said Anton Hofreiter, the chair of the German parliament’s European Affairs Committee. You may like Time to join NATO? Moldova eyes joining ‘a larger alliance’ By Suzanne Lynch America in decline? World thinks again By Matthew Kaminski Macron proposes major boost to French defense spending amid Ukraine war By Clea Caulcutt Yet, the politician from the Greens, one of the coalition partners of Scholz’s Social Democrats, also emphasized that Paris and Berlin had increasingly found common ground in recent months when it comes to responding to the U.S.’s multibillion-dollar green subsidy package that has raised fears of siphoning off investment from Europe. After having publicly fallen out last October, Scholz and Macron agreed on the need to respond to America’s Inflation Reduction Act (IRA) by pushing for more subsidies for EU industries and loosening state aid rules. “I see the cooperation with France as a great chance,” Hofreiter said. The gathering on Sunday takes place exactly 60 years after the signature of the Elysée treaty that Germany’s Konrad Adenauer and France’s Charles de Gaulle signed in 1962 to seal the reconciliation between the two countries after World War II. Macron and Scholz will make speeches at the Sorbonne University in front of several hundred MPs, before holding a joint cabinet meeting at the Elysée Palace. Patching up The disagreements between Paris and Berlin in recent months also appeared compounded by the obvious lack of personal affinity between the two leaders, in contrast to the public demonstrations of affection between Macron and Scholz’s predecessor, Angela Merkel. “They don’t have the same temperament, nor the same history. They need to tame each,” said a French government adviser after a meeting late last year. But “the more they see each other, the better they understand each other,” he added. Ahead of Sunday’s summit, an Elysée Palace official indicated relations had improved between Scholz and Macron. “We were able to use the [time] to work on our big goals, to achieve the best possible impetus, particularly on the European stage. So I think we are there now,” said the official in a briefing with the press. French President Emmanuel Macron meets with German Chancellor Olaf Scholz | Ludovic Marin/AFP via Getty images Chantal Kopf, a German Green lawmaker dealing closely with Franco-German relations noted that Sunday’s celebration comes just a few days after France signed an extensive partnership deal with its southern neighbor, Spain, which copies many elements of the Franco-German treaty. “This should be seen by us as a clear signal that France wants more and closer cooperation and is also looking for other partners to take a leading role in Europe,” Kopf said. She also had a poke at Scholz’s ruling coalition of Social Democrats, Greens and Free Democrats, which often takes a long time to decide joint positions. “We as the German government must also act with more clarity and unity in decisions at the European level, in order to be able to coordinate with our closest partner France in good time,” Kopf said. France has been seeking to convince its neighbor to back its plans for a robust response to the U.S.’s IRA and support the creation of a sovereign fund and the loosening of EU rules on government subsidies. In a non-paper submitted to the European Commission, France called for the EU to forge ahead with a “robust and rapid” Made in Europe strategy. While Scholz and Macron both want the EU to temporarily relax state subsidy rules to allow faster investments in strategic areas, France also wants the creation of an EU sovereign fund to finance investments across the Continent. The fund would be partially financed with money from existing programs. However Berlin fears this would open the door to contracting more EU debt, which it firmly opposes. In the last days ahead of the summit, officials were still striving to get both parties to agree on the wording of their joint statement. But a senior German official struck an optimistic tone ahead of Sunday: “I firmly believe that we will find very good results that will create a strong momentum,” he said. Sunday vibe But some last-minute difficulties may mar Macron’s staging of the rekindling of the Franco-German friendship. Though the Elysée Palace has announced that 300 German and French MPs would gather to listen to the leaders at the Sorbonne, the tally wasn’t quite there on Friday. While over 120 German lawmakers have traveled to Paris to attend the meeting, only 71 French MPs have said they will turn up, according to a National Assembly roll call. “It’s on a Sunday, which is a pain for both the French and the Germans, but it is also a season when [French] lawmakers tend to attend local new year’s ceremonies in their constituencies,” said a French official working at the National Assembly. “So we are doing the rounds and drumming up support,” he added. If confirmed, the lack of enthusiasm from French MPs would be an embarrassment for the French government, after Paris signaled its disapproval in October when they learned that several German ministers were planning to skip a planned joint cabinet meeting. For the 55th anniversary of the Elysée treaty, France also put up a poor showing compared to Germany. The French National Assembly was three-quarters empty for the celebrations, while the French were welcomed by Merkel and a full house in Berlin. More from ... Clea Caulcutt and Hans von der Burchard Related Content Germany snubs Ukraine’s tank request Judge sanctions Trump, lawyer nearly $1M for ‘completely frivolous’ Clinton suit US cable: Russian paramilitary group set to get cash infusion from expanded African mine From Davos: Tanks to Ukraine — Irish PM Leo Varadkar — EU-US trade fight Let’s not make it official: NATO allies reluctant to increase spending goals Careers at POLITICO Journaliste politique, Paris Location: Paris | Department: Editorial HR Trainee, Learning & Development Location: Brussels | Department: Internships Strategy and Operations Associate Location: Brussels | Department: Corp & Exec All job postings Careers at POLITICO View the Latest Issue Read the latest print issue online Next up RT France to shut down after accounts frozen January 21, 2023 8:22 pm CET By Laura Kayali ‘We need action’: Time runs out for Ukraine as allied countries debate sending tanks January 21, 2023 1:38 pm CET By Paul McLeary and Lili Bayer White House sets additional sanctions against Russia’s Wagner Group January 21, 2023 11:59 am CET By Kelly Hooper World’s cartoonists on this week’s events January 21, 2023 4:00 am CET By POLITICO Related Tags Debt Defense Energy Energy prices Finance and banking French politics German politics Inflation Investment Security State aid Subsidies War in Ukraine Related Countries France Germany Spain Ukraine United States Related People Angela Merkel Emmanuel Macron Olaf Scholz Explore politico EU Brussels Latest news, analysis and comment from POLITICO’s editors and guest writers in Europe. Germany Latest news, analysis and comment on German politics and beyond. France Latest news, analysis and comment on French politics and beyond. Elections in Europe Latest news, analysis and comment on elections in Europe and beyond. Coronavirus in Europe The latest news, data and analysis on the world’s pandemic response. Migration Latest news, analysis and comment on migration in Europe and beyond. Defense Latest news, analysis and comment on defense in Europe and beyond. Continent Latest news, analysis and comment from POLITICO’s editors and guest writers on the continent. Policy Areas Agriculture and Food Competition and Industrial Policy Cybersecurity and Data Protection Health Care Energy and Climate EU-UK Financial Services Mobility Sustainability Technology Trade Trade UK Newsletters Brussels Playbook Playbook Paris London Playbook Davos Playbook Sunday Crunch Politico Confidential London Influence EU Influence Global Policy Lab: Living Cities Berlin Bulletin Digital Bridge China Direct Explore Products Series POLITICO 28 Series Global Policy Lab Climate, Changed Work Reloaded Silent Killers After Corona The Road to COP26 Telescope: AIDS EU in Africa Changemakers The wonk's survival guide to the EU Green Deal Commentary Unpacked Beyond the Bubble From Across the Pond Club Med Declassified Podcasts EU Confidential Westminster Insider Davos Confidential Campaign Confidential our apps Play Store App Store Print Edition POLITICO Live Explore the live extension of our journalism Discover POLITICO Pro In-depth reporting, data and actionable intelligence for policy professionals – all in one place. Politico Logo About us Contact us Privacy Policy Cookie Policy Media Solutions Press Print Edition Jobs Careers at POLITICO Ts&Cs FAQs Close login modal Log in Log in to access content and manage your profile. If you do not have an account you can register here. Email address Password Forgot your password? Remember me Log in By logging in, you confirm acceptance of our POLITICO Privacy Policy. Privacy", "date": "Sat, 21 Jan 2023 11:15:00 GMT", "url": "https://www.politico.eu/article/german-chancellor-olaf-scholz-and-french-president-emmanuel-macron-seek-to-reset-fraught-relationship-with-big-celebration-defense-energy-finance/"}