{"title": "NATO, Ukraine, Congress: Complex issues roil U.S.-Turkey relations - Los Angeles Times", "content": "NATO, Ukraine, Congress: Complex issues roil U.S.-Turkey relations - Los Angeles Times Business California Climate & Environment Entertainment & Arts En Español Food Housing & Homelessness Image Lifestyle Obituaries Opinion Politics Science Sports Travel & Experiences World & Nation All Sections _________________ Newsletters Photography Podcasts Video _________________ About Us About Us Archives Company News eNewspaper For the Record Got a Tip? L.A. Times Careers L.A. Times Store LA Times Studios News App: Apple IOS News App: Google Play Newsroom Directory Public Affairs Rights, Clearance & Permissions Short Docs About Us Archives Company News eNewspaper For the Record Got a Tip? L.A. Times Careers L.A. Times Store LA Times Studios News App: Apple IOS News App: Google Play Newsroom Directory Public Affairs Rights, Clearance & Permissions Short Docs Advertising Place an Ad Classifieds Coupons People on the Move Find/Post Jobs Local Ads Marketplace Media Kit: Why the L.A. Times? Hot Property Sections Place an Open House Sotheby’s International Realty Place an Ad Classifieds Coupons People on the Move Find/Post Jobs Local Ads Marketplace Media Kit: Why the L.A. Times? Hot Property Sections Place an Open House Sotheby’s International Realty Bestcovery B2B Publishing Business Visionaries Hot Property Crossword & Games L.A. Times Events L.A. Times Store Subscriptions Manage Subscription EZPAY Delivery Issue eNewspaper Students & Educators Subscribe Subscriber Terms Gift Subscription Terms Manage Subscription EZPAY Delivery Issue eNewspaper Students & Educators Subscribe Subscriber Terms Gift Subscription Terms Special Supplements Best of the Southland Healthy Living Las Vegas Guide Best of the Southland Healthy Living Las Vegas Guide Copyright © 2023, Los Angeles Times | Terms of Service | Privacy Policy | CA Notice of Collection | Do Not Sell or Share My Personal Information Sections California Entertainment Sports Food Climate Image Opinion | Bestcovery Coupons Crossword eNewspaper Show SearchSearch Query Submit Search Advertisement Politics Fighter jets, NATO, Congress and Ukraine: Complex issues roil U.S.-Turkey relations Diplomatic teams led by U.S. Secretary of State Antony J. Blinken, center left, and Turkish Foreign Minister Mevlut Cavusoglu, across from him, meet at the State Department in Washington on Jan. 18. (Leah Millis / Associated Press) By Tracy WilkinsonStaff Writer Jan. 20, 2023 5 AM PT FacebookTwitterShow more sharing optionsShareClose extra sharing options Facebook Twitter LinkedIn Email Copy Link URLCopied!Print WASHINGTON — The United States is locked in a delicate dance with Turkey, one of its most problematic allies, that involves fighter jets, the North Atlantic Treaty Organization, Congress and, ultimately, the war in Ukraine.Turkish Foreign Minister Mevlut Cavusoglu, in Washington this week to meet with U.S. officials, wasted no time in putting front and center his nation’s demand for U.S.-made F-16 warplanes.“We will address significant topics about bilateral defense cooperation, particularly our F-16 request,” Cavusoglu said ahead of the meetings, as Secretary of State Antony J. Blinken looked on, stone-faced. “This is not only for [Turkey] but also important for NATO and for United States as well, so we expect the approval in the line with our joint strategic interest.”AdvertisementAdministration officials last week issued an “informal notification” to Congress that a $20-billion sale of F-16s to Turkey was in the works. But the idea that approval for such a sale might be forthcoming is not widely shared at the State Department and the White House.Powerful U.S. lawmakers are blocking new arms sales to Turkey, citing the government of President Recep Tayyip Erdogan and its increasingly authoritarian turn away from democracy, its repression of dissidents and minorities, and its menacing of neighbors.But Turkey can block something that the U.S. and most of the West dearly want: the expansion of NATO to include Sweden and Finland.As a member of NATO, Turkey has veto power over allowing new countries to join. The 30-nation alliance has to approve any such expansion unanimously.Long neutral, Sweden and Finland began to see NATO protection as urgent following Russia’s invasion of Ukraine nearly a year ago. The two countries are within a missile strike of the Kremlin, should President Vladimir Putin make good on his threats to retaliate against pro-NATO sentiment in his perceived backyard.Turkey’s NATO allies are in a difficult position: The government in Ankara has insisted that the two Nordic nations stop offering refuge to Kurdish rebels opposed to the Erdogan government. And Erdogan has branded the opponents as terrorists who must be arrested and punished.The Biden administration remains “deeply concerned” over the abuse of free expression and other human rights in Turkey, officials say, but is inclined to eventually go ahead with the sale.“When it comes to the F-16s, President Biden said that as a general matter, he believes that we should sell Turkey the F-16 jets and modernize their existing fleet as well,” State Department spokesman Ned Price said.But, he added, “this is a process that involves Congress, of course, and … I don’t think I’m betraying any secrets, because our partners on the Hill have been quite vocal about this as well ... there are strong opinions on the Hill.”Those voices are led by Sen. Robert Menendez (D-N.J.), who chairs the Senate Foreign Relations Committee and in theory has the power to stop arms deals with foreign nations.“President Erdogan continues to undermine international law, disregard human rights and democratic norms, and engage in alarming and destabilizing behavior in Turkey and against neighboring NATO allies,’’ Menendez said in a statement late last week, after news of the informal notification of the sale to Turkey circulated.“Until Erdogan ceases his threats, improves his human rights record at home — including by releasing journalists and political opposition — and begins to act like a trusted ally should, I will not approve this sale,” Menendez added.There are ways Biden can get around a congressional block on weapons transfers, through executive action or other steps, but State Department officials appear reluctant to pursue that course.After his meetings in Washington, Cavusoglu spoke to Turkish reporters and acknowledged that the Sweden-Finland NATO question was looming over the talks but said it should not be a condition of the F-16 sale.“What is important here is whether the administration will be decisive or not,” Cavusoglu told Turkish state TV broadcaster TRT.“The administration should not waste such an important deal between two allies just because one person or a few people are blocking it,” he added. “It should not bow down.”Turkey is also a troublesome ally for the U.S. because of its friendliness to Russia, including expansive trade, the pursuit of arms deals with Moscow and an alliance with Russian forces in Syria. Turkey’s acquisition of an air defense system from Russia six years ago led to Western sanctions amid fears Moscow could use the access to spy on NATO assets.But Turkey’s relationship with Russia also gives it a role in potential diplomacy to end Putin’s war in Ukraine. Washington credits Ankara with opening up a corridor through the Black Sea to allow Ukraine to export millions of tons of grain to world markets despite a Russian blockade. At the same time, Erdogan has refused to join the West’s imposition of tough sanctions on Moscow for its attacks on Ukraine. PoliticsWorld & Nation Newsletter Get Group Therapy Life is stressful. Our weekly mental wellness newsletter can help. Enter email address Sign Me Up You may occasionally receive promotional content from the Los Angeles Times. Tracy Wilkinson Follow Us Twitter Instagram Email Facebook Tracy Wilkinson covers foreign affairs from the Los Angeles Times’ Washington, D.C., bureau. Show Comments More From the Los Angeles Times Politics Supreme Court justices interviewed as part of leak probe California Kamala Harris visits L.A. stormwater project in wake of record-setting rains Politics DeSantis violated U.S. and state constitutions, but prosecutor he ousted won’t be reinstated, judge rules Politics March for Life returns to Washington, D.C., with new post-Roe vs. Wade focus Subscribers Are Reading Climate & EnvironmentFor Subscribers Want to solve climate change? This California farm kingdom holds a key California Environmental rules stoke anger as California lets precious stormwater wash out to sea California Former L.A. Councilmember Jose Huizar pleads guilty in corruption case Advertisement Latest Politics Politics Column: The fight to replace Feinstein is going to be nasty, personal and very expensive PoliticsFor Subscribers Karen Bass and Kevin McCarthy are old political pals. Does that mean anything anymore? Politics Kansas man convicted of threatening to kill Republican congressman Politics Federal judge fines Trump and his lawyer $938,000 for ‘completely frivolous’ lawsuit Politics Arkansas legislative panel advances bill to restrict drag performances AdvertisementAdvertisementAdvertisementAdvertisementAdvertisementAdvertisementAdvertisement Advertisement Subscribe for unlimited access Follow Us Twitter Instagram YouTube Facebook eNewspaper Coupons Find/Post Jobs Place an Ad Media Kit: Why the L. A. Times? Bestcovery Crossword Obituaries Recipes L.A. Times Compare L.A. Times Store Wine Club About/Contact For the Record L.A. Times Careers Manage Subscription Reprints and Permissions Site Map Copyright © 2023, Los Angeles Times | Terms of Service | Privacy Policy | CA Notice of Collection | Do Not Sell or Share My Personal Information", "date": "Fri, 20 Jan 2023 13:00:16 GMT", "url": "https://www.latimes.com/politics/story/2023-01-20/fighter-jets-nato-congress-and-the-war-in-ukraine-complex-issues-roil-u-s-turkey-relations"}