{"title": "Here's how the new Parliament will look from inside. See pics - India Today", "content": "Here's how the new Parliament will look from inside. See pics - India Today India TodayDailyOIndiaTodayNEMalayalamBusiness TodayAaj TakLallantopBanglaGNTTViChowkReader’s DigestSports TakCrime TakAstro TakGamingHarper's BazaarBrides TodayCosmopolitanIshq FMAaj Tak CampusKisan TakMagazineLIVELive TVSearchSEARCHTRENDING TOPICSSIGN INDark ModeHomePersonaliseLive TVIndiaWorldBusinessTechnologyShowbuzzSportsScienceHealthNews AnalysisHappiness QuestMagazineTrendingNewsMoVideosLifestyleEnvironmentEducationLaw TodayAutoCitiesCrimePodcastsOpinionHoroscopesWeatherInteractivesVisual StoriesCryptoFact CheckDIUPhotosCode of EthicsNewsNewsIndiaHere's how the new Parliament will look from inside. See picsHere's how the new Parliament will look from inside. See picsThe central government released photos from inside the new Parliament, which is likely to be inaugurated in March this year.AdvertisementIndia Today Web DeskNew Delhi,UPDATED: Jan 21, 2023 00:34 ISTThe central government released the first look from inside the new parliament building.By India Today Web Desk: The central government has released the first look from inside the new Parliament building. The new Parliament is likely to be inaugurated in March this year.The house is built to accommodate the growing number of elected representatives due to delimitations over the last few decades. It is being constructed with bigger halls, a library and convenient parking spaces. The meeting rooms and offices will be equipped with the most recent technologies in the new Parliament.advertisementLast year, Prime Minister Narendra Modi unveiled the National Emblem cast on the roof of the new Parliament building.PHOTOS FROM INSIDE PARLIAMENT Lok Sabha of the new Parliament.The new Lok Sabha will have seating space for 888 MPs, and the Rajya Sabha, for 384 MPs. There will be space for additional seating (to be brought in) as well—the new Parliament building will be able to accommodate 1,382 people in the Lok Sabha. MPs will be able to sit there during the President’s address or during joint sessions of Parliament. Rajya Sabha of the new Parliament.On December 10, 2020, PM Narendra Modi laid the foundation stone of the new Parliament building in Delhi, at an event that was attended by leaders from various political parties, Cabinet ministers and ambassadors of different countries.The estimated cost of construction of the Parliament building is Rs 971 crore. This includes everything from construction to safety equipment and all other features. The new Parliament will represent the diversity of modern India. The central government has claimed that as of now, more than 23 lakh jobs were generated for the construction of the new Parliament. Committee room of the new ParliamentThe new Parliament will have a technologically advanced committee room that will accommodate the latest audio-visual system. Library in the new Parliament.The new Parliament to have library that would also store the archive materials along with the books. The central lounge The central lounge is being created to complement the open courtyard, which will have the national tree, Banyan. Constitution hallThe new Parliament building to have a state-of-the-art constitutional hall. Ultra modern office spacesadvertisementThe building will have ultra modern office space with secure and efficient communication technology.ALSO READ | How artisans from Kashmir will add to grandeur of India’s new Parliament --- ENDS --- Edited By: Rajeev SinghPublished On: Jan 20, 2023Listen to this storyWatch Live TV AdvertisementAlso Watch1:22BBC defends documentary on PM Modi, calls it 'rigorously researched'0:57Amitabh Bachchan meets football legends Ronaldo, Messi, Mbappe5:17Will Virat Kohli break Sachin Tendulkar's record of 100 international hundred?1:45Meet engineer chai wala who is making waves in Haldwani38:42Tussle between India's top wrestlers and WFI escalates, what are demands by protestersAdvertisementRead ThisIOA forms 7-member committee to probe sexual allegations against WFI presidentMan arrested for threatening threatre owners over release of 'Pathaan'Rigorously researched: BBC defends documentary on PM ModiSena symbol row: Poll panel asks Uddhav, Shinde factions to submit written reply by Jan 23Dera chief Gurmeet Ram Rahim granted another parole for 40 daysAdvertisement Follow Us On: Advertisement PUBLICATIONS India Today Business Today India Today-Hindi TIME TELEVISION India Today TV Aaj Tak Good News Today EVENTS Agenda AajTak India Today Conclave Sahitya AajTak RADIO Ishq FM AajTak Radio GAMING India Today Gaming World Esports Cup USEFUL LINKS Press Release Sitemap News Newsletter Privacy Policy Correction Policy PRINTING Thomson Press WELFARE Care Today DISTRIBUTION Rate Card SYNDICATIONS Headlines Today WEBSITES India Today India Today Malayalam India Today NE Business Today DailyO AajTak Lallantop Bangla GNTTV iChowk Reader’s Digest Cosmopolitan EDUCATION Vasant Valley Best Colleges Best Universities Download App ABOUT US CONTACT US TERMS AND CONDITIONS ARCHIVES Copyright © 2023 Living Media India Limited. For reprint rights: Syndications Today Add IndiaToday to Home Screen", "date": "Fri, 20 Jan 2023 17:42:54 GMT", "url": "https://www.indiatoday.in/india/story/photos-from-inside-new-parliament-how-it-looks-2324299-2023-01-20"}