{"title": "Croatian president blasts EU penalties against Hungary | AP News", "content": "Croatian president blasts EU penalties against Hungary | AP NewsAP NEWS Email:GoListenSectionsU.S. NewsWorld NewsPoliticsSportsEntertainmentBusinessTechnologyHealthScienceOdditiesLifestylePhotographyVideosListenSectionsAP Top NewsU.S. NewsWorld NewsAfricaAsia PacificAustraliaEuropeLatin AmericaMiddle EastPoliticsPresident BidenElection coverageCongressSupreme CourtSportsNFL PlayoffsTennisNBANHLCollege basketballMLBEntertainmentFilm ReviewsMoviesMusicTelevisionFashionBusinessU.S. economyFinancial marketsVideosTechnologyHealthCOVID-19MoreAP InvestigationsClimate and environmentOdditiesPhotographyTravelScienceAP Fact CheckLifestyleReligionPress ReleasesTrending NewsAP Top 25 MoviesNFL PlayoffsRussia-Ukraine warSearchhttps://apnews.com/article/russia-ukraine-politics-hungary-government-croatia-2a9de57bde587c11a2cadc90337dc2f4Click to copyhttps://apnews.com/article/russia-ukraine-politics-hungary-government-croatia-2a9de57bde587c11a2cadc90337dc2f4Click to copyRelated topicsPoliticsHungary governmentCroatia governmentWorld NewsHungaryEuropeBusinessCroatiaEuropean UnionCroatian president blasts EU penalties against HungaryBy JUSTIN SPIKEJanuary 20, 2023 GMT1 of 3Hungarian President Katalin Novak, right, receives Croatian President Zoran Milanovic, left, with military honours at the parliament building in Budapest, Hungary, Friday, Jan. 20, 2023. (Noemi Bruzak/MTI via AP)1 of 3Hungarian President Katalin Novak, right, receives Croatian President Zoran Milanovic, left, with military honours at the parliament building in Budapest, Hungary, Friday, Jan. 20, 2023. (Noemi Bruzak/MTI via AP)BUDAPEST, Hungary (AP) — Croatia’s president said Friday that efforts by the European Union to uphold democratic standards in member countries threatened to tear the bloc apart, and condemned EU efforts to financially penalize Hungary for its alleged breaches of rule of law standards. President Zoran Milanović made the statements during a news conference in Hungary’s capital Budapest following talks with his Hungarian counterpart Katalin Novák. Milanović echoed frequent Hungarian criticism of the EU, saying the bloc was overreaching in its powers over member states and that this excessive control had precipitated Brexit and driven the United Kingdom out. The EU shouldn’t become, he said, a “United States of Europe,” adding that EU procedures against Hungary — which have frozen billions of euros in funding to Budapest over corruption and rule of law concerns — threatened to destroy the 27-member bloc. ADVERTISEMENT“This sort of approach (between the EU and Hungary) is deeply irritating,” he said, warning that “today it is Hungary, tomorrow it will be some bigger country that will need to be ‘taught a lesson.’”Milanović won the presidential election in Croatia in late 2019 as a liberal and left-leaning candidate, a counterpoint to the conservative government currently in power in the newest EU member state. But he has since made a turn to populist nationalism, and criticized Western policies both toward the Balkans and Russia.Russia-Ukraine warUkraine's Zelenskyy honors those killed in helicopter crashGerman caution on Ukraine arms rooted in political cultureRussia claims progress in eastern Ukraine; Kyiv craves tanksEx-SEAL dies in Ukraine; 6th known American killed in warMilanović has thus developed a reputation as pro-Russia, which he has denied. Yet in recent months, he has openly opposed the admission of Finland and Sweden into NATO amid the war in Ukraine, and the training of Ukrainian troops in Croatia as part of EU aid to the embattled country.While the heads of state said they both condemn Russian aggression in Ukraine and support its territorial integrity, Milanović said he, like Hungary’s government, doesn’t support sanctions against Moscow, and characterized the conflict in Ukraine as a proxy war between Russia and the United States.“The question is how much damage (sanctions) will bring upon us. It creates damage to Europe,” Milanović said. “We managed to bring Russia and China closer together. In whose interest is this? All those questions will have to be answered to me, especially by those who are making those decisions in my name. I demand an answer.” ADVERTISEMENTNovák on Friday told the news conference that she welcomed Croatia’s Jan. 1 entrance into the 27-country Schengen Area, a zone of border-free travel in Europe.With the entrance of Croatia into the zone, a border fence separating Hungary and Croatia was subsequently dismantled, a change that Novák said would grow tourism and ease travel between the neighboring countries and move the EU’s external borders further to the south. Novák also called on Ukrainian authorities to respect the rights of the Hungarian ethnic minority in the western Ukrainian region of Transcarpathia, where she said that Hungarian flags had been recently removed from public institutions in what she called a restriction of minority rights.___Jovana Gec contributed to this report from Belgrade, Serbia. AP NEWSTop StoriesVideoContact UsAccessibility StatementCookie SettingsDownload AP NEWSConnect with the definitive source for global and local newsMore from APap.orgAP InsightsAP Definitive Source BlogAP Images SpotlightAP ExploreAP BooksAP StylebookFollow APThe Associated PressAboutContactCustomer SupportCareersTerms & ConditionsPrivacyAll contents © copyright 2023 The Associated Press. All rights reserved.", "date": "Fri, 20 Jan 2023 15:33:06 GMT", "url": "https://apnews.com/article/russia-ukraine-politics-hungary-government-croatia-2a9de57bde587c11a2cadc90337dc2f4"}