{"title": "U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' - The Moscow Times", "content": "U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' - The Moscow Times Support The Moscow Times! Contribute today My account Signout × Sections Home Ukraine War News Opinion Business Arts and Life Podcasts Galleries Newsletters TMT Lecture Series Multimedia projects Mothers & Daughters Generation P News Ukraine War Business Opinion Arts and Life Podcasts Newsletters RU My account Signout Support The Moscow Times! Contribute today Now is the time to support independent reporting from Russia! Contribute Today U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' By AFP Jan. 21, 2023 A Wagner soldier in the Ukrainian town of Soledar. TASS The United States on Friday designated Russia's Wagner mercenary group a \"transnational criminal organization,\" piling pressure on the private Russian army fighting in Ukraine. White House national security spokesman John Kirby said Wagner, controlled by Yevgeny Prigozhin, a businessman close to President Vladimir Putin, has about 50,000 fighters in Ukraine, 80% of them drawn from prisons. Kirby showed U.S. intelligence photographs of North Korea supplying arms to Wagner for its Ukraine operations, and said the private army has become a rival to the formal Russian military. The photographs, from Nov. 18-19, show Russian rail cars entering North Korea, picking up a load of infantry rockets and missiles, and returning to Russia, he said. He said the U.S. Treasury was formally designating Wagner as a transnational criminal organization, putting it on the same level as Italian mafia groups and Japanese and Russian organized crime syndicates. The designation will allow the wider application of sanctions on the group's sprawling global network, which includes mercenary operations as well as businesses in Africa and elsewhere. Wagner \"is a criminal organization that is committing widespread atrocities and human rights abuses,\" Kirby said. \"We will work relentlessly to identify, disrupt, expose and target those who are assisting Wagner.\" Kirby also said the U.S. had presented its intelligence on Wagner's North Korean purchase to the United Nations Security Council's unit on North Korea sanctions. news As Russia Claims Win, Analysts Say Capture of Soledar Is ‘Pyrrhic Victory’ Read more The arms transfers from North Korea are in direct violation of UN Security Council resolutions, Kirby said. Kirby said there is evidence that Prigozhin's confidence in Wagner fighters' relative success in Ukraine has generated tensions in the Kremlin. \"Wagner is becoming a rival power center to the Russian military and other Russian ministries,\" Kirby said. \"Prigozhin is trying to advance his own interest in Ukraine and Wagner is making military decisions based largely on what they will generate for Prigozhin, in terms of positive publicity.\" Prigozhin has claimed credit for Russian advances over several months towards the eastern Ukraine city of Bakhmut, including the capture last week of neighboring Soledar. On Thursday, Prigozhin said in a press statement Russia has \"a lot to learn\" from Ukraine's army. But he insisted \"the settlement of Artemovsk will be captured,\" using the Russian name for Bakhmut. Wagner was founded in 2014 and has been involved in conflicts in Africa, Latin America and the Middle East. Wagner fighters are tough and disciplined, Prigozhin says, but are brutally punished if they flee the battle. news Russian Ex-Wagner Commander Flees to Norway, Seeks Asylum – Reports Read more But his infighting with other officials in the Kremlin could be hurting him. According to the U.S. Institute for the Study of War, Putin \"is increasingly siding with\" Prigozhin's rivals in high-level power circles. Putin has also not directly credited Wagner with the Bakhmut area successes, it noted. \"Putin is likely attempting to reduce Prigozhin’s prominence in favor of the re-emerging professional Russian military and Russian government officials,\" the group said Thursday. Known as \"Putin's chef\" for having catered events for the Russian strongman since both were in St. Petersburg in the 1990s, Prigozhin, 61, has been in U.S. sights for years. He was indicted by the U.S. Justice Department in 2018 for interference in the U.S. presidential election two years earlier by the Internet Research Agency and Concord Management and Consulting, two businesses he owns. He and his companies are also under U.S. and European sanctions for various activities. Read more about: Ukraine war , Wagner Most read Just in Jan. 21, 2023 Pumpkin Surprise for a Bride, Groom or Guest Jan. 21, 2023 Russian Emigres Rally Worldwide in Support of Jailed Navalny Jan. 21, 2023 Russia Says Held Air Defense Training in Moscow Region Jan. 21, 2023 U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' Jan. 20, 2023 Chechen Leader Calls Rumored Ban on Beards in Russian Army ‘Provocation’ Jan. 20, 2023 How Russia’s War Is Impacting the Global Environmental Agenda Jan. 20, 2023 St. Petersburg Artwork Celebrating City's Ties to Mariupol Removed 1 international sanction U.S. Designates Russia's Wagner Mercenaries a 'Criminal Organization' 2 spreading war Russia Says Held Air Defense Training in Moscow Region 3 ‘not silent’ Russian Emigres Rally Worldwide in Support of Jailed Navalny 4 weekend kitchen Pumpkin Surprise for a Bride, Groom or Guest Read more power struggle As Russia Claims Win, Analysts Say Capture of Soledar Is ‘Pyrrhic Victory’ Russia’s Defense Ministry claimed that its forces had won a significant victory on Friday with the capture of the eastern Ukrainian town of Soledar... missing volunteer Wagner Says Recovered British Aid Worker’s Body in Ukraine Frontline Town Russia’s Wagner private military group said overnight that it found the body of one of two British aid workers who went missing in eastern... 'cauldron' of fighting Wagner Boss Claims Control of Eastern Ukraine’s Soledar Amid Ongoing Battles The leader of Russia’s Wagner mercenary group claimed the capture of the eastern Ukrainian town of Soledar early Wednesday, with heavy fighting... military discipline Russian Officer Who Feared Execution After Troop Desertion Found Dead A former Russian prisoner who had his jail sentence reduced to allow him to serve in the Russian military in Ukraine has been confirmed dead after claiming... The Moscow Times About us Jobs Advertise with us Privacy Policy Your Personal Information Change Consent Podcasts Videos Galleries Newsletters Follow us Media Partners Faridaily Coda Story Eurasianet Novaya Gazeta Europe The Bell The Eurasian Climate Brief Carnegie Endowment TV Rain Newsroom © The Moscow Times, all rights reserved.", "date": "Sat, 21 Jan 2023 08:15:56 GMT", "url": "https://www.themoscowtimes.com/2023/01/21/us-designates-russias-wagner-mercenaries-a-criminal-organization-a80002"}