{"title": "Meet the man set to replace Jacinda Ardern as New Zealand PM", "content": "Meet the man set to replace Jacinda Ardern as New Zealand PMIE 11 is not supported. For an optimal experience visit our site on another browser.SKIP TO CONTENTNBC News LogoPoliticsU.S. NewsWorldCulture and trendsBusinessTechHealthNBC News TiplineShare & Save —SearchSearchProfile My NewsSign Out Sign InCreate your free profileSectionsCoronavirusU.S. NewsPoliticsWorldLocalBusinessHealthInvestigationsCulture MattersScienceSportsTech & MediaVideo FeaturesPhotosWeatherSelectAsian AmericaNBCBLKNBC LatinoNBC OUTtvTodayNightly NewsMSNBCMeet the PressDatelineFeaturedNBC News NowThinkBetterNightly FilmsStay TunedSpecial FeaturesNewslettersPodcastsMore From NBCCNBCNBC.COMNBCU AcademyNBC LearnPeacockNEXT STEPS FOR VETSParent ToolkitNBC News Site MapHelpFollow NBC NewsSearchSearchFacebookTwitterEmailSMSPrintWhatsappRedditPocketFlipboardPinterestLinkedinMy NewsManage ProfileEmail PreferencesSign OutWorldMeet the man set to replace Jacinda Ardern as New Zealand PMChris Hipkins was the sole candidate for the ruling Labour Party, and is currently the minister for police, education and public service. Chris Hipkins became a household name leading the nation's closed-border crackdown on Covid-19.Marty Melville / AFP - Getty ImagesLink copiedJan. 21, 2023, 9:59 AM UTC / Source: ReutersBy ReutersChris Hipkins, who played a significant role in New Zealand’s response to the Covid-19 pandemic, is set to replace Jacinda Ardern as prime minister after emerging on Saturday as the only candidate to lead the ruling Labour Party.Hipkins, 44, is expected to be confirmed as leader at a meeting of Labour’s 64 lawmakers, or Caucus, on Sunday, succeeding Ardern, who made a surprise announcement on Thursday that she had “no more in the tank” to lead the country and would step down.“I think we’re an incredibly strong team,” Hipkins told a news conference after the party announced him as the sole candidate.“We’ve gone through this process with unity and we’ll continue to do that. I’m feeling really fortunate to be working with such an amazing group of people who have a real commitment to the service of the people of New Zealand.”Known as “Chippy”, Hipkins built a reputation for competence in tackling Covid-19 and was a troubleshooter for Ardern when other cabinet ministers were struggling.He would not be drawn on his policy plans. A cabinet reshuffle proposed by Ardern would go ahead, but he said he planned to keep Grant Robertson as finance minister.New Zealand Prime Minister Jacinda Ardern leaving officeJan. 20, 202301:47Hipkins said he had spoken to Australian Prime Minister Anthony Albanese, who tweeted the two had had “a warm discussion”.First elected to parliament for the Labour Party in 2008, Hipkins became a household name fronting the government’s response to the pandemic. He was appointed health minister in July 2020 before becoming the Covid response minister at the end of the year.He is now minister for police, education and public service, as well as leader of the House.A Horizon Research snap poll obtained by local media organization Stuff on Friday showed Hipkins was the most popular potential candidate among voters, with the backing of 26% of those surveyed.While Ardern was popular early in her five-year tenure, her ratings have slid on a backlash to strict Covid curbs, rising living costs and mortgage rates, and concerns about crime.He is now minister for police, education and public service, as well as leader of the House.A Horizon Research snap poll obtained by local media organization Stuff on Friday showed Hipkins was the most popular potential candidate among voters, with the backing of 26% of those surveyed.While Ardern was popular early in her five-year tenure, her ratings have slid on a backlash to strict Covid curbs, rising living costs and mortgage rates, and concerns about crime.ReutersAboutContactHelpCareersAd ChoicesPrivacy PolicyDo Not Sell My Personal InformationCA NoticeTerms of ServiceNBC News SitemapAdvertiseSelect ShoppingSelect Personal Finance© 2023 NBC UNIVERSALNBC News LogoMSNBC LogoToday Logo", "date": "Sat, 21 Jan 2023 09:59:25 GMT", "url": "https://www.nbcnews.com/news/world/jacinda-ardern-new-zealand-prime-minister-chris-hipkins-covid-19-rcna66822"}